[
 {
  "slug": "0-introduction-2015-11-15t15-16-34",
  "title": "0 Introduction @2015-11-15T15;16;34",
  "summary": "Don's introduction to his \"About Education\" project, establishing that while families and individuals bear primary responsibility for education, the topic is important and complex enough to warrant professional expertise and societal support. This philosophical statement reflects his career-long conviction that education requires systematic attention and informed leadership.",
  "content_preview": "Introduction\n\n\n\n\n\n\n\n\n\n\n\nThe\nresponsibility for a person’s education rests first with family and\nlater with the individual himself or herself, but it is such an\nimportant issue and so complex that most homes and most individuals\nneed help.  Governments help, especially with education for the\nyoung, for two reasons, (1) to encourage and support citizens to\ndevelop their personal capabilities and (2) to ensure that our\ncommunities have the people needed to sustain themselves\n\n\n\n\n\n\nIt\nis important, I believe, to have a simple framework for making\ndecisions. the notes that follow describe mine.  Each of us should\ndevelop our own; the notes that follow are a brief description of\nmine.  I present it, not for others to follow, but as an example of\nwhat I have found helpful.  First, a few definitions: \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCONTENTS\n\n\n\n\n\n\nSchool\nsystem components\n\nHealth\nsystem components\n\nSchool\nsystem components\n\nEducation\nsystem, components\n\nPost\ninstitutional system\n\nSchool\nautonomy\n\nQuality\nEducation\n\nBeliefs\n\nCredentials\n\nQualifications\n\nTimewasters\n\nOBE\n\nGood\neducation\n\nChange,\nenabling\n\nEducation\nadvisor\n\nEducation\nsoft spots\n\nIssues\nin Education\n\nEngagement\n\nChanges,\nlow budget\n\nAlignment\n\n\n\n\nDACUM",
  "size": 7882,
  "content_length": 1382,
  "garbage_ratio": 0.0
 },
 {
  "slug": "06-community",
  "title": "06 Community",
  "summary": "This extensive document (spanning ~5800 words) provides comprehensive history of Black River as Don recalls it. Coverage includes the physical geography of the river, early settlement by United Empire Loyalists and Scottish settlers post-1776, the progression from forestry to farming, and economic activities including shipbuilding, lumber, and fishing. Don documents place names (Upper Black River, Middle Black River, Little Branch, Fowlie's Mill, McKenzie Settlement), major institutions (four schools, two churches, community hall), the mill economy (Fowlie's gristmill and sawmill, John W. MacNaughton's operation), and the impact of WWII on community stability. He includes personal economic data from his brother Walter's 1947-48 record book showing butter prices (45 cents/lb), egg prices (30 cents/dozen), and woodcutting/threshing crew practices. The document captures Don's detailed knowledge of community infrastructure and traditional rural life before modernization.",
  "content_preview": "THE COMMUNITY OF BLACK RIVER IN 1939\n\n\n\n\n\n\n\nAlthough these notes focus on the community in 1939, a bit of background may be in order.\n\n\n\n\nThe Black River\n\n\n\n\nThe Black River is about 7 miles south of Chatham, New Brunswick and, like most rivers in Eastern New Brunswick, flows from west to east eventually emptying from the south into Bay du Vin which is part of the Miramichi River estuary.  Black River is thought to have received its name xxx.  The Eastern boundary of the Black River was the Victoria Bridge near its mouth although technically the river extends beyond the bridge before melding with the waters of the Bay du Vin.  The Black River has many tributaries the largest being the Little Black River, better known as Little Branch. Which joins the Black River near its mouth.  \n\n\n\n\nThe Black River area was, and to a large extent still is, heavily forested with black, red and white spruce and balsam fir, some pine, white and yellow birch, maple, beech with a scattering of ash, xx.  While the forests were and continue to be significant, Black River began to switch from forestry to farming earlier than some of its neighbouring communities.\n\n\n\n\n\n\n\nA Brief History\n\n\n\n\nAlthough land had been granted along the shores from Hexham east, settlement of the Black river only occurred after the turn of the century and by 1850 settlers could be found as far west as the Meadows near the headwaters of the river.  \n\n\n\n\nThe first settlers were United Empire Loyalists who, after the American Revolution of 1776, sailed north along the New England coast and, for the most part, entered the Bay of Fundy landing at Saint John, New Brunswick.  Many moved up the Saint John River with some crossing to the east coast via the upper reaches of the Miramichi; others came directly to the Miramichi.    Loyalists were soon followed by settlers from the old country - most were Scottish and Presbyterian.  After six to eight weeks on the ocean, they set foot in the New World.  Some after an initial se...",
  "size": 49458,
  "content_length": 34103,
  "garbage_ratio": 0.0054
 },
 {
  "slug": "20-east-or-west",
  "title": "20 East or West",
  "summary": "A detailed autobiographical narrative covering Don's 1969 decision to move to Prince Edward Island. Describes his departure from Ottawa's Training Branch (1962-1968) due to restructuring and loss of collegiality, his interview process for a Nanaimo community college presidency, and his deliberate choice to decline British Columbia in favor of PEI after an unsatisfactory conditional job offer. Demonstrates his character: intellectual rigor (organizational theory from Indiana), respect for organizational culture, and principled decision-making. Includes memorable anecdote about the Board's assumption that \"given the opportunity, one would choose BC over any other offer.\"",
  "content_preview": "East or West\t\t\n\n\n\n\n\n\n\nPeople leave current jobs or positions more often than they seek new ones.  That was certainly the case with my leaving Ottawa in 1969.\n\n\n\n\nBy the end of spring semester, 1962, my course work at Indiana University in Bloomington, Indiana, was completed, a thesis topic approved but the actual writing had not started.  Carol had worked ever since we were married, but now we had an addition to our family, a six month old baby boy.  I sought full time work.\n\n\n\n\nCanada had just launched a major program to provide both operational and capital support for technical and vocational training and the Federal Government was adding staff; on July 2, 1962, I joined the Training Branch, Department of Labour in Ottawa.  Most of the people in the Branch were specialists – vocational high school, apprenticeship, educational upgrading, technical training, occupational training and occupational analysis.  My assignment was in the area of vocational teacher training; it was a new initiative and an exciting place to work.\n\n\n\n\nSix years later, however, matching grants had lost favour and a seat purchase arrangement was initiated.  The collegial atmosphere of the Training Branch and the partnership with the Provinces had evaporated.  In fact, the Training Branch was being downsized and perhaps even phased out while training decisions were being made at the Regional level.  Finally, all, or practically all, of the senior staff were replaced and people with a training background were not greatly valued.  In addition, I had lost confidence in the newly appointed Branch Director and began to think about moving.  But where?\n\n\n\n\nIn another recollection I told about meeting Dr. Ted Sheffield and learning about the proposed College in Prince Edward Island.  About the same time I learned about and applied for the presidency of a new community college being established in Nanaimo, British Columbia.   It sounded challenging.\n\n\n\n\nAn invitation came from British Columbia to partic...",
  "size": 9691,
  "content_length": 5474,
  "garbage_ratio": 0.006
 },
 {
  "slug": "2004-education-or-schooling",
  "title": "2004-Education or Schooling",
  "summary": "A thought-piece dated July 24, 2004, in which Don challenges the common conflation of education with schooling. Drawing on Good's Dictionary and quotations from George Bernard Shaw and Bud MacDougall, Don argues that education encompasses learning from home, church, peers, travel, and community—not just formal schooling. He critiques schools for narrowly focusing on academic disciplines and advocates for including teamwork, problem-solving, and life skills in educational transcripts and student evaluation.",
  "content_preview": "July 24, 2004\n\n3-Education or Schooling\n\n\n\n\n\n\n\nRecently my wife mentioned that a daughter of a friend, or a friend of a friend’s daughter, had difficulty finding a job.  My wife commented further that she was surprised, in that the young lady in question “had a good education”.   I asked, “How do you know?”  My wife replied, “She has a Master’s Degree from” and she named the university.  I responded, “I understand that, but how do you know that she has a good education?”   This points to a very common bit of faulty thinking that permeates the field of education.  We do not confuse hospitalization with good health, religion and church attendance or court appearances with citizenship.  Why, therefore, do we confuse education and schooling?  Is it sloppy thinking or is it a deliberate scheme by educators to blur the lines?\n\n\n\n\nGood’s Dictionary of Education defines schooling as “individual training or education received at an educational institution, military or civilian.”  Education, on the other hand is defined as “the aggregate of all process by means of which a person develops abilities, attitude and other forms of behaviour of positive value in the society in which he lives.”  Obviously schooling is part of one’s experience, and, therefore, part of one’s education.\n\n\n\n\nGeorge Bernard once said, “From a very early age, I had to interrupt my education to go to school”.  Bud MacDougall, an icon of Canadian business now deceased, added, “ I left school at 14 and I’ve regretted it all my life.  Should have left when I was twelve.” I am sure we have all heard the comment that we should bestow a degree on every newborn so that the process of getting an education would not be disturbed in later life.  One might also give each newborn a high school graduation certificate.\n\n\n\n\nI am not knocking the value of schools; they are a major contributor towards one’s education.  But so are the home, church, peers, travel, the community and others.  The popular view is we get our edu...",
  "size": 9109,
  "content_length": 4795,
  "garbage_ratio": 0.0083
 },
 {
  "slug": "2011-03-01-viewd-and-vignettes",
  "title": "2011-03-01 viewd and vignettes",
  "summary": "Another version of \"Holland College: Views and Vignettes - As I Remember\" (ISBN 978-0-9739752-2-2, 2011), dated March 1, 2011. Contains identical structure and content as other 2011 versions, showing Don's iterative refinement of the manuscript through early 2011. Title page shows \"Charlottetown, PEI\" and the testimonial from Malcolm S. Knowles about Holland College being a prototype for future higher education.",
  "content_preview": "As\nI Remember:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHolland\nCollege:\n\nViews\nand Vignettes \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald E. M. Glendenning\n\n\nCharlottetown, PEI\n\n\nISBN 978-0-9739752-2-2\n\n\n2011\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTestimonial\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I have been telling educators around the world that I view\nHolland College to be the prototype of what all higher education will\nbecome as we move towards the 21st century”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMalcolm S. Knowles\n\n\nProfessor Emeritus of Adult and\n\n\n       Community College Education\n\n\nNorth Carolina State University\n\n\n1977\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDedication\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo \n\n\n\nThe Holland College Family,\n\n\nThe People Who Made It\nHappen\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nINTRODUCTION\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI’ve\nresisted the temptation to write a book, especially a book about\nHolland College, although I have often entertained the idea and have\nbeen encouraged to do so by friends and colleagues alike. I’ve not\ndone so for several reasons.  First of all, doing justice to the\nsubject would take a great deal of effort of a kind and at a level\nthat I was not willing to expend.  Secondly, while I believe my\nwriting is clear and factual, that style does not translate into\ninteresting reading.  Thirdly, I was so intimately involved with the\ndevelopment of the College that, even with the best of intentions, my\nint...",
  "size": 535143,
  "content_length": 275065,
  "garbage_ratio": 0.0
 },
 {
  "slug": "2011-biographical-notes",
  "title": "2011 Biographical notes",
  "summary": "*",
  "content_preview": "Donald Glendenning\n\n 62 Queen Elizabeth Dr.\n\nCharlottetown, P.E.I.\n\nCIA 3A9 Canada\n\n\n\n\nTel: (902) 892-5859\n\n\n\n\nBIOGRAPICAL NOTES\n\n\n\n\nSCHOOLING\n\nIndiana University, Bloomington, Indiana. 1960-1962, PhD in Education 1964\n\n\n\n\nBradley University, Peoria, Illinois, summer school 1953 plus, full time 1956-57; BSc. (Education);  Education 1957; MSc (Education) 1958;\n\n\n\n\nUniversity of London, Institute of Education, London, England, 1955-56, Certificate of Education 1956\n\n\n\n\nNew Brunswick Institute of Technology, Moncton, NB, 1949-1951  Vocational Teacher’s License, 1951\n\n\n\n\nTeachers’ college, Fredericton, NB, Jan to June, 1947 Academic Teachers’ License, 1947\n\n\n\n\nMiramichi Rural High School, Miramichi, NB, 1941-1946\n\n\n\n\nLittle Branch School, Little Branch, NB, 1035-1941\n\n\n\n\n\n\n\nWORK EXPERIENCE CHRONOLOGICALLY)\n\n\n\n\n\n\n\n\n\n\nPERSONAL\n\n\n\n\nBorn September 8, 1929, the youngest of 10 children of Elmer and Jane (Watling) Glendenning of Little Branch, Black River Bridge, Northumberland County, New Brunswick.  Grew up on a small mixed farm, attended the Little Branch School and graduated from the Miramichi Rural High School, the first of a series of rural high schools in the Province.  Participated in the usual farm chores of taking care of animals, planting and harvesting, winter woods work and farm maintenance.  Attended St. Paul’s Presbyterian Church, Sunday school and Young Peoples group.  Enjoyed cubs, scouts, 4H, fishing and swimming, etc.  While in high school, earned spending money through selling oil, grease, paint, etc to neighbours and upon graduation, worked loading pulp and pit props at the port of Chatham and Newcastle\n\n\n\n\nIn 1958, I married Carol Chesney of Peoria, Illinois and we have two children Brian and Janet, two grandchildren, Lisa and Laura, a daughter-in-law, Marie, and a son-in-law, Mike.\n\n\n\n\n\n\n\nEARLY YEARS\t\n\n\t\n\nIn January, 1947, I enrolled in Teachers’ College in Fredericton, New Brunswick and in September 1947 commenced teaching in a one-room school at Kouchi...",
  "size": 13995,
  "content_length": 9682,
  "garbage_ratio": 0.0042
 },
 {
  "slug": "6-bio-notes-4-2012",
  "title": "6-Bio notes-4, 2012",
  "summary": "A 2012 biographical statement with full credentials (C.M. Ph.D designation). Comprehensive overview from childhood in Little Branch through teaching career, federal training specialist role, and 18-year tenure as Holland College founding president (1969-1987). Emphasizes the College's international reputation for innovative competency-based education. Details post-retirement consulting, contributions to Canadian Vocational Journal and Community Foundation publications. Lists honors: Order of Canada, Atlantic Canada Innovator Award finalist, UPEI honorary degree. Notes family: married to Carol Chesney of Peoria, Illinois; two children and two grandchildren.",
  "content_preview": "Donald Ernest Malcolm Glendenning, C.M. Ph.D\n\n62 Queen Elizabeth Drive\n\nCharlottetown, PE  C1A 3A9\n\n\n\n\n\n\n\nDonald Glendenning was born and raised in New Brunswick and taught at the elementary, secondary and postsecondary level.  He attended the Little Branch School, is a graduate of the Miramichi Rural High School, Teachers' College and the New Brunswick Institute of Technology (now the New Brunswick Community College) and studied at the University of London (England) on a Lord Beaverbrook Overseas Scholarship.  He holds a B.Sc. and MSc. from Bradley University and a Ph.D. from Indiana University.  Dr. Glendenning taught at the elementary, secondary and post-secondary level, and worked as a training specialist in Ottawa for a number of years with the Department of Labour and the Department of Manpower and Immigration.\n\n\n\n\nIn 1969 Dr. Glendenning moved to Prince Edward Island to become the Founding President of Holland College, a college of applied arts and technology.  In this capacity, he played a leadership role in the founding of the College and in implementing competency based education.  The College acquired an international reputation for its innovative approach to education.\n\n\n\n\nIn 1987 Dr. Glendenning retired from Holland College and operated a consulting firm with projects both in Canada and overseas.  For a number of years he was a regular contributor to the Canadian Vocational Journal, and edited and published The Family Chronicle and the Community Foundation News.  He also authored and co-authored a number of publications.  His current activities include being a Director of the Community Foundation of Prince Edward Island, genealogy, gardening and reading.  Dr. Glendenning is the recipient of a number of awards and honours including the Order of Canada, Atlantic Canada Innovator of the Year Award Finalist, and holds an honourary degree from the University of Prince Edward Island.  \n\n\n\n\nDon is married to Carol Chesney, of Peoria, Illinois and they have two...",
  "size": 5076,
  "content_length": 2032,
  "garbage_ratio": 0.0054
 },
 {
  "slug": "6-biog",
  "title": "6-Biog",
  "summary": "A substantially similar version to \"6-Bio for Black River 2012.docx,\" emphasizing his rural NB roots, teaching career progression, federal government training specialist role, and Holland College founding presidency. Highlights his publications (Family Chronicle), CVA Journal contributions, Community Foundation newsletter editing, and active involvement in public education advocacy through letters to editors. Describes personal pursuits: genealogy research, gardening, reading, and involvement with the Community Foundation of Prince Edward Island.",
  "content_preview": "Donald E. M. Glendenning\n\n\n\n\nDon Glendenning was born and raised in Little Branch, Black River, New Brunswick.  He attended the Little Branch School and is a graduate of the Miramichi Rural High School. \n\nFor a number of years, he taught in New Brunswick, first at Kouchibouguac, then at the Miramichi Rural High School and the New Brunswick Institute of Technology.  After a number of years as a training specialist with the Federal government, in Ottawa, he moved to Prince Edward Island where he was Founding President of Holland College.  On leaving the College, he operated his own consulting firm taking on projects both in Canada and overseas.\n\n\n\n\nHis formal studies include Teachers’ College in Fredericton, NB, New Brunswick Technical Institute, the University of London (England), Bradley University and Indiana University where he received his Ph.D.  In 1986 he was inducted into the Order of Canada.  Over the years he was active in a number of National organizations including the Canadian Vocational Association, Association of Canadian Community Colleges, and the Institute of Public Administration of Canada.  \n\n\n\n\nFor many years, he was a frequent speaker at conferences, he contributed a regular column to the CVA Journal, edited a newsletter for the Community Foundation of Prince Edward Island, published the Family Chronicle, and recounted recollections about life in Black River.\n\n\n\n\nHe is currently active in The Community Foundation of Prince Edward Island, tracing his roots, reading and puttering around in his garden.  Lately, he has become a frequent writer of letters to the Editor in support of changes in public education.\n\n\n\n\nDon married Carol Chesney from Peoria, Illinois and they have two children and two grandchildren.",
  "size": 4550,
  "content_length": 1755,
  "garbage_ratio": 0.0046
 },
 {
  "slug": "82-whither-bound",
  "title": "82 Whither bound",
  "summary": "Don expresses frustration with education system direction, noting changes often unlinked to improving student skills, knowledge, or attitudes. Reframes education's purpose as helping Islanders develop abilities needed for thriving in daily life, not merely what happens in schools. Questions whether limiting education to government-delivered schooling represents too narrow a vision. Criticizes focus on \"excellence\" without linking to actual learning outcomes. Highlights Saskatchewan Teachers' Federation calls for shared accountability, provincial education councils, and education hubs. Reviews Hechinger Report's coverage of US education trends and contributes financially to the publication. Discusses CVA-ACFP newsletter focus on teacher competencies and university relevance. Reflects Don's broader systemic critique and search for coherent education vision beyond institutional reporting.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 82\t\t\t\t   \t\t\t                                 \n\t      November 20, 2019\n\t\n\n\tNothing\n\tis so unequal as the equal treatment of un-equals – John Terry\n\n\n\n\t\n\n\n\t\n\n\n\n\tWHITHER\n\tBOUND?\n\t\n\n\tIt’s\n\tunclear to me what our education system is up to; we hear about\n\tchanges in schools but seldom are the changes linked to improving\n\tthe skills, knowledge or attitudes of students; to paraphrase\n\tTalleyrand, it’s time for education to establish underlying\n\tprinciples instead of simply reporting changes and announcing\n\tevents.  \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tIslanders\n\tcontribute millions of dollars annually to public education; in\n\treturn, young Islanders receive 12 years of mandatory instruction in\n\tschools; that sounds more like a penalty than a benefit.\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tpurpose of education is to help Islanders develop or enhance skills,\n\tknowledge, attitudes and values needed to thrive in every day life.\n\tLimiting the concept of education to work in schools is a narrow\n\tvision, indeed; and limiting education to what government delivers\n\tthrough those schools is even narrower.\n\t\n\n\t\n\n\n\t\n\t\n\n\tWhile\n\timproving educational excellence (whatever that means), adding\n\ttechnology, and poverty reduction are important, it would be more\n\tmeaningful to me to see them linked to better education. \n\t\n\t\n\n\tPOT\n\tPOURRI\n\t\n\n\tCVA-ACFP\n\t(Sept.-Oct.\n\t2019)\n\t\n\n\tOne\n\tof the better newsletters; this issue had articles about teacher\n\tcompetencies, holistic professional competence and strategies for\n\tuniversities to keep relevant.  Click below to browse the mot recent\n\tissue.\n\t\n\n\t<info@cva-acfp.org>\n\t\n\n\t\n\n\n\t\n\t\n\n\tEducation\n\tReimagined \n\t\n\t\n\n\tSaskatchewan\n\tTeachers’ Federation is calling for changes in public education.\n\tAmong their proposals are shared accountability, a provincial\n\tcouncil on education, education hubs, updated curriculum and shared\n\tpolicy development\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tHechinger Report\n\t\n\n\tThe\n\tHechinger Report helps keep me aware of what’s on the US education\n\tagenda; it is published ...",
  "size": 16475,
  "content_length": 5476,
  "garbage_ratio": 0.0
 },
 {
  "slug": "99-2-rating-scale",
  "title": "99 -2 Rating Scale",
  "summary": "Don recounts observing a handyman's consistent, self-directed, quality work and wonders why schools don't develop similar practical rating scales for employment-bound students and vocational learners. He advocates for rating scales with five or six competency levels that focus on practical attributes (speed, accuracy, initiative, safety, quality) rather than abstract grades. This approach, he argues, enables self-assessment discussion and strengthens soft skills and personal attributes. He also notes Ontario's 2020 math curriculum redesign incorporating financial literacy and coding, suggesting this reflects growing recognition that math education must connect to real-world application.",
  "content_preview": "Open Education\n\nNo. 99\t\t   \t\t\t                                        \t                 February 20, 2020\n\nStudents said “they wanted instruction that feels relevant, more career pathways, teachers that slow down and after school clubs for socializing, getting homework help, and learning to navigate their schools and communities” -\tWashington Post\n\nRATING STUDENT PROGRESS\n\nHad someone doing some work around my cottage recently, just handyman stuff – fixing stairs, staining deck, repairing railing, replacing an outdoor light fixture, etc.  He does good work consistently, always know what has to be done next, takes care of his tools and practices safety. And doesn’t waste much time.\n\n\n\n\nI’m wondering why we don’t have develop a similar rating scale for school studies – specially for students who are employment bound  They’d work also for adults in  “vocational” programs. \n\n\n\n\nMost rating scales have five or six levels with a brief description of each; as an example:\n\n\n\n\n“Can perform some elements of this task but not at a sufficient level for the work force.”\n\n\n\n\nThis style of rating scale provokes and allows great discussions when used as a basis for self assessment and certainly is an ideal  way to strengthen soft skills and personal attributes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCHANGES TO MATH PROGAM\t\n\n“Ontario students returning to el-ementary school in September amid a mix of online and in-class learning will also be met with a new math curriculum that includes financial literacy, coding and \"back to basics” fundamentals…..\n\n\n\n\n“Starting in September, parents can look forward to a math curric-ulum that not only goes back to basics but equips our next genera-tion of leaders and community builders with the math skills they need to build a bright future for all of us,\" Ford said.\n\n\n\n\nThe curriculum presented on Tuesday was developed after two years of consultation with parents, math educators, academics and math experts….; interesting nit to ...",
  "size": 5559,
  "content_length": 2397,
  "garbage_ratio": 0.015
 },
 {
  "slug": "99-rating-scale",
  "title": "99 Rating Scale",
  "summary": "Identical to File 10, this is a repeat of the handyman-inspired rating scale proposal with observations about Ontario's 2020 math curriculum changes including financial literacy and coding. Don uses the practical example of consistent handywork to argue for competency-based assessment frameworks connecting student learning to real-world capability requirements and self-directed learning motivation.",
  "content_preview": "Open Education\n\nNo. 99\t\t   \t\t\t                                        \t                 February 20, 2020\n\nStudents said “they wanted instruction that feels relevant, more career pathways, teachers that slow down and after school clubs for socializing, getting homework help, and learning to navigate their schools and communities” -\tWashington Post\n\nRATING STUDENT PROGRESS\n\nHad someone doing some work around my cottage recently, just handyman stuff – fixing stairs, staining deck, repairing railing, replacing an outdoor light fixture, etc.  He does good work consistently, always know what has to be done next, takes care of his tools and practices safety. And doesn’t waste much time.\n\n\n\n\nI’m wondering why we don’t develop a similar rating scale for school studies – specially for students who are employment bound  They’d work also for adults in  “vocational” programs. \n\n\n\n\nMost rating scales have five or six levels with a brief description of each; as an example:\n\n\n\n\n“Can perform some elements of this task but not at a sufficient level for the work force.”\n\n\n\n\nThis style of rating scale provokes and allows great discussions when used as a basis for self assessment and certainly is an ideal  way to strengthen soft skills and personal attributes.\n\n\n\n\n\n\n\n\n\n\nCHANGES TO MATH PROGAM\t\n\n“Ontario students returning to el-ementary school in September amid a mix of online and in-class learning will also be met with a new math curriculum that includes financial literacy, coding and \"back to basics” fundamentals…..\n\n\n\n\n“Starting in September, parents can look forward to a math curric-ulum that not only goes back to basics but equips our next genera-tion of leaders and community builders with the math skills they need to build a bright future for all of us,\" Ford said.\n\n\n\n\nThe curriculum presented on Tuesday was developed after two years of consultation with parents, math educators, academics and math experts….; interesting nit to include employers - homework help, and learning to na...",
  "size": 5044,
  "content_length": 2344,
  "garbage_ratio": 0.0154
 },
 {
  "slug": "bertrand-russell",
  "title": "Bertrand Russell",
  "summary": "Philosophical piece sharing Bertrand Russell's \"Liberal Decalogue\" - ten commandments of teaching from his autobiography. Core principles include intellectual humility, truth-seeking over authority, encouragement of critical thinking, reasoned argument over authority, intellectual freedom, tolerance of unconventional opinions, valuing intelligent dissent, truthfulness, and intellectual integrity. Russell emphasizes education should promote questioning, independent thought, and logical reasoning. Values closely aligned with liberal arts education philosophy relevant to college leadership.",
  "content_preview": "Dear\nDon, Tim, and David,\n\nMy\nyounger sister forwarded the link to this item earlier today.  It's\nbeen floating around in my mind most of the day, so I feel compelled\nto share the meme with friends.\n\n\n\n\n\n\n-Tom\nWhite-Hassler\n\n\n\n\n\n\nA\nLiberal Decalogue: Bertrand Russell’s 10 Commandments of Teaching\n\nby\nMaria Popova\n\n\n\n\n\n\nBritish\nphilosopher, mathematician, historian, and social critic Bertrand\nRussell endures as one of the most intellectually diverse and\ninfluential thinkers in modern history, his philosophy of religion in\nparticular having shaped the work of such modern atheism champions as\nChristopher Hitchens, Daniel Dennett, and Richard Dawkins.  From\nthe third volume of The Autobiography of Bertrand Russell: 1944-1969\ncomes this remarkable micro-manifesto, entitled A Liberal Decalogue —\na vision for responsibilities of a teacher, in which Russell touches\non a number of recurring themes from pickings past — the purpose of\neducation, the value of uncertainty, the importance of critical\nthinking, the gift of intelligent criticism, and more.\n\nIt\noriginally appeared in the December 16, 1951, issue of The New York\nTimes Magazine, at the end of the article “The best answer to\nfanaticism: Liberalism.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPerhaps\nthe essence of the Liberal outlook could be summed up in a new\ndecalogue, not intended to replace the old one but only to supplement\nit. The Ten Commandments that, as a teacher, I should wish to\npromulgate, might be set forth as follows:\n\n1.\nDo not feel absolutely certain of anything.\n\n2.\nDo not think it worth while to proceed by concealing evidence, for\nthe evidence is sure to come to light.\n\n3.\n\n\n\nNever\ntry to discourage thinking for you are sure to succeed.\n\n4.\n\n\n\nWhen\nyou meet with opposition, even if it should be from your husband or\nyour children, endeavor to overcome it by argument and not by\nauthority, for a victory dependent upon authority is unreal and\nillusory.\n\n5.\n\n\n\nHave\nno respect for the authority of others, for there are always contrary...",
  "size": 7130,
  "content_length": 2758,
  "garbage_ratio": 0.0007
 },
 {
  "slug": "bio-notes-3",
  "title": "Bio notes-3",
  "summary": "Duplicate of earlier \"6-Bio notes-3.doc,\" an author biography with comprehensive educational and career overview plus substantial publications list: federal support review (1991), DACUM methodology books (1997-1998), competency education manual (1996), standards guide (2000), Presbyterian history of Black River (2003), Family Chronicles compilation (2005), and genealogy work (2007), plus unpublished Carol Chesney Glendenning genealogy. Emphasizes his consulting work in education and governance across Canada and overseas, Community Foundation directorship, and editorial contributions to professional publications.",
  "content_preview": "ABOUT THE AUTHOR\n\n\n\n\nDonald Glendenning was born and raised in New Brunswick and taught at the elementary, secondary and postsecondary level.  He attended the Little Branch School, is a graduate of the Miramichi Rural High School, Teachers' College and the New Brunswick Institute of Technology (now the New Brunswick Community College) and studied at the University of London (England) on a Lord Beaverbrook Overseas Scholarship.  He holds a B.Sc. and MSc. from Bradley University and a Ph.D. from Indiana University.  Dr. Glendenning taught at the elementary, secondary and post secondary level, worked as a training specialist in Ottawa for a number of years with the Department of Labour and the Department of Manpower and Immigration.\n\n\n\n\nIn 1969 Dr. Glendenning moved to Prince Edward Island to become the founding President of Holland College, a college of applied arts and technology.  In this capacity, he played a leadership role in the founding of the College and in implementing competency based education.  The College acquired an international reputation for its innovative approach.\n\n\n\n\nIn 1987 Dr. Glendenning retired from Holland College and operated a consulting firm with projects both in Canada and overseas.  For a number of years he was a regular contributor to the Canadian Vocational Journal.  His current activities include being a Director of the Community Foundation of Prince Edward Island, genealogy, gardening and reading.  He edits and publishes The Family Chronicle and the Community Foundation News.  Dr. Glendenning is the recipient of a number of awards and honours including the Order of Canada, Atlantic Canada Innovator of the Year Award Finalist and holds an honourary degree from the University of Prince Edward Island.  \n\n\n\n\nPublications and manuscripts include:\n\n\n\n\nGlendenning, Donald, Thomas Hall and Bruce Clarke, A Review of Federal\n\nSupport for Technical and Vocational Education in Canada, Charlottetown: Information House, 1991\n\n\n\n\nGlendenning, Donald...",
  "size": 5863,
  "content_length": 2673,
  "garbage_ratio": 0.0041
 },
 {
  "slug": "bookclub",
  "title": "bookclub",
  "summary": "Carol Glendenning's personal memoir covering her childhood in Illinois (born Henry, Illinois; parents farmed), early loss of mother (died one week after Carol's birth), and upbringing by aunt Esther Jardine and uncle in Peoria. Documents rural childhood, school experiences, friendships, radio shows (Lone Ranger), reading (Nancy Drew), sports, family picnics, 1940s fashion, visit to Chicago at age 16, and entry into nursing training (1957) at Methodist Hospital Peoria. Confirms Carol was from Peoria (raised by aunt) prior to meeting Don at Bradley University. Demonstrates Carol's own substantive life narrative and reflective character.",
  "content_preview": "I was born in Henry,Illinois, a small town of under 1000 people, nestled on the banks of the Illinois river.My parents lived on a farm. Unfortunately my mother died a week\n\nAfter I was born due to an infection.My sister, Marjorie, was 6.\n\nMy father had a housekeeper come in and my sister later went to live with an aunt and uncle in Milwaukee. I stayed on the farm until I was 4 or so and then went to live with\n\nMy father’s sister and her husband in Peoria,Ill a short distance away. I stayed there\n\nUntil I graduated from nurses training and it really became my “home” as my father \n\nDied when I was 6.I called my aunt mother and for some reason my uncle was always called uncle ed..perhaps because I knew my father. My aunt and uncle never had children of their own. We lived in a modest white bungalow. I went to grade school a block and\n\nA half away. I remember being very shy and upset   when I first attended kindergarten\n\n\n\n\nI was friends with 2 girls near my age who lived with their widowed mother next door.\n\nWe would spend hours playing dressup or store with a play cash register.\n\n\n\n\nI was also friends with a boy across the street and we used to exchange comic books.\n\n\n\n\nI loved to read, especially Nancy Drew mysteries. Another favorite pastime was listening\n\n To the radio and favorite programs such as the lone Ranger and others which I don’t \n\nRemember right now.Out door favorites were hopscotch, jumping rope, rollerskating,\n\nLater bicycle riding. I hated baseball as that seemed the main sport that was played \n\nBut later on I enjoyed girls basketball.In our gym periods we would be required to participate in a sport.\n\n\n\n\nAny vacations we took, which were short would be to visit aunts or uncles in Wisconsin\n\nOr Iowa, automobile trips that would take forever as there certainly were no 4 lane \n\nThruways then.\n\n\n\n\nMy sister and I never lived together but we would visit and when she was married, I would often go to see her and stay for a few days.she lived in Henry where on...",
  "size": 7151,
  "content_length": 3924,
  "garbage_ratio": 0.0036
 },
 {
  "slug": "boxing-match",
  "title": "Boxing Match",
  "summary": "Don's vivid childhood memory of June 22, 1938, when Joe Louis defeated Max Schmelling in a famous rematch. Don was eight years old, sitting with his mother across the road from Uncle Jim's house where men gathered to listen to the radio broadcast. The incident captures the excitement of a historic boxing moment during a period of rising anti-German sentiment and Don's childhood in rural New Brunswick.",
  "content_preview": "Boxing Match\n\n\n\n\nJune 22, 1938 was a beautiful sunny summer day.  I recall sitting under the apple tree in the front yard with Mum.  Across the road, a few people gathered at Uncle Jim’s to listen to the radio.  Uncle Jim had removed the lower sash of the kitchen window so the men could hear the broadcast better.  It was a rematch between boxing great, Joe Louis, and Max Schmelling.  Mum would not let me go across to listen although I could still hear from across the road.\n\n\n\n\nFeelings ran high.  Schmelling had beaten Louis in an earlier match.  With the saber rattling in Germany, there was much anti-German sentiment.\n\n\n\n\nRound one began; 2.08 minutes later the fight was over.  Louis knocked out Schmelling.  The fight was over.  The men lingered for a few minutes and then went home.",
  "size": 3343,
  "content_length": 793,
  "garbage_ratio": 0.0126
 },
 {
  "slug": "carol",
  "title": "Carol",
  "summary": "A home-exchange advertisement letter dated 2005 from Don and Carol seeking a non-simultaneous March exchange with June/July/September availability. The letter describes their Charlottetown home (3 bedrooms, 2 bathrooms in a residential area, 5 minutes from Victoria Park) and pitches Prince Edward Island as a summer destination with theater, beaches, and scenery. Provides personal details about Don's retirement life and travel interests with his wife Carol.",
  "content_preview": "Dear\n\n\n\n\nWe are a retired couple looking for  a non-simultaneous exchange for the month 0f  March\n\n\n\n\n\n\n\n2005, and our house is available for June, July  or Sept  2005 as we will be at our cottage \n\n\n\n\nduring those months.\n\n\n\n\nWe live in Prince Edward Island off the east coast of Canada. It is a delightful place to \n\n\n\n\nVisit in the summer months with live theater, beaches, beautiful scenery .\n\n\n\n\nFor more info visit PEI’s  tourist website.\n\n\n\n\nOur home with 3 bedrooms, two bathrooms, and all modern comveniences, is located\n\n\n\n\nin a nice residential area of Charlottetown and is 5 minutes walk from Victoria Park with a harbourside \n\n\n\n\nBoardwalk.\n\n\n\n\nWe would be delighted to explore the possibility of a home exchange with you.\n\n\n\n\nSincerely\n\n\n\n\nCarol and Don Glendenning\n\n\n\n\nCA41157",
  "size": 3433,
  "content_length": 791,
  "garbage_ratio": 0.0101
 },
 {
  "slug": "collecting-sap",
  "title": "Collecting Sap",
  "summary": "Brief account of Don's spring chores on the family farm: tapping maple trees on the ridge with his brother Ken, collecting sap in milk cans and barrels, and his mother's labor-intensive process of boiling sap into syrup and sugar. Don recalls his responsibility for keeping the woodbox filled during the long boiling process.",
  "content_preview": "Collecting Sap\n\n\n\n\nWe always tapped a few maple trees on the ridge when the nights were cool and the days were warm.  The sap was good to drink but had little if any taste.\n\n\n\n\nI recall occasions of going to the Ridge with Ken early in the morning to empty the sap buckets.  Ken hitched the horse and we took milk cans, of the kind used to ship cream to the creamery and I recall once taking the barrel from the churn to bring the sap to the house.\n\n\n\n\nOn occasion, and maybe frequently, Mum would boil the sap to make maple syrup.  It takes a barrel, 45 gallons, of sap to make a gallon of syrup and it seemed to take forever to reduce sap to syrup.  It took even more boiling to reduce sap to maple sugar. Maybe it seemed like a long time because  because it was usually my job to keep the woodbox filled.",
  "size": 3094,
  "content_length": 807,
  "garbage_ratio": 0.0062
 },
 {
  "slug": "dad",
  "title": "Dad",
  "summary": "Don's personal memoir of his father Elmer Glendenning, recounting scattered memories including conversations on a porch couch, waving to Richard Godfrey, a harrowing experience with horses during a storm inside Victoria bridge, his father's death in 1938, and the large funeral that followed. These intimate recollections reveal Don's close family connections and early life experiences in rural New Brunswick.",
  "content_preview": "Dad\n\nJune 26 ?1875-May 18 or 19, 1938 – about midnight\n\n\n\n\n\n\n\nI’ve told quite a bit about my father in my family documents and family chronicles so will not repeat it here.\n\n\n\n\nActually remember very little direct contact with my father\n\n\n\n\nDad had made a wooden couch, it was in the front porch, porch was across the whole front of the house and closed in; Dad was stretched out on the couch and I was stretched out with him; it may have been the tome either Grace or Venetia was getting or had just been mentioned because I said something about getting married Dad said, No, I won’t be here/there but your mother likely will be\n\n\n\n\nOne summer day, we were driving from the Branch towards the church, in the buggy, may I was driving in one of the light was driving wagons/  Richard Godfrey was in his back field, quite a ways from the road.  Dad raised his hand about shoulder height and waved.  I asked Dad why he waved and he said something about recognizing people.\n\n\n\n\nJohn and Dad and I\n\nTeam of horses\n\nAlex Major's probably Alex's father heavy winds and threatening rain – near Uncle Jack Godfrey’s\n\nAlex suggested that we step the team into the barn floor until the storm was over, Dad said no\n\nWe started home Were inside the Victoria bridge\n\nHorses got scared\n\nJohn got off and led the horses through the covered bridge. Bridge actually was blown a bit sideways\n\n\n\n\nRemember when he died; Uncle Chip had come down from Bathurst and stayed a few days.  He died about midnight; think I remember the commotion of in the house but did not get up   Next morning I came down stairs don’t recall who told me Dad had died but I seemed to know.  His body was back from embalming.  Mum took my hand and walked  me in to the parlour.  I remember someone asking Mum if she had been in yet; she said no and then held my hand and took me in to the parlour.  Later in the morning I remember Ken and Norman piling up some of the furnace wood, presumably tidying up for the funeral\n\n\n\n\nAs I recall, it was ...",
  "size": 5037,
  "content_length": 2262,
  "garbage_ratio": 0.0053
 },
 {
  "slug": "dentist",
  "title": "Dentist",
  "summary": "Brief account of Doug Dower, a resident dentist in Black River who operated from David Murdoch's house (north side of river below Uncle Jack Godfrey's property). Don recalls his brother-in-law Cameron Russell and brother Norman visiting Dower for tooth extractions on Sunday afternoons without anesthesia. Dower later closed his office, moved to Chatham, and eventually established a fishing/hunting camp near Horton's Creek bridge.",
  "content_preview": "Dentist\n\n\n\n\nAt one time, Black River had a resident dentist in the person of Doug Dower.  His office was set up David Murdoch’s house on the north side of the river just below Uncle Jack Godfrey’s.  I cannot recall whether this was a full-time or part time office.  I do remember, though, that Cameron Russell, my brother-in-law, went to him one Sunday afternoon to have a tooth extracted – extracted, as I recall, without the aid of laughing gas or freezing; Norman remembers going to Doug Dower also on Sunday.  I think that he soon closed his office and moved to Chatham.  Years later, he had a fishing/ hunting camp on the river just above the Horton’s Creek bridge.",
  "size": 2989,
  "content_length": 670,
  "garbage_ratio": 0.0075
 },
 {
  "slug": "elmer",
  "title": "Elmer",
  "summary": "Biographical portrait of Elmer Alton Glendenning's early life and career in the USA before 1910 return to Canada. Documents Glendenning family migration to Portland, Maine (siblings including Venetia, Margaret, Frank, Raymond, Guy) and family valuing of education (Uncle Chip's business course, Uncle Guy's dentistry study, Aunt Margaret's nursing). Traces Elmer's work progression: likely started in woods of Maine/New Hampshire (near Skowhegan, Millinocket, Berlin); worked lumbering in New Hampshire with horses, establishing record lumber cut on camp wall (recalled by multiple family members). Pre-1910, Elmer and brother Frank operated Glendenning Bros. & Co. cartage business from 24 Hammond Street, Portland (ice delivery service, general team work). Sent money to parents until age 30. Briefly describes Wisconsin work period: January 25, 1910 letter from Wisconsin to sister Jeannie; September 18, 1910 autograph album entry as \"Wausau, Wisconsin\" address; July 18, 1910 postcard from dam work at Rothschild, Wisconsin. Notes dam construction work (logging improvement and power generation purposes). Recounts author's 1993 Portland visit finding East Portland/Munjoy Hill completely rebuilt. Places Elmer within context of Maritimer migration wave to \"Boston States\" for economic opportunity.",
  "content_preview": "Elmer Alton Glendenning\n\n\n\n\n\n\n\n\nGlendennings seemed to have been well\nestablished in Portland at the turn of the century with Venetia, the\noldest child likely having played the role of \"host\" as\neach new family member moved south.  Venetia's address was Falmouth\nForeside which is just north of Portland and between Portland and\nFreeport.  Falmouth Foreside still exists although it may be\nconsidered part of the Portland metropolitan area.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWe do not know the year that Dad went\n\tto the USA or where he went first or what he did.  Other brothers\n\tand sisters known to have lived in Portland, at least for a while,\n\tincluded Venetia (Mrs R. L. Doring), Margaret (Mrs Lucas Marsen),\n\tFrank, Raymond and Guy.   Aunt Maude and Uncle Jim Cormier also\n\tworked in the USA, I believe in Lincoln, New Hampshire.\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe family must have valued\n\teducation; Uncle Chip took a business course, Uncle Guy studied but\n\tdid not finish dentistry, Aunt Margaret was a nurse.  Dad may have\n\ttaken some technical courses; I remember some technical books at\n\thome.\n\t\n\n\t\n\n\n\t\n\t\n\n\tMy guess, and it is only a guess, is\n\tthat Dad first worked in the woods in Maine and New Hampshire. \n\tWalter thought that Dad worked in the woods near Skowhegan and\n\tMillinocket, Maine.  I believe that he also worked in or near\n\tBerlin, New Hampshire.\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tDad, and presumably his brothers,\n\talso lumbered in New Hampshire prior to 1910.  Because they took\n\ttheir horses, they must have yarded and hauled logs. I believe that\n\tthey also cut lumber.  John recalled Dad telling about a \"record\"\n\tof lumber cut (marked on a camp wall) that stood for many years. \n\tKen thinks that Uncle George Watling, Mum's \n\t\n\t\n\n\tbrother, also worked in the woods\n\twith Dad and recalls Uncle George telling about the \"record\"\n\tset by Dad and his crew. George (Elbridge) Watling told Ken that\n\tboth his father, \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tGeorge, and James A. Watling worked\n\tin the woods with Dad.  Ram...",
  "size": 14729,
  "content_length": 4855,
  "garbage_ratio": 0.0
 },
 {
  "slug": "fowlies-mill",
  "title": "Fowlies Mill",
  "summary": "Don documents Fowlie's Mill on the Little Branch River, citing an 1833 Gleaner quote praising George Fowlie's new gristmill producing \"superior quality\" flour. The sawmill was constructed adjacent to the gristmill; in 1939, the gristmill was defunct but the sawmill still operated, both water-powered. Don recalls the old gristmill served as a training center for carpentry and blacksmithing around 1939-40 as part of a national program for unemployed youth. He mentions boarding participants including Hes Ross and Hugh Gibson. Photographs from Everard and Bertie MacLean (dated 1940) show John Fowlie, his horse and cart with mill ends, and George R. Fowlie operating the sawmill. This demonstrates Don's access to community archival materials and personal anecdotes about pre-war employment programs.",
  "content_preview": "Fowlie's Mill\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nAlthough\n\tthere were a number of sawmills in the area, it appears as though\n\tthe first gristmill, paddled powered, was located on the Little\n\tBranch River.  LOOKING\n\tBACK: A History of Bay du Vin New Brunswick\n\tprovides the\n\tfollowing quotation from the Gleaner in 1833:\n\t\n\n\n\n\t\n\t\n\"“Mr.\n\tGeorge Fowlie erected a grist mill on the Little Black River, which\n\tcommenced grinding last week.  We have seen some bread made of the\n\tflour manufactured at this mill and it was of superior quality.  It\n\thas a never failing stream of water and will be a great\n\taccommodation to the inhabitants of Bay du Vin and adjoining\n\tsettlements where such an establishment was much wanted.”  \n\t\n\t\n\n\n\n\t\n\t\nLater\n\ta sawmill was constructed adjacent to the gristmill. \n\t\n\t\n\n\n\n\t\n\t\nAccording\n\tto my recollection, in 1939, the gristmill was but a shell but the\n\tsawmill still operated and both were water powered.  In fact, about\n\tthis time, the old gristmill served as a training centre in\n\tcarpentry and blacksmithing.  It was part of a national program to\n\tprovide some basic skill training to the many unemployed youth in\n\tthe area.  Participants boarded with local families including Has\n\tRoss and Hugh Gibson who boarded at my home.  Shortly after, many of\n\tthese young men were off to war.\n\t\n\n\n\n\t\n\t\nPhotos\n\tfrom the collection of Everard and Bertie MacLean – taken in 1940\n\tfrom top to bottom show John Fowlie, John Fowlie’s horse and cart\n\twith a load of mill ends and George R. Fowlie, sawyer,  showing\n\tpiles of lumber in the background",
  "size": 5301,
  "content_length": 1575,
  "garbage_ratio": 0.0
 },
 {
  "slug": "hallmore-tractor-2",
  "title": "Hallmore tractor-2",
  "summary": "September 1, 2008 updated version of the Hall and Stavert tractor story. Provides refined narrative of how Don learned of the tractor's existence through Jim Stavert (son of founder), researched the manufacturer, and ultimately connected with Dr. Arleon Kelley to help locate it in Illinois. Shows Don's collaborative approach and dedication to reuniting Island artifacts with their heritage.",
  "content_preview": "Sept 1, 2008\n\nAgricultural Heritage Project\n\n\n\n\nBackground notes on the Hallmore Tractor\n\n\n\n\n\n\n\nHall and Saver was a partnership of Harold Hall and Stafford Stanley established in Charlottetown the 1930s.  They operated a foundry and produced equipment primarily for the agricultural and fishing industry.  Around 1940, they produced a conversion tractor.\n\n\n\n\nMost farm tractors were purpose built, however, during the period, a number of companies built conversion kits that allowed a farmer to convert his auto (whether a Model A, Chevrolet, Oakland or whatever) so that it could be used as a tractor.  The conversion kit usually consisted of a sturdy rear axle with rear wheels having strong cleats/lugs.   \n\n\n\n\nI became aware that such equipment was manufactured in PEI, probably in 2004 but most likely in 2005, through a conversation with Jim Stavert, son of one of the founders of the company.  Jim told me of a phone call from a Mr. Heim from Chicago enquiring about the Hallmore tractor.  \n\n\n\n\nI was curious about the pieces in Mr. Heim’s possession and encouraged Jim to follow up.  In fact, I searched the internet and found an address for Mr. Heim, 15065 Spruce Road, Lockport, Illinois, 60491 and drafted a letter for Jim’s consideration.  Jim revised and sent the letter but there was no response.\n\n\n\n\nThe scene shifts to a summer evening in 2006 at my cottage and a conversation with a neighbour, Dr. Arleon Kelley now living in Elgin, Iowa.  Knowing that Dr. Kelley traveled frequently on Interstate 80 between Iowa and Indiana, and that Mr. Heim lived close to that highway, I wondered if Arleon would visit Mr. Heim if the opportunity arose.  On Arleon’s return to Iowa at the end of the summer, he and his wife took time to look up Mr. Heim.  Through a telephone call and later correspondence I learned more about the visit.\n\n\n\n\nArleon pulled into the Lockport home and fortunately Mrs. Heim was home early that day.  An hour’s drive further away, He met Mr. Heim at the family bus...",
  "size": 5805,
  "content_length": 2764,
  "garbage_ratio": 0.0065
 },
 {
  "slug": "intro",
  "title": "Intro",
  "summary": "Introduction and foreword to Don Glendenning's autobiography/memoir \"A Round Trip from Little Branch: Recalling the Journey.\" Authored by Don himself with some sections completed by family members. Covers his birth Sept 8, 1929 in Little Branch, ninth and last child of Elmer and Jeannie Glendenning. Documents his education (St. Pauls Presbyterian Church, Little Branch School, Miramichi Rural High School), left home at 16 for higher education, 50+ year career in education (teacher, administrator, Holland College president 1969-1987, consultant). Married Carol Louise Chesney of Illinois Jan 31, 1958; two children Brian and Janet. Notes extensive work in New Brunswick, Ontario, BC, Indiana, and PEI. Table of contents indicates extensive biographical documentation. Critical foundational document for understanding Don's life trajectory and achievements.",
  "content_preview": "A ROUND TRIP FROM LITTLE BRANCH\n\n\n\n\nRecalling the Journey \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nby\n\n\n\n\nDonald Ernest Malcolm Glendenning. C.M., Ph.D, LLD\n\n1929 - 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFOREWARD\n\n\n\n\n\n\n\nOn Sunday evening, September 8, 1929 at Little Branch, Northumberland County, New Brunswick, Mrs. Elmer Glendenning gave birth to a son, Donald Ernest Malcolm.  He was the ninth and last child in the family.\n\n\n\n\nDon grew sup in the community, attended St. Pauls Presbyterian Church with his parents, attended the Little Branch School and the Miramichi Rural High School.  At age 16 he left home to pursue higher education and the following year entered the teaching profession where his career included being a teacher, administrator, college president and educational consultant.  During his lifetime, he was active in education at the local, provincial and national level and practiced his profession internationally.\n\n\n\n\nHe married Carol Louise Chesney of Peoria, Illinois on January 31, 1958 and together they lived, studied and worked in New Brunswick, Ontario, British Columbia, Indiana and Prince Edward Island.  They also raised a family of two, Brian and Janet.\n\n\n\n\nAfter retirement, Don and Carol continued to live in Prince Edward Isalnd but traveled extensively especially during the winter season.  Hhe also enjoyed his cottage, his garden, farm and home.\n\n\n\n\nIn 2???, Don returned to his home community and now rests in the Black river Cemetery together with his parents, siblings, family and friends.\n\n\n\n\nThis is a record of his journey – an account rather than an autobiography.  It is intended to bring together a brief account of his journey for the information and benefit of his offspring.  While the bulk of the document was prepared by Don Glendenning, himself.  Some parts of the return journey were completed by xxxx\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTABLE OF CONTENTS\n\n\n\n\n\n\n\nForeward\n\n\n\n\nLittle Branch\n\n\n\n\nLearning and Teaching\n\n\n\n\n...",
  "size": 6414,
  "content_length": 2194,
  "garbage_ratio": 0.0041
 },
 {
  "slug": "land-grants-on-the-little-black-river",
  "title": "Land Grants on the Little Black River",
  "summary": "Dated August 18, 2004, this detailed genealogical document lists original land grants along Black River and tributaries with grantee names, acreage, and dates. Don traces his maternal ancestry through Jubal Watling (his grandfather), noting grants of 100 acres at Lot 30 in the Meadows on April 20, 1881. He documents Jubal Watling's children, neighbors' grants from 1812-1881, and traces the family's property history. Don recalls his mother Jane (born 1890) walking to school from the Meadows property. The document notes that buildings have \"long since disappeared\" and \"the community has disappeared\" with forest reclaiming cleared fields. This demonstrates Don's deep genealogical research and family connection to early settlement patterns.",
  "content_preview": "TIME \\@ \"MMMM d, yyyy\" August 18, 2004\n\n\n\n\nLand Grants on the Little Black River\n\n\n\n\nThe following is a list original grants along the Black river and its tributaries..  Information was gathered from two sources  \n\n\n\n\nAs a starting point, I decided to follow the pattern of settlement.  This means starting at the mouth of the river and working my way to its origin at the Meadows.\n\n\n\n\nLot No.\tGrantee\t\tAcres\t\tDate Granted\n\n\n\n\n \t1      \tEnoch Godfrey\t\t140 Acres\t1812-06-03\t\n\n\n\n\n\t2      \tAlexander McDonald Sr.\t225 Acres \t1812-06-03\n\n\n\n\n\t3.     \tKenneth Sinclair            \t220 acres\t1812-06-03\n\n\n\n\n\t4\tAngus Sinclair\t\t\t\t1812-06-03\n\n\n\n\n\t5   \tAngus Sinclair           \t410 acres\t1812-06-03\n\n\n\n\n\t6      \tAlexander McDonald\t140 acres  \t1812-06-03\n\n\n\n\n\n\n\n\n\n\n11\tGeorge Fowlie\t\t300 \t\t\t1834\n\n\n\n\nOn the north side of the Little Black River starting at the mouth, we find:\n\n\n\n\n\t1\tJohn, Catherine and Jean, children of Hugh MacLean\t470 Acres\n\n\t\n\n\t2\tFarquhar McRaw\t\t\t\t\t\t240 Acres\n\n\n\n\n\t3\tKenneth MacDonald\t\t\t\t\t440 Acres\n\n\t\n\n\t4\tDuncan MacNaughton\t\t\t\t\t200 Acres\n\n\n\n\nMoving west from the Alexander McDonald property, we find:\n\n\n\n\n1,2 & 3  \tJohn McLean - 370 Acres\n\n4 \t\tAlexander Gunn - 230 Acres\n\n5 \t\tRobert MacBeath - 165 Acres\n\n6\t\tJohn MacLeod - 195 Acres\n\n7\t\tThe front 100 Acres was granted to Thomas Patterson on 1908-12-31\n\nThe back 100 acres was granted to Elmer Gendenning on 1936-09-16\n\n\n\n\n\n\n\n\n\n\nJubal Watling   (F4243) petitioned for 50 acres of land situate as follows: on the South side of Black River adjoining south of William McBeath’s meadow lot and east of a lot applied for by John Edge.  The petition is dated at Chatham on April 9, 1851 and includes his signature.  The property was vacant, surveyed but without improvements.  Other handwritten notes on the page are confusing in that they show apparent approval on May 21/1851 and Auction, August 51\".  They are signed by Peters, the Deputy Surveyor.  No lot number is given but records show that a William MacBeath owned property in the area.  I...",
  "size": 15721,
  "content_length": 7630,
  "garbage_ratio": 0.0196
 },
 {
  "slug": "little-branch-school",
  "title": "Little Branch School",
  "summary": "Extensive first-person memoir written by Don describing his childhood schooling at Little Branch School in Black River. Details about four one-room schools in the area, daily challenges including lack of running water, physical punishment with strapping, and ingenuity in student life. Notable anecdotes: water carried from Don's house, eating lunch from Dominion shortening pails cooled in the brook, and being contracted to start the school fire at 7:30 am. Describes transition to Miramichi Rural High School in January 1940 with its modern amenities and influence of Macdonald Schools. Sent to Kaye Lister for retired teachers magazine in March 2007.",
  "content_preview": "~~~~~~\n\n\n\n\nAs I Recall:\n\n\n\n\nSome memories of the Little Branch School\n\n\n\n\nThere were four one-room schools in Black River; I lived near, and attended, the Little Branch School as did my brothers and sisters before me.  Although I lived close to the school, many students lived a mile or more away.  For most students, the Little Branch School provided their entire formal schooling; a fortunate few stayed with relatives and attended high school in Loggieville or Chatham.\n\n\n\n\nThe Little Branch School had a pump that didn’t work and a sink that did.  Listening to my older siblings, however, the sink seemed to be used mostly as a place to ‘strap” students who acted out – strapping meant using a 15 inch ruler across a hand held on top of the sink stand.  Drinking water, a pail in the morning and one in the afternoon, was carried from our house by a couple of boys designated for the task each day.  It was more like a half a pail by the time it reached the school, especially if transported down the hill between two boys on a sled.  Obviously there was no water for washing your hands. \n\n\n\n\nThe school was down the hill and on the other side of the cove from our house and in winter, our hill became an extension of the playground.  It was also a favourite place in the community for evening coasting parties.  The rising tide filled the cove twice a day and at least one school mate found himself up to his neck in salt water one noon hour.\n\n\n\n\nArbour day was special; we trudged to school with rakes, hoes, pails and scrub brushes to help with a spring clean up; we usually finished by one o’clock and were allowed to go home.  \n\n\n\n\nArbour day was also special because it was the one day of the year I was allowed to carry lunch. My Mother packed a lunch in a 5-pound Dominion shortening pail – red with yellow lettering as I recall. (Some students carried blue-and-white Crisco cans but ours were always a Dominion.). I don’t remember the sandwiches but I do remember the milk. Mum filled an...",
  "size": 7806,
  "content_length": 4126,
  "garbage_ratio": 0.0061
 },
 {
  "slug": "memories-2011",
  "title": "MEMORIES-2011",
  "summary": "Collection of Don's personal recollections from St. Paul's Presbyterian Church in Black River, including memories of gas lamps, oyster suppers, and early automobiles. Don shares vivid details of childhood experiences attending services and traveling by horse and wagon to church. The document captures his appreciation for small-town community traditions and religious life.",
  "content_preview": "MEMORIES\n\n\n\n\nThe writer has many fond memories of St. Paul’s Presbyterian Church and decided to share some as part of this record.  A request for recollections was sent to others but the list was short, except for relatives, because of the lack of current addresses.  The comments received are included in random order below.\n\n\n\n\nI remember:\n\n\n\n\n  \nThe hissing of the gas lamps.  There were three, two double lamps over the main aisle and a single lamp over the choir stand.  As dusk began to settle, Uncle Jim, or someone, would light the lamps.  The lamps used naptha gas and air was pumped in to increase the pressure thus causing the hissing.  (Don Glendenning)\n  \nOyster suppers (Don Glendenning)\n  \nGordon Adams’ red car, the first red car I ever say.  When someone asked him about it, Gordon said “It was the style in the States”.  (Don Glendenning)",
  "size": 3423,
  "content_length": 856,
  "garbage_ratio": 0.0093
 },
 {
  "slug": "near-fire",
  "title": "Near fire",
  "summary": "Don recalls a dangerous near-fire in the family home when a cracked furnace allowed flames into the brick chamber while cats disturbed insulation material on top. His brother Kenneth extinguished the fire and the furnace was later replaced with help from Norman MacKenzie.",
  "content_preview": ".\n\n\n\n\nA Near-fire\n\n\n\n\nKen and I were recalling a near fire at home, I am not sure of the year.  As I recall, Ken, Norm and I were hauling wood one spring day, although there was still lots of snow around.  We were hauling the wood on a large hand-sled, John’s sled we always called it.  Ken smelled smoke and was met by smoke when he opened the cellar door.\n\n\n\n\nAt our place, the furnace firebox was set inside a brick box about 5’x5’ x5’.  Another brick wall was built outside the first leaving an air space between the two walls of brick acted as an insulator.  The furnace itself would handle a stick of wood four feet long.  Forming a cap over the furnace was a sheet metal covering with a number of openings to which pipes could be attached to lead the warm air to various rooms above.  On top of the sheet metal was a layer of sand to also act as insulation.  Seems that the cats were playing on the sand on top of the furnace and pushed off one of the covers.  At the same time, the cast iron furnace had cracked allowing flames to enter the chamber.  Something caught fire.  \n\n\n\n\nAs I recall, Ken came to the rescue and quickly got pails of water to douse the fire.\n\n\n\n\nIt was shortly thereafter, as I recall, they replaced the cast iron furnace.  It was very heavy and they used a rope to hold it back when sliding it down the cellar stairs.  Norman MacKenzie, who was a big, husky man, helped Walter and John ease the furnace down to the basement and replace the old one.",
  "size": 4052,
  "content_length": 1481,
  "garbage_ratio": 0.0088
 },
 {
  "slug": "st-paul-s-memories-of",
  "title": "St. Paul's Memories of",
  "summary": "Don's personal memoir of his early years at St. Paul's Presbyterian Church in Black River Bridge, New Brunswick, written for the church's anniversary. Describes his father's involvement in church construction, his mother's active membership, childhood experiences of worship and community, and the important role church life played in his family. Reveals formative influences on Don's character and values.",
  "content_preview": "Memories\n\n of \n\nSt. Paul’s Presbyterian Church\n\nBlack River Bridge, NB\n\nJuly 00, 2023\n\nOn this anniversary occasion, I am pleased to provide a few recollections about my life and times in St. Paul’s Presbyterian Church in Black River Bridge, New Brunswick. Although I actually participated in the official opening on July 20, 1930, my memories of the event are a bit hazy.  I understand, however, that older siblings were actually at a church event when I arrived at Little Branch on a Sunday evening a   year earlier.\n\nSt. Paul’s played a significant role in our family. My father was involved in its construction; my Mother was an active member, siblings played a variety of roles and nephews and nieces are keeping up the tradition. I might also add that many summer Ministers boarded at our home and shared meals and events with our family; their presence was one of my connections to the world beyond Black River.\n\nSunday services were held at 11.00 am one week and 7:00 pm the next; the change allowed the minister to travel to and from Kouchibouguac9 (awo-point charge) where the schedule was reversed. After a morning service, the Minister travelled to Kouchibouguac  where he preached the evening service and stayed the following week. In those days, Ministers, did not have their own vehicle; transportation to the other site was provided by members of St.Paul’s.  One summer minister, as I recall, had a bicycle to travel back and forth. \n\nMy church experiences were positive; St. Paul’s was a welcoming church. Sunday services were always warm and friendly (most members were related); there was a positive but muted conversation before the service got under way. men gathered outside for conversation (and perhaps another smoke) prior to the commencement of the service; \n\nI recall sunny Sundays travelling to and from church with Mother and my siblings in the large “express wagon”; wagon travel was leisurely and allowed for conversation about the just completed service as well family...",
  "size": 6315,
  "content_length": 3524,
  "garbage_ratio": 0.0034
 },
 {
  "slug": "transportation",
  "title": "Transportation",
  "summary": "Part of 'The Family Chronicle' newsletter (No. 69, May 21, 2004) documenting Don's family connections in Scotland and the United States. Includes correspondence from new owners of Callister Hall (ancestral Glendenning home in Scotland) and death notices of Don's grandfather Walter Glendenning (1908, Falmouth, Maine) and grandmother Elizabeth Peters Glendenning (1915). Also discusses early transportation in rural New Brunswick, including the first automobiles (Fred A. Fowlie, Harrison Smith, Malcolm MacNaughton) and Dr. MacKenzie's early snowmobile. Notably, Don's sister Venetia was born on the day their grandmother died.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n69\t\t\t\t\t\t\t\t\t\t              May 21, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nDon\n\tGlendenning at Callister, Scotland - 1988\n\t\n\n\n\n\t\n\t\nCallister\n\tHall\n\t\n\n\n\n\t\n\t\nReaders\n\twill remember an earlier chronicle with a photo of Callister Hall in\n\tScotland where my Great Grandfather, John Glendinning was born on\n\tApril 2, 1807.  The latest descendant to visit Callister Hall is Joy\n\tAyer, a GGGranddaughter of John Glendinning.  Joy visited on a day\n\tthat new owners, by the name of Domoney, were moving in.  Joy has\n\tkept in touch and sent me a copy of a recent letter from the new\n\tresidents.  It reads as follows:\n\t\n\n\n\n\t\n\t\nI\n\tfelt, as it is now a year since we purchased Callisterhall and nine\n\tmonths sinced we moved in, that I would inform you of our progress.\n\t\n\n\n\n\t\n\t\nWe\n\tabsolutely love it here and cannot believe how the community has\n\tembraced us.  Many people have said, on visiting, that it has a\n\tspiritual feel about the place.  \n\t\n\t\n\n\n\n\t\n\t\n \n\t\n\t\n\n\n\n\t\n\t\n \n\t\n\t\n\n\n\n\t\n\t\n \n\t\n\t\n\n\n\n\t\n\t\nWe\n\thave spent last summer working outdoors and we are still half\n\tunpacked indoors, due to the lack of space, but we are now in the\n\tprocess of having a barn built  in the field next to the cottage so\n\twe can then \"expand\" into it.  The fields will then be\n\tsprayed then ploughed and re-seeded.  \n\t\n\t\n\n\n\n\t\n\t\nThen\n\tI can start with my animals.  We had 27 sheep from a local farmer\n\tjust to graze the grass but we hope to have our own soon.\n\t\n\n\n\n\t\n\t\nI\n\twould love to know more about Callisterhall as I am sure it has a\n\tlot to tell.\n\t\n\n\n\n\t\n\t\nWe\n\thave just bought a cage to put a puppy in (indoors) so that is\n\tsomething to look forward to.  It will be nice to be able to shut it\n\taway safely when needed.\n\t\n\n\n\n\t\n\t\nI\n\tstill feel awful that I didn't have the time to give to you when you\n\tcalled in but as you can imagine, things were \"fraught\". \n\tPlease feel fr...",
  "size": 11906,
  "content_length": 5305,
  "garbage_ratio": 0.0
 },
 {
  "slug": "watlings-at-the-meadows",
  "title": "Watlings at the Meadows",
  "summary": "Don's genealogical research distinguishing between three different Jubal Watlings and documenting the land grants and property locations of the Meadows community (near Black River). Includes property petitions and crown land grants from the 1850s onward, naming neighbors and acreage. Don recalls childhood visits to the property picking blueberries and notes that the community has since reverted to forest, preserving family memory of a lost settlement.",
  "content_preview": "Watlings at the Meadows\n\n\n\n\nJanet Watling asked recently about the early Watlings at the Meadows.  It is confusing because, as we know, there were at least three Jubal Watlings.\n\n\n\n\nJubal 1 married Susan Leach.  I have no evidence that they came to Canada or Black River.\n\n\n\n\nA Jubal Watling, I believe to be Jubal 2 married to Christina MacNaughton,    petitioned (F4243) for 50 acres of land “situate as follows: on the South side of Black River adjoining south of William McBeath’s meadow lot and east of a lot applied for by John Edge.  The petition is dated at Chatham on April 9, 1851 and includes Jubal’s signature.  The property was vacant, surveyed but without improvements.  Other hand written notes on the page are confusing in that they show apparent approval on May 21/1851 and Auction, August 51\".  The papers are signed by Peters, the  Deputy Surveyor.  Lot number not given.\n\nThe New Brunswick Crown Lands Grant Index shows a grant of 100 acres located at A30 BL. 15 SE SD Black River, Glenelg Parish Northumberland County to Jubal Watling, Jr. on April 20, 1884. (Recorded in vol. 105, No.18287)\n\n\n\n\nThis is located in an area known as the Meadows - a name that has long since disappeared.  This, I believe, is Jubal 3 who married Grace MacDonald.  Jubal and Grace moved to Little Branch, in 1900 or 1901 to the place where Neil Watling now lives.  \n\n\n\n\nAccording to the New Brunswick Land Grants Index, neighbours in the Meadows starting at Route 11 were:\n\n\n\n\nLot Grantee               Acres    Date Granted\n\n\n\n\n26   Terrence Cook      150 Ac.  \t1833-07-24\n\n27   Patrick Smith         112 Ac \t1838-12-21\n\n28   Richard Hutchison 100 Ac \t1849-06-04\n\n29   Gardiner Archibald  98 Ac \t1880-05-10\n\n30   Jubal Watling, Jr   100 Ac    1881-04-20\n\n31   Donald Cameron   100 Ac \t1854-01-30\n\n33   Unknown\n\n34   Donald McBeath   \t1883-03-09\n\n\n\n\nI believe there was a road to the Meadows along the south side of the Black River starting at Route 11. Ken remembers visiting the property.  I think...",
  "size": 6221,
  "content_length": 2247,
  "garbage_ratio": 0.0209
 },
 {
  "slug": "wool-and-yarn",
  "title": "Wool and Yarn",
  "summary": "Recollections related to sheep farming, wool processing, and yarn production in the Miramichi region. Documents traditional agricultural and textile activities that provided supplementary income and self-sufficiency for rural families.",
  "content_preview": "Wool and Yarn\n\n\n\n\nWe always kept a few sheep, perhaps a dozen or so – nor am I sure of the breed although I know they were white.  The sheep had their own shed at the top of the hill where we coasted.  It was easy to climb onto the roof of the sheep shed and jump off into the snow bank, which curled around it.  \n\n\n\n\nEach spring there were new lambs, usually twins but sometimes only one; they always seemed sickly and some had to be nursed with a bottle.  Sometimes they were brought into the house for a few days,  Some died.  But they were cute.  In early summer the sheep had to be sheared.  Sheep shears were hand operated, very sharp and were hinged at one end not hinged in the middle like a pair of scissors.  I never sheared     \n\n\n\n\n\n\n\nsheep but I helped Norman on at least one occasion.  \n\n\n\n\nOne put a few boards on top of sawhorses.  Sheep were caught and their front and hind legs were tied together.  Then they were put on the table and sheared.  Norm was pretty good at it although occasionally nicked the skin and drew blood.  Sometimes the sheep had ticks and had to be dusted or sprayed.  They sure looked funny with all the wool removed.  Shearing sheep was a dirty, smelly job partly because the wool was so oily.\n\n\n\n\nI remember Norm bringing home half a dozen sheep in the old Model A.  He had removed the back seat and turned up the seat on the passenger side.\n\n\n\n\nAlso in the spring of the year, we docked the tails of the lambs.  Docking meant cutting off their tails to leave only a stub.  This was done with one chop with a sharp axe.  We had small cloth squares, perhaps a 4-inch square, and a bit of grease was put on the cloth and over the end of the stump.  This was used to keep the wound clean. \n\n\n\n\nAfter the ground warmed but before the grass grew, it was necessary to wash the wool.  It was a major undertaking.  The bags of wool were opened and the real dirty parts were snipped off and discarded.\n\n\n\n\nIn preparation for washing, rainwater was saved in large tub...",
  "size": 7434,
  "content_length": 3711,
  "garbage_ratio": 0.0108
 }
]