[
 {
  "slug": "102-9-role-of-gov",
  "title": "102-9 Role of Gov",
  "summary": "A different draft letter responding to questions about education received during the Christmas season. Uses a bullet-point format to outline organizational and systemic issues in PEI's education system, including lack of autonomy for schools, limited accountability, and politicization. Notes plans for future commentary on teaching/learning models.",
  "content_preview": "Editor\n\nDear\nSir\t\n\n\nRe-setting\ndirection\n\nOver\nthe Christmas season, I was asked on a number of occasions for my\nviews on education; I thought I would make those views the subject of\nthis, my first letter in the new year.  In brief, public concern is\ngrowing an optimism yhat improvement is on the way is falling.   On\nthe organization side:\n\n\t\n\nInformation\n\tis an education service and should be expanded. \n\t\n\t\n\nRole\n\tof Department  should expanded from that of delivering programs to\n\tone of encouraging and supporting learning\n\t\n\nSchools\n\tneed greater autonomy (OECD)\n\t\n\nProgramming\n\tshould reflect increased learner centeredness\n\t\n\nFear\n\tactor probably reflects lack of autonomy, nature of organization and\n\tdegree of politicization. \n\t\n\t\n\nBroadening\n\tservices would likely increase participation rates  \n\t\n\t\n\nSystem\n\tnoted for lack of accountability \n\t\n\t\n\nCare\n\tshould be taken when using common educational (education, learners,\n\toutcomes, etc.  \n\t\n\n\nI’ll\ntry to have comments about the teachb=ng/learnibg modl in a later\nletter\n\nSincerely\n\n\n\n\n\n\n\n\n\n\nDon\nGlendenning\n\nA\nlongtime student of education\n\n\n\n\n\n\n\n\n102-9",
  "size": 4947,
  "content_length": 1118,
  "garbage_ratio": 0.0
 },
 {
  "slug": "2005-ord4er-of-canada",
  "title": "2005-Ord4er of Canada",
  "summary": "October 2005 letter from Don Glendenning (C.M.) to Rideau Hall supporting Wade MacLaughlin's nomination for Order of Canada. Signed as C.M. (Companion of the Order of Canada), confirming Don's own Order of Canada status and his respect for MacLaughlin's university leadership contributions.",
  "content_preview": "October 24, 2005\n\n\n\n\n\n\n\n62 Queen Elizabeth Drive\n\nCharlottetown, PE C1A 3A9\n\n\n\n\n\n\n\n\n\n\nMs Jacqueline Barton\n\nResearcher and Regional coordinator\n\nOrders Section\n\nRideau Hall\n\n1 Rideau Street\n\nOttawa, Canada K1A )A1\n\n\n\n\nDear Ms Barton:\n\n\n\n\nI am delighted to add my support to the name of Wade MacLaughlin for membership in the Order of Canada.\n\n\n\n\nI have known the MacLaughlin family for many years and they were and are well established and respected on Prince Edward Island.  I got to know Wade first as Dean of Law at the University of New Brunswick and later when he became President of the University of Prince Edward Island.  \n\n\n\n\nThe appointment of Wade MacLaughlin as President of UPEI was well received in the Island community.  He exudes warmth, is both articulate and commanding, and has a significant media presence..\n\n\n\n\nUnder his Presidency, the University has certainly strengthened its community liaison, has expanded its offerings and has greatly added to specialized facilities and research.  The Senior’s College, although not initiated by Wade, has expanded significantly and is certainly is a highly recognized and valued services to the community.\n\n\n\n\nHis appointment to the Order of Canada would not be surprising and would be well received.  I certainly support it.\n\n\n\n\nSincerely\n\n\n\n\n\n\n\n\n\n\nDon Glendenning  C.M.",
  "size": 3856,
  "content_length": 1333,
  "garbage_ratio": 0.0045
 },
 {
  "slug": "2011-02-11-draft-letter",
  "title": "2011-02-11 Draft letter",
  "summary": "Personal letter from Don Glendenning to Mary Beth Harris (February 15, 2011) following their charitable consultation meeting. Advises Harris to consult financial advisors regarding charitable contributions from art sales, provides an amended organization list, presents sample calculations for a $500,000 endowment, and explains CFPEI's model of establishing permanent charitable plans rather than relying on wills. Demonstrates Don's consultative approach and emphasis on flexibility for donors to modify charitable priorities without legal costs.",
  "content_preview": "February 15, 2011\n\n\n\n\nMs. Mary Beth Harris\n\nPark West Lodge, Room 302\n\n22 Richmond St\n\nCharlottetown, PEI C1A 1H4\n\n\n\n\nDear Mary Beth:\n\n\n\n\nFirst, thank you for the opportunity to discuss you charitable interests with John Robinson and myself on Friday, February 11.  Hopefully, it was useful to you as you consider making provision to continue your exploration.\n\n\n\n\nHere are some specific observations:\n\n\n\n\n1\tGiven your plans to sell some paintings and make charitable contributions with the income, we urge you to talk the matter over immediately with your financial advisor.  Should your advisor wish, I am sure that the Foundation’s Accountants, ArsenaultBestCameronEllis, would be happy to discuss the matter in detail.\n\n\n\n\nAttached you will find an amended Appendix listing organizations of interest.  We note that all proposed grants are organization specific; you could also earmark contributions to causes such as heritage, culture, the environment without naming a specific organization.  \n\n\n\n\nWe thought that it would be useful to give an example of the allocation based on our discussions.  Consequently, we did some calculations based on an endowment of $500,000.  Obviously, the figures can be adjusted up or down by changing the contribution level or by adding or subtracting actual causes on your list.  \n\n\n\n\nIncreasingly, we are finding that people like the model whereby they establish a charitable plan with the Foundation rather than trying to accommodate the distribution in their wills.  The will itself, then becomes very simple listing the beneficiaries other than charitable organizations.  Because you have set up a fund with the Foundation, a simple statement naming your fund at the Community Foundation of Prince Edward Island as the beneficiary of your estate should suffice.  This allows you to keep your charitable legacies in a single location, to change the beneficiaries of your charitable contributions at any time and without cost, and it removes the detail of your...",
  "size": 5273,
  "content_length": 2224,
  "garbage_ratio": 0.0049
 },
 {
  "slug": "2016-amendment-baksh-5",
  "title": "2016 Amendment Baksh-5",
  "summary": "February 16, 2016 letter from Don Glendenning (President, CM designation) to Ms. Mezaun Baksh at CRA providing Certificate of Amendment from Minister of Industry. Notes Don's travel absence (Feb 19 - Mar 18) but commits to email contact. Shows continued engagement in organizational amendment/registration process post-rejection.",
  "content_preview": "February\n16, 2016\n\n\n\n\n\n\n\n\n\n\n\nMs. Mezaun Baksh\n\nCharities Analyst,\nCharities Directorate\n\nCanada Revenue\nAgency\n\nOttawa, ON  K1A 0L5\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Ms. Baksh:\n\n\n\n\n\n\nEducation\n20/20 Inc. – file 3050233\n\nCertificate\nof amendment\n\n\n\n\n\n\nFurther to your\nletter of January 20, 2016. I am pleased to provide a copy of the\nCertificate of Amendment issued by the Minister of Industry, along\nwith his supporting documentation.  If you need any additional\ninformation, do not hesitate to let me know.\n\n\n\n\n\n\n\nI should point out that I will be out of Province from February 19 to\nMarch 18, but will have my mail checked during my absence and remain\nin contact via Email\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSincerely, \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon Glendenning C.M\n\nPresident",
  "size": 5518,
  "content_length": 742,
  "garbage_ratio": 0.0
 },
 {
  "slug": "chapman-2015-12-17t09-55-48",
  "title": "Chapman @2015-12-17T09;55;48",
  "summary": "A letter of nomination from Don (as President Emeritus of Holland College) recommending Mike Chapman for membership on the Learning Partners Advisory Council, highlighting Chapman's extensive career in electronics education and Holland College's trades training programs. The letter demonstrates Don's ongoing engagement with educational institutions and his willingness to mentor and advocate for colleagues.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown\n\nPEI C1A 3A9\n\n\n\n\nNovember 16, 2015\n\nLearning Partners Advisory Council\n\nPO Box 2000\n\nCharlottetown, PEI\n\nC1A 7N8\n\nDear Sir:\n\nMr. Mike Chapman\n\n505 Keppoch Rd\n\nStratford PE C1B 2J8\n\nTel: 902-5659-4038\n\nEmail: mikechapman@eastlink.ca\n\n\n\n\nI am pleased to nominate Mike Chapman as a member of the newly formed Learning Partners Advisory Council.  Mike was born in Cambridge, England, graduated in electronics from Bottisham College, and spent a number of years in the electronic industry in both England and in Canada.\n\n\n\n\nIn the mid 1970’s he moved to PEI and became an instructor at Holland College.  He was a “natural” teacher and, over the years, his responsibilities grew until he was put in charge of the delivery of trades and technology training across the Island.  Mike worked closely with industry at  WRIP, and worked with the Slemon Park authorities in designing programs for companies setting up business on PEI.  After retirement, he became a consultant with a focus on analysis, standards and certification at the national level.  He also taught in China as part of Holland College’s offerings there.\n\n\n\n\nMike has a continuing interest in education, has substantial experience in competency based education, was respected by his students, is experienced in initiating and maintaining linkages with industry and community organizations, and is an experience manager.  In addition, Mike is articulate, respectful, and respected. If selected, he will make a measurable contribution to your discussions; I have no hesitation on recommending Mike for membership in the Learning Partners Advisory Council.\n\n\n\n\nIf you need additional information, I would be more than pleased to provide it.\n\n\n\n\nSincerely\n\n\n\n\nDon Glendenning, C.M.\n\nPresident Emeritus, Holland College",
  "size": 4400,
  "content_length": 1811,
  "garbage_ratio": 0.0039
 },
 {
  "slug": "craig-2015-12-31t01-34-15",
  "title": "Craig @2015-12-31T01;34;15",
  "summary": "A letter of nomination from Don recommending Tanya Craig for the Learning Partners Advisory Council, citing her background in community development, youth programming, and educational engagement in Stratford, PEI. The nomination reflects Don's continued leadership in PEI educational and community initiatives during his retirement years.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown\n\nPEI C1A 3A9\n\n\n\n\nNovember 16, 2015\n\nLearning Partners Advisory Council\n\nPO Box 2000\n\nCharlottetown, PEI\n\nC1A 7N8\n\nDear Sir:\n\n\n\n\nMs Tanya Craig\n\n41 Rodgerson Crescent,\n\nStratford, PE  C1B 2G7\n\nTel: 902-314-4030    Email:tjcraig@eastlink.ca\n\n\n\n\nDear Sir: \n\n\n\n\nI am pleased to nominate Tanya Craig as a member of the newly formed Learning Partners Advisory Council.\n\n\n\n\nTanya was born in Charlottetown, attended West Kent Elementary School, Queen Charlotte Junior High School, and Colonel Gray Senior High School and  graduated from Acadia University with an Honours degree in Sociology.\n\n\n\n\nTanya’s work experience includes a number of years working  with adults with intellectual disabilities. For a number of years she was Youth Coordinator for the town of Stratford and responsible for youth programs and a community youth centre for youth ages 10 to 18 years.  One of her projects was the well-known “Youth Can Do Project”.\n\n\n\n\nTanya is currently Program Coordinator for Arts and Culture for the Town of Stratford; as part of that role, plays a leading role in incorporating newcomers into to the community.\n\n\n\n\nTanya is the mother of four , all of whom attended public schools, was an active member oof the PEIHSF, and active in her community; she is also a Director of Education 2020.  Tanya is knowledgeable about the public school system, is articulate, an experienced facilitator and, if appointed, be a contributing member of the Council\n\n\n\n\nIf you need additional information, I would be more than pleased to provide it.\n\n\n\n\nSincerely\n\n\n\n\nDon Glendenning, C.M.\n\nPresident",
  "size": 4182,
  "content_length": 1620,
  "garbage_ratio": 0.0049
 },
 {
  "slug": "governor-general",
  "title": "Governor General",
  "summary": "Letter from Don Glendenning to Secretary to the Governor General discussing proposals for an Order of Canada Association. Presents Don's vision for fellowships, conferences focused on Canada's future, and community engagement—reflecting his thought leadership on national service and civic responsibility.",
  "content_preview": "Stephen Wallace\n\nSecretary to the Governor General\n\n1 Sussex Drive\n\nOttawa, Canada1A 0A1\n\n\n\n\nDear Sir:\n\n\n\n\nI am delighted to receive your letter and certainly support the establishment of an Order of Canada Association as outlined in your letter; while I do not know all the Members of the Order on PEI personally, I expect there will be considerable interest in such an activity.\n\nAs for particular initiatives, my mind turns such thing as:\n\n  \nAn annual local or provincial gathering with national gatherings perhaps every five years, during which we welcome new members, network with other members and raise the profile of the Order.  This would be useful if we did nothing more.\n  \nI Like the idea of periodic conferences with a future focus; Sessions not designed to give answers but rather to provide participants with a framework for addressing issues.  Could even focus on the future of the community where we are meeting.\n  \nStimulste public discussion on Canada at age 20-0.  While I understand the value of scholarships I would not favour such  an initiative; yhe link between scholarship and sercive to one’s country is tenuus to say the least and, from my perspective, the education system generally lacks a service orientation.\n  \nI like the idea of periodic conferences to discuss the future of our country and shape",
  "size": 3552,
  "content_length": 1331,
  "garbage_ratio": 0.003
 },
 {
  "slug": "letter-1",
  "title": "Letter 1",
  "summary": "Letter from Don Glendenning to David Cadogan discussing governance and tax implications of the Cadogan Foundation's relationship with CFPEI. Demonstrates Don's expertise in charitable law, CRA interpretation, and his hands-on involvement in foundation governance decisions.",
  "content_preview": "Mr. David Cadogan\n\nPO Box 397\n\nMiramichi, NB\n\nE1N 3A8\n\n\n\n\nDear David:\n\nCadogan Foundation\n\n\n\n\nThis is a follow-up to our recent telephone conversation about community foundations generally and the possibility of a “home” for the Cadogan Foundation within the Community Foundation of Prince Edward Island.\n\n\n\n\nFirst of all, I apologize for the long delay in responding to your questions.  The idea of direct delivery was not on our radar screen as such.  On only one or two occasions that I recall, did we have to make arrangements with a “qualified donee” to supervise a grant to an organization that itself was not a qualified donee.  In addition, we have been asked a number of times recently about writing receipts for fund raisers in which the charitable component of a contribution may accrue to the benefit of an organization not considered a qualified donee by CCRA...  \n\n\n\n\nAt our most recent board meeting, our Board decided that it will only issue receipts for the charitable portion of a fund raiser if the proceeds are to be credited to an endowment we now administer. \n\n\n\n\nI have had a number of discussions with CRA about community foundations also being a direct deliverers of charitable services; this does not present a problem to CRA provided the letters patent allow for it.  If there is a doubt about a foundation’s ability to direct deliver, a letter can be directed to CRA and they will give an interpretation.  Community foundations of Canada, however, are not keen on the idea although, I am told, that a few community foundations do exercise this prerogative.  In any case, our Board decided not to pursue the issue at this time.  \n\n\n\n\nDuring my discussions with CRA, I raised the matter of an award to an individual that was not a scholarship.  Again, CRA has no objection in principle provided that our letters patent allow us to do it, the process is an open one and the population to which it applies is not too narrowly defined.  I would be quite prepared to seek a CRA ...",
  "size": 6869,
  "content_length": 3777,
  "garbage_ratio": 0.0061
 },
 {
  "slug": "letter-ask",
  "title": "Letter-ask",
  "summary": "Fundraising letter from Don Glendenning soliciting donations for the Citizen's Math project through Community Foundation of PEI. Explains that Education 20/20's innovative approach starts with surveying math skills needed in daily life rather than traditional curriculum development. Notes the $15,000 project cost with half for facilitator fees, the rest for analysis and local support. References that most people capable of leading such analysis have retired or moved away, demonstrating Don's resourcefulness in bringing in Meg Savory from British Columbia. Shows his vision of practical math education and commitment to educational innovation in PEI.",
  "content_preview": "1-8-math \n\nDear\n\nMATH FOR EVERY-DAY LIVING\n\n\n\n\nCurriculum development normally starts with an analysis of the subject under study; Education 20/20 believes that, instead, it should start by making a survey of math skills needed in every-day life.    This model engages learners early in the application of math to solving life’s daily prob0erms. It asks the question “how much math do you need to be a good citizen?”.  Education 20/20 Inc. proposes to ask Islanders just that question.\n\n\n\n\nEducation 20/20 proposes to convene a local group of citizens from various walks of life to undertake such a survey.  The process is widely used and usually involves 10 or so people working over a two- day period with an experienced facilitator. Life tasks or competencies are identified and organize in the form of a chart or map.  Islanders associated with Holland College may be familiar with such documents.  While we cannot guarantee that these maps  will be adopted by the education system, math maps will be useful to parents and students, teachers and employers in counselling, career planning, defining standards, determining qualifications and as a tool for life-long learning. Tracking student progress\n\n\n\n\n\n\n\nIt’s a $15,000 project, half of which will for an experienced facilitator.   $8, 000 to consultants to lead the analysis process and the rest for local support including facilities, meeting costs, printing, graphics, and consultation. Whereas at one time there were a half-dozen people on PEI who could lead such an analysis, all seem to have retired or moved away.  I am still looking but, in the meantime, I found someone living in British Columbia, still practicing and willing to come to PEI to lead the analysis process.  \n\nBUT WE NEED HELP TO MAKE THIS HAPPEN, FINANCIAL HELP. THAT IS.  We have opened an account at the Community Foundation of Prince Edward Island and are seeking contributions; donations are eligible for a chartable receipt and cheques should be made payable to th...",
  "size": 5625,
  "content_length": 2553,
  "garbage_ratio": 0.0055
 },
 {
  "slug": "letter-quality-education",
  "title": "letter Quality Education",
  "summary": "Philosophical letter defining quality education through UNICEF criteria (healthy learners, safe environments, relevant content, learner-centered processes, outcomes including attitudes/skills/knowledge). Don situates education as support for the \"road of life\" journey and argues these criteria reflect community concerns better than standardized test results alone. Advocates supplementing PISA/PCAP with broader quality measures.",
  "content_preview": "March 21, 2016\n\n\n\n\nDear Editor:\t\n\n\n\n\nA Quality Education\n\n\n\n\nThe road of life is a way of describing our journey between birth and death, and education provides help as we travel.  Help comes in many forms and from many people and its focus is on increasing and improving the knowledge, skills and attitudes needed to meet challenges along the way.  As a result, our quality of life will depend, to a large degree, on the quality of education that we experience.  \n\n\n\n\nIn 2000, UNICEF identified the characteristics of a quality education as one with:\n\nLearners who are healthy\n\nEnvironments that are healthy and safe\n\nContent that is relevant\n\nProcesses that are learner centered\n\nOutcomes that include attitudes, skills and knowledge\n\n\n\n\nIt seems to me that these are a good reflection of community concerns, lend themselves to large scale assessment, would give us a broader view of quality in our schools and be a welcome supplement the results of PISA, PCAP and school tests. \n\nSincerely\n\n\n\n\nDon Glendenning\n\nA long-time student of education",
  "size": 3436,
  "content_length": 1046,
  "garbage_ratio": 0.0038
 },
 {
  "slug": "letter-to-school",
  "title": "Letter to school",
  "summary": "Official congratulation letter dated May 19, 2016, from Don Glendenning (as President of Education 20/20) to Natalie MacNeill, Director of Fund Development at Grace Christian School, notifying the school of winning the 2016 Excellence in Education Award. Glendenning commends the school for integrating technology comprehensively across all aspects of school life, not merely providing tools but embedding them meaningfully into educational objectives. Notes the judges' impressment with how Grace Christian combines clear educational objectives, early engagement, and a remarkable range of activities for a small school. Letter expresses intent to visit for award presentation.",
  "content_preview": "May\n19, 2016\n\n\t\n\n\n\n\n\n\n\n\nNatalie MacNeill\n\n\nDirector of Fund\nDevelopment \n\n\n50 Kirkdale\nRd\n\nCharlottetown, PE  C1E 1N6\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear\nMs. McNeill:\n\n\n\n\n\n\n\nCongratulations; Grace\nChristian School has been selected for this year’s Excellence\nin Education Award.\n\n\n \n\nWe were greatly\nimpressed by the manner and extent to which Grace Christian School\nuses technology to enhance learning and teaching.  Your educational\nobjectives are clear, engagement starts early and you have an amazing\nrange of activities and applications available to your students –\namazing for a small school.  But it is not just the availability of\ntechnological tools, however, judges were impressed by the\nintegration of technology into every aspect of school life.  \n\n\n\n\n\n\n\n\n\nAgain, our congratulations\nand we look forward to visit to make the actual presentation\n\n\n\n\n\n\n\n\nSincerely\n\n\n\n\n\n\n\n\n\n\n\nDon\nGlendenning\n\nPresident\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCc:\nJason Biech",
  "size": 6401,
  "content_length": 934,
  "garbage_ratio": 0.0032
 },
 {
  "slug": "letter",
  "title": "Letter",
  "summary": "This is a fundraising letter dated July 10, 2019, written by Don Glendenning introducing the concept of numeracy to potential donors. Don explains that while PEI math test scores have risen, practical numeracy skills remain weak on the shop floor. He proposes a DACUM analysis to identify the 100+ math skills needed for everyday island life at a cost of $15,000, noting his prior success using this methodology at Holland College. The letter invites donations through the Community Foundation of PEI. This document showcases Don's continued professional engagement, his understanding of applied mathematics education, and his fundraising acumen in retirement.",
  "content_preview": "July\n10, 2019\n\n\n\n\n\n\n\n\n\n\n\nDear:\n\nMath\non PEI\n\n\n\n\n\n\nAlthough\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen wondering why.\n\n\n\n\n\n\nAll\nIslanders need math. they need to be able to measure, sort,\ncalculate, group and estimate numbers, space, time, distance, etc. \nand they need to do it quickly, easily, accurately; and consistently.\n This approach to math is called numeracy and it involves the\napplication of math to every-day lives. Numeracy is being adopted\nelsewhere; usually in addition to traditional math.  Numeracy focuses\non the math one uses rather than the math one knows.\n\n\n\n\n\n\nEducation\n20/20 Inc. proposes to undertake a survey or analysis of math skills\nused by Islanders in every day life. Making such an analysis involves\nbringing together a small group of representative Islanders for a\ntwo- day of brainstorming session; we expect that the process will\nresult in lost of 100 or more skills.  It’s a proven technique, we\nused it regularly at Holland College but apparently there is no one\non PEI now with the expertise.  The cost of an analyses is $15,000.  \n\n\n\n\n\n\n\nWe\nare looking for help cover the cost.  The Community Foundation, 121\nQueen Street, Charlottetown, PE, C1A 4B3 will accept donations on our\nbehalf and issue charitable receipts. \n\n\n\n\n\n\n\nI\nwill be in touch in the next few days to answer any questions and see\nif you can help. Thanks in advance,  The attached page provides\nadditional detail.\n\n\n\n\n\n\n\n\n\n\n\nSincerely,\n\n\n\n\n\n\n\n\n\n\n\nDon\nGlendenning   \n\n\n\n\n\n\n\n1-1-num",
  "size": 5697,
  "content_length": 1577,
  "garbage_ratio": 0.0
 },
 {
  "slug": "letterhead-word-top-bot-blank",
  "title": "Letterhead -Word-top&bot - blank",
  "summary": "Formal letter from Don Glendenning to Ray Murphy (Murphy Pharmacies) requesting financial support for a math education initiative on PEI. Demonstrates Don's research into numeracy issues and his strategy of engaging business leaders in educational improvement. References his DACUM-style brainstorming methodology (two-day sessions) and his establishment of a Community Foundation fund for contributions, showing his fundraising approach and commitment to practical education solutions.",
  "content_preview": "February\n20,  2019\n\nRay\nMurphy, President\n\nMurphy\nPharmacies\n\nCharlottetown\n\n\n\nPII,\nC1A xxx1-1-2\n\n\n\n\n\n\nDear\n\nMath\non PEI\n\n\n\n\n\n\nFor\nsome time now, I’ve been exploring math education in PEI.  Although\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen wondering why.\n\n\n\n\n\n\nI’ve\nbeen looking around and may have found the answer.  Islanders need\nmath, most of us, citizens, for example, don’t need a  high level. \nBut we all need to be able to measure, sort, calculate, group and\nestimate numbers, space, time  distance, etc,  and they need to do it\nquickly, easily, accurately; and consistently; This is known as\nnumeracy and it being adopted elsewhere; a copy of my notes are\nattached,\n\n\n\n\n\n\nBut\nI’d like to do more, I’d like to make an analysis of math skills\nused by Islanders. It involves bringing together a small group for a\ntwo- day of brainstorming session.   It’s a proven technique, we\nused it regularly but apparently there is no one on PEI now with the\nexpertise.  I’ll have to bring someone in at a cost $15,000.   \n(See enclosed description) I’m wondering if you could help with the\ncost.\n\n\n\n\n\n\nI\nopened a fund at the Community Foundation, 121 Queen Street,\nCharlottetown, PE, C1A 4B3; the Foundation will provide  charitable\nreceipts for contributions. \n\n\n\n\n\n\n\nI’ll\nappreciate any help you can give and would be happy to explain\nfurther and answer any questions.\n\n\n\n\n\n\nThanks\nin advance\n\n\n\n\n\n\n\nSincerely,\n\n\n\n\n\n\nDon\nGlendenning",
  "size": 5674,
  "content_length": 1524,
  "garbage_ratio": 0.0
 },
 {
  "slug": "letterhead-word-top-bot",
  "title": "Letterhead -Word-top&bot",
  "summary": "Formal solicitation letter from Don Glendenning to Karen Jackson of PEI Union of Public Sector Employees requesting a $1,500 lead grant to support innovative educational initiatives in Souris. Demonstrates Don's collaborative fundraising approach, emphasis on innovation in education, and partnership with community organizations. Notes Education 20/20's incorporation (2012), charitable status (2015), and activities including awards, newsletters, workshops, and consultations.",
  "content_preview": "January\n31, 2018\n\nKaren\nJackson, President\n\nPEI\n Union of Public Sector Employees:\n\n4\nEnman Crescent\n\nCharlottetown.\nPEI   C1E 1E6\n\n\n1-1-2\n\nDear\nMs. Jackson:\n\nSupporting\nInnovation in Souris\n\n\n\n\n\n\nFirst\nlet me commend you for your “UPSE Has a Heart” initiative, I\nnever really doubted it but it is great to see it reaffirmed.\n\n\n\n\n\n\nEducation\n20/20 Inc.  is an independent, broad based not-for-profit education\ngroup  that was incorporated in 2012 and received a charitable number\nin 2015 (822339-4).  It is headquartered in Charlottetown and is\ngoverned by a volunteer board. Activities include an annual education\naward, a monthly bilingual newsletter, workshops and public\npresentations, research and occasional papers and a variety low-key\nconsultations with various individuals and organizations.  More\ndetailed information may be found in the enclosed literature.\n\nInnovation\nis needed everywhere and can start anywhere.  Quite by accident we\nbecame aware of the Souris Garden club, a largely volunteer\ninitiative to introduce young people into gardening, food production\nand environmental matters. Since then, we’ve become involved in\nother educational issues especially issues around the transition of\nyoung people from school to work.  Offering financial support for\ninnovative educational initiatives is simply another component. \n\n\n\n\n\n\n\nThis\nletter is an invitation to the Union of Public Sector Employees to be\nthe lead donor with a $1,500 grant to fund an innovative educational\ninitiative in Souris; in return, Education 20/20 will raise a\nmatching amount .  With funds in hand, Education will then call for\nproposals as per the attached description.  Should our fundraising\nexceed the matching amount, we will apply the surplus to a similar\ninitiative in 2019.  Education 20/20 will not claim your contribution\nuntil we have a matching amount in our account.  By joining forces,\nwe can double the likelihood that innovation will find take in Souris\n\nWe\nthank you in advance for your con...",
  "size": 6118,
  "content_length": 2225,
  "garbage_ratio": 0.0
 },
 {
  "slug": "pro-forma-numeracy",
  "title": "Pro forma-Numeracy",
  "summary": "A November 30, 2014 solicitation letter from Don Glendenning to Roger Birt seeking support for a numeracy education research project. Don identifies a gap in PEI's math education: although test scores have improved, workers lack practical numeracy skills. He frames numeracy (quick, accurate application of mathematical knowledge) as a solution and proposes funding a $15,000 analysis of math skills used by Islanders. The letter reveals Don's sophisticated understanding of educational assessment, his willingness to bring in external expertise when needed, and his ability to identify specific, measurable problems and propose data-driven solutions. This correspondence exemplifies his role as an educational innovator and leader.",
  "content_preview": "November 30, 2014\n\n\n\n\n\n\n\nMr. Roger\nBirt, President\n\n\nR. Birt and\nAssociates\n\n\n27 Brackley\nPoint Road\n\n\nCharlottetown,\nPE  C1A 6Y1\n\n\n\n\n\n\n\n\n\n\n\n\nDear Mr.\nBirt:\n\n\n\n\n\n\n\nFor some\ntime now, I’ve been exploring math education in PEI.  I encountered\na conundrum; although PEI math scores on National and international\ntests have risen, friends tell me that it is not reflected on the\nshop floor.\n\n\nI asked\nmyself why:\n\n\n•\tWhen\nwere you last asked about the math your workers need?\n\n\n•\tHow\nmuch math do Islanders need anyway?\n\n\n•\tDo we\nneed more math or just to do better with what we have?\n\n\nI began to\nlook around and I think that I found the answer; our citizens need to\nbe able to use the math they have, more quickly, more easily and more\naccurately; that’s called numeracy and is being taught more and\nmore often in other Provinces and countries.  I’ve enclosed what\nI’ve learned so far.\n\n\nBut I’d\nlike to examine it more closely.  Enclosed also is a description of\nwhat I’d like to do, to make an analysis of math skills used by\nIslanders. We do not have the expertise to do this on the Island\nanymore; it’s a proven technique but I’ll have to bring someone\nin at a cost $15,000.    I’m looking for help with the cost.\n\n\nI opened a\nfund at the Community Foundation, 121 Queen Street, Charlottetown,\nPE, C1A 4B3; the Foundation will provide  charitable receipts. \n\n\n\nI’ll\nappreciate any help you can give and would be happy to explain\nfurther what we are doing.\n\n\nThanks in\nadvance\n\n\nSincerely,\n\n\n\n\n\n\n\nDon\nGlendenning   \n\n\n\n\n\n\n\n\nSincerely\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon Glendenning\n\n\nPresident",
  "size": 6843,
  "content_length": 1582,
  "garbage_ratio": 0.0
 },
 {
  "slug": "summary-of-responses-from-directors",
  "title": "Summary of responses from Directors",
  "summary": "Email thread from December 2018 following the unsuccessful 2019 award application cycle. Don Glendenning initiates discussion with stakeholders about future directions after receiving no applications despite past success. Contributors include Sharon Cameron (describing the SEAM/STAR poverty intervention program), Bill Whelan (suggesting focus on student interest/talent identification for career alignment), and Katherine McQuaid (expressing surprise at low interest). The correspondence reveals Don's collaborative leadership style, his willingness to engage with experts for input, and his commitment to understanding barriers to program participation. The discussion led to future directions emphasizing numeracy education.",
  "content_preview": "On Wed, Dec 26, 2018, 5:02 PM Don Glendenning <pei@education2020.ca wrote:\n\nI regret to report that we had no applications for this year’s education award; this letter comes to seek and share some ideas as to how to respond. \n\nTo recap, for the past five years we have offered an Education Award in the amount of $2,500.  The purpose of the award varied  from year to year.  The first two awards recognized engagement, the third recognized the application of technology throughout a school and last one recognized the wonders of mathematics, a program to demystify mathematics. This year we focused on transition; copy of description is attached. \n\nI’ve informed the committee of the current status and propose to call an early meeting to consider options; before doing so, however, I decided to solicit your views. I have the habit of dropping ideas into files from time to time; at the moment I find the following (a journalism award to published articles, (2) a writing award for high school students and (3) an award for numeracy.   the donor is not yet aware of the situation, I will discuss the matter with him soon; I am sure that he would be quite \n\nOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO\n\nOn December vv, 2018 Sharon Cameron wrote:\n\nI have an idea that may fit. When I worked on the poverty file in executive council office I developed a program called SEAM/STAR. The target population was high school students who were identified as living in generational poverty. They were not identified as having significant mental health or addictions issues as that population tends to have connections to multiple systems and service agencies. The students we targeted were those who were identified as voiceless and invisible. \n\nThe purpose of our program was to break the poverty cycle and develop a new trajectory for these students. This past summer was the 3rd year for the program and the government has recognized it as a valued program to fight poverty and has ...",
  "size": 8474,
  "content_length": 5124,
  "garbage_ratio": 0.0042
 }
]