[
 {
  "slug": "0-my-intro",
  "title": "0 My intro",
  "summary": "(100-200 words):**\nDraft speaking notes for presentation opening, likely for education-focused event or lecture. Brief outline containing: appreciation for invitation; thanks to group for community contributions; reference to community member Annie Gulliver and her story about writing junior matrics (\"Does your mother know\" - possible song or cultural reference), attending one-room rural school at age 17, and promise to add story about MRHS (Maritime Rural High School?). Sketch outline lacks substantive development, suggesting preliminary notes or incomplete draft. Reference to rural education and one-room schools suggests nostalgic connection to educational past. Presence in education binder materials suggests Don drew on historical education examples or community stories to illustrate contemporary education analysis. May represent planned public engagement with education reform themes.",
  "content_preview": "MY INTRO\n\nAppreciate invitation\n\nThank group for their contributions to our community\n\nAnnie Gulliver\n\n  \nwrite junior matrics\n  \nDoes your mother know\n  \nOne room rural school at age 17\n  \nAdd story about MRHS",
  "theme": "06-speeches"
 },
 {
  "slug": "0-presentation",
  "title": "0 Presentation",
  "summary": "Don's 2021 presentation on education defining key concepts, education system services, and systemic issues. Demonstrates his ongoing education reform thinking late in life, addressing governance, mission clarity, accountability, and cultural change within education systems.",
  "content_preview": "About\nEducation\n\nGlendenning\n\n\n\n\n\n\nPRESENTATION\n\n\nAbout\n4-11\n\n\n2021-11-22\n\n\n\n\n\n\nINTRODUCTION\n\nSome\npreliminary notes. \n\n\n\n\n\n\n\nKEY\nDEFINITIONS\n\n\t\n\nEducate\n\t- Help people change the way they think, feel or act\n\t\n\nEducation-a\n\tsector of the economy concerned with helping people learn \n\t\n\t\n\nPurpose\n\t of education system – to help people change the way they way they\n\tthink, feel or act \n\t\n\t\n\nTeacher-\n\ta person, usually paid, who organizes and creates  experiences for\n\tother people as a way of helping",
  "theme": "06-speeches"
 },
 {
  "slug": "0-prrsentation",
  "title": "0 Prrsentation",
  "summary": "This document outlines presentation notes for Don's education framework, structured as a table of contents for a comprehensive presentation or binder. It covers welcome, PEI clientele (citizens and community), education definitions and principles, learners and learning models, education services (governance, information/counselling, instruction, human resources, quality assurance, learning products, funding), service delivery models, issues, and appendices. The structure demonstrates Don's systematic approach to presenting complex educational concepts, likely used for public presentations, workshops, or stakeholder meetings. The outline indicates a structured progression from foundational concepts through practical implementation and assessment.",
  "content_preview": "FRAMEWORK\n\nPresentation Notes\n\n4-1-Binder-contents\n\n  \nWelcome\n  \nPEI Clientele\n\n\n  \nCitizens – population statistics, essential skills, Life roles\n  \nCommunity – skilled people, \n\n\n  \nEducation\n\n\n  \nKey definitions\n  \nUnderlying beliefs\n  \nGuiding principles\n  \nLearners and learning – learning model, path, learning chart,\n  \nFunctions\n\n\n  \nEducation services \n\n\n  \nGovernance and leadership\n  \nInformation and counselling\n  \nInstruction\n  \nHuman resources\n  \nQuality Assurances\n  \nLearning product",
  "theme": "06-speeches"
 },
 {
  "slug": "0-visuals-handouts",
  "title": "0 Visuals-handouts",
  "summary": "This document is an outline for supporting materials and visual handouts for Don's education framework presentations. It catalogs various visual/conceptual frameworks including personal notes, beliefs (general and key), Bloom's Taxonomy, communications, curriculum, education concepts, functions, gaps, innovations, issues, learners, learning paths and processes, life roles, educational philosophy, principles, rating scales, school system components, services, and teaching. Also lists occasional papers and appendices. This appears to be a resource index for generating presentation materials, charts, and visual aids to support Don's education framework presentations and trainings.",
  "content_preview": "FRAMEWORK\n\nSupport of materials\n\n\n\n\nOUTLINE\n\nPERSONAL NOTES\n\nSUPPORT\n\nBeliefs, general\n\nBeliefs, key\n\nBlooms Taxonomy\n\nCommunications\n\nCurriculum\n\nEducation\n\nEducation System\n\nEducation, Functions\n\nEducation, services\n\nFunctions, Schools\n\nFunctions. Education\n\nGaps\n\nInnovations\n\nIssues\n\nLearners\n\nLearning Path\n\nLearning Process\n\nRoles. Life\n\nRoles, duc. Prov\n\nNeeds, Maslow\n\nOutcomes\n\nPEI Philosophy\n\nPrinciples\n\nRating Scale\n\nRoad of Life\n\nSchool system components\n\nServices\n\nTeaching\n\n\n\n\nOCCASION",
  "theme": "06-speeches"
 },
 {
  "slug": "002-speaking-notes",
  "title": "002 Speaking notes",
  "summary": "April 2014 speaking notes on education system faults, emphasizing lack of learner-centeredness, accountability, and government-run rigidity. Proposes immediate and long-term changes including external qualification authority and educational think tank, reflecting Don's lifelong education advocacy.",
  "content_preview": "April 1, 2014\n\nSPEAKING NOTES  \n\n\n\n\n\n\n\nOpening remarks:\n\nEducation is most important issue of the day\n\nCost of speaking out too high for most Islanders\n\nIt is my profession\n\nMy comments are not unique to PEI\n\nThose in charge today did not create the system today but they have the responsibility\n\n\n\n\nSystem faults\n\nHave a school system masquerading as an education system \n\nLacks service that is equivalent to that of a doctor, lawyer or accountant \n\nSystem is not capable of changing itself\n\nBecause",
  "theme": "06-speeches"
 },
 {
  "slug": "01-personal-public-statement-2",
  "title": "01 Personal public statement-2",
  "summary": "Public policy statement from Education 20/20 Inc. dated March 16, 2015, framing education gap on PEI. Opens with philosophical statement on education's role in life preparation and quality of life. Identifies specific gaps: limited educator-community engagement, lack of comprehensive education philosophy, government focus on youth/schooling only, absence of independent educational information, limited part-time instruction, limited market conditions, politicization of decisions, and constraints on professional autonomy. Outlines five recommendations addressing vision development, learner-centered services, government leadership, instructional delegation, and qualification authority. References Education 20/20 contact information and website.\n- **Key People**: Don Glendenning (author/affiliated)\n- **Key Organizations**: Education 20/20 Inc., PEI Department of Education\n- **Tags**: PROFESSIONAL, EDUCATION, HOLLAND_COLLEGE, SPEECH, TECHNICAL\n- **Eulogy Relevance**: MEDIUM - Documents Don's public policy advocacy and organizational affiliation with Education 20/20.",
  "content_preview": "About,\n00\n\nMarch\n16, 2015\n\nA\nFramework for educational change-2\n\n\n\n\n\n\nPreparation\nfor life’s roles is called education and the better prepared we\nare, the better we are able to cope with all that we encounter, or\ncreate.  And education is made more complex by the fact that each\nperson is unique; unique in basic physical, mental, emotional and\nsocial make up, unique in range and nature of previous experience,\nunique in perceived futures, but also unique in terms of learning\npace, style and needs.",
  "theme": "06-speeches"
 },
 {
  "slug": "1-3-5-2-b-hs-draft-questions",
  "title": "1-3-5-2-B HS  Draft questions",
  "summary": "Dated July 8, 2015, this survey instrument contains five draft questions designed to gauge public opinion on PEI high school policy issues. Questions address provincial exam reinstatement, value for education dollar, exemptions from final exams, minimum basic skills requirements for graduation, and prioritization of high school roles (basic skills, citizenship, employment preparation, further study, childcare). Each question includes audience segmentation (parents, educators, employers, grandparents, students). The document represents exploratory research methodology for understanding stakeholder perspectives on education system design and student achievement standards.",
  "content_preview": "1-3-5\n\nJuly 8, 2015\n\nPossible Survey Questions\n\n\n\n\nQuestion 1\n\n\n\n\nDo you think that it is time for PEI to reinstate “Provincial Exams” for high school graduates? \n\n\n\n\nAre you a:\n\n  \nParent with a child in school\n  \nEducator\n  \nEmployer\n  \nGrandparent\n  \nStudent\n\n\nQuestion 2\n\n\n\n\nEducation is the second largest item in the PEI budget; do you think that you get good value for your education dollar?\n\n\n\n\nAre you a:\n\n  \nParent with a child in school\n  \nEducator\n  \nEmployer\n  \nGrandparent\n  \nStudent\n\n\n",
  "theme": "06-speeches"
 },
 {
  "slug": "1-a-dacum-practical-math",
  "title": "1- A-DACUM Practical Math",
  "summary": "Visual presentation variant of DACUM practical mathematics (similar to File 4) with slightly different formatting arrangement. Contains the same nine competency areas with visual clustering. Minor formatting variations suggest iterative design process where Don tested alternative layouts for clarity and usability. The \"A\" designation in filename indicates this is an alternative version in a series of design iterations.",
  "content_preview": "CALCULATE USING WHOLE NUMBERS\n      \n      \n        \n\n\n      \n      \n        \nInterpret the real system of numbers\n      \n      \n        \nRead and write whole numbers\n      \n      \n        \nAdd whole numbers\n        \n\n\n      \n      \n        \nSubtract whole numbers\n        \n\n\n      \n      \n        \nMultiply whole\n        \n     numbers\n      \n      \n        \n  Divide whole \n        \n      numbers\n      \n      \n        \n   Solve whole \n        \n numbers using\n        \n     order of\n        \n    ope",
  "theme": "06-speeches"
 },
 {
  "slug": "1-a-framework-notes",
  "title": "1-A FRAMEWORK NOTES",
  "summary": "This is the first presentation framework notes documenting the core educational philosophy. It establishes that education is the most urgent issue of the day, crucial to individual futures and community development. The document introduces the metaphor of life as a journey with travelers playing six roles: individual, family member, citizen, student, consumer, and producer. It describes each traveler's unique characteristics (innate conditions, learning experiences, and aspirations) and identifies barriers on life's road. The framework outlines how education issues require information, instruction, practice, counseling, feedback, and self-study resources, with support coming from family, self, community, schools, friends, and others.",
  "content_preview": "POWERPOINT\n\nAn Education Framework\n\n\n\n\nEDUCATION IS THE MOST URGENT ISSUE OF THE DAY\n\nOUR INDIVIDUAL FUTURES, AND THE FUTURE OF OUR COMMUNITY, DEPENDS TO A LARGE DEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR OUR CITIZENS\n\nENSURING QUALITY REQUIRES THE EFFORTS OF MANY AND A SHARED VISION BY ALL\n\nTHIS PRESENTATION PROVIDES A FRAMEWORK FOR CONVERTING THOSE VISIONS TO REALITY\n\n\n\n\nWE ARE ALL TRAVELLERS ON THE ROAD OF LIFE  \n\nAND MOST PLAY ALL ROLES: THERE ARE SIX\n\nTHAT OF AN INDIVIDUAL, FAMILY MEM",
  "theme": "06-speeches"
 },
 {
  "slug": "1-a-practical-math-chart",
  "title": "1- A-Practical Math Chart",
  "summary": "Alternative chart version of practical mathematics framework similar to Files 5 and 7, representing another iteration of visual curriculum presentation. Maintains the same nine-category structure with slight layout modifications. Consistent repetition of similar formats across multiple files demonstrates Don's meticulous attention to creating accessible, well-designed educational materials suitable for diverse audiences.",
  "content_preview": "CALCULATE USING WHOLE NUMBERS\n      \n      \n        \n\n\n      \n      \n        \nInterpret the real system of numbers\n      \n      \n        \nRead and write whole numbers\n      \n      \n        \nAdd whole numbers\n        \n\n\n      \n      \n        \nSubtract whole numbers\n        \n\n\n      \n      \n        \nMultiply whole\n        \n     numbers\n      \n      \n        \n  Divide whole \n        \n      numbers\n      \n      \n        \n   Solve whole \n        \n numbers using\n        \n     order of\n        \n    ope",
  "theme": "06-speeches"
 },
 {
  "slug": "1-b-framework-notes",
  "title": "1-B FRAMEWORK NOTES",
  "summary": "This is a slide-based version of the framework notes with significant white space between content sections, suggesting it's designed for a multi-slide presentation. It reiterates the core framework with the same conceptual structure as File 2, presenting the foundational concepts of the \"Road of Life\" metaphor with life roles, individual characteristics, and educational barriers. The document maintains consistent messaging about education being essential for individual and community futures, with extensive empty space indicating visual design for presentation delivery.",
  "content_preview": "POWERPOINT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\nEDUCATION IS THE MOST URGENT ISSUE OF THE DAY\n\nOUR INDIVIDUAL FUTURES, AND THE FUTURE OF OUR COMMUNITY, DEPENDS TO A LARGE DEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR OUR CITIZENS\n\nENSURING QUALITY REQUIRES THE EFFORTS OF MANY AND A SHARED VISION BY ALL\n\nTHIS PRESENTATION PROVIDES A FRAMEWORK FOR CONVERTING THOSE VISIONS TO REALITY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "theme": "06-speeches"
 },
 {
  "slug": "1-c-framework-notes",
  "title": "1-C FRAMEWORK NOTES",
  "summary": "This version expands on the framework with introductory context, emphasizing that the framework applies to all people regardless of life stage. It refines the presentation of unique characteristics and barriers, including more detailed landscape metaphors (hills, hollows, rough spots, rocky stretches, flooded areas). The document introduces the concept of detours and emphasizes that barriers may arise from personal conditions, interpersonal issues, and societal factors (poverty, discrimination). Educational support includes information, instruction, practice, counseling, feedback, and self-study resources from a learning village of family, self, community, schools, friends, and others.",
  "content_preview": "POWERPOINT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\nTHE NEXT FEW MINUTES PROVIDE AND INTRODUCTION AND FRAMEWORK FOR THINKING ABOUT EDUCATION\n\nIT IS AN ISSUE OF IMPORTANCE TO ALL OF US REGARDLESS OF WHERE WE ARE ON LIFE’S JOURNEY.\n\nEDUCATION IS THE MOST URGENT ISSUE OF THE DAY BECAUSE \n\nOUR INDIVIDUAL FUTURES, AND THE FUTURE OF OUR COMMUNITY, DEPENDS TO A LARGE DEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR YOU, FOR ME AND ALL OUR CITIZENS\n\nENSURING QUALITY REQUIRES THE EFFORTS OF MANY AND A SHARED VISION BY A",
  "theme": "06-speeches"
 },
 {
  "slug": "1-d-framework-notes",
  "title": "1-D FRAMEWORK NOTES",
  "summary": "Titled \"Our Education Journey,\" this version provides comprehensive slide notes with significant white space for visual presentation. It reintroduces the framework with refined language: \"Our Personal Knapsacks\" (instead of characteristics), \"The Road of Life Has a Number of Lanes\" (six life roles), and \"Barriers on the Road of Life\" (comprehensive list including cultural, personal, workplace, poverty, friends, time, emotional, social, and basic skills barriers). Educational support comes through information, instruction, practice, counseling, feedback, and self-study resources from a \"Learning Village\" of family, self, community, schools, friends, and others.",
  "content_preview": "OUR EDUCATION JOURNEY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTHE NEXT FEW MINUTES PROVIDE AND INTRODUCTION AND FRAMEWORK FOR THINKING ABOUT EDUCATION\n\nIT IS AN ISSUE OF IMPORTANCE TO ALL OF US REGARDLESS OF WHERE WE ARE ON LIFE’S JOURNEY.\n\nEDUCATION IS THE MOST URGENT ISSUE OF THE DAY BECAUSE\n\nOUR INDIVIDUAL FUTURES, AND THE FUTURE OF OUR COMMUNITY, DEPENDS TO A LARGE DEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR YOU, FOR ME AND ALL OUR CITIZENS\n\nENSURING QUALITY REQUIRES THE EFFORTS O",
  "theme": "06-speeches"
 },
 {
  "slug": "1-learnwesyear-end-3",
  "title": "1-Learnwesyear end 3",
  "summary": "Editor letter assessing education outlook for the coming year, predicting minimal change as government relies on existing 30-year-old philosophy without planned improvements. Notes federal government historically provided education-for-employment leadership through federal-provincial agreements but withdrew that role; recent ad hoc services attempt to address resulting gaps. References postsecondary costs escalation in US and predicts PEI will appreciate school board restoration if accompanied by enhanced professional autonomy and accountability measures.",
  "content_preview": "Editor-year-end-\n\nEducation Outlook for 20/20\n\nEducation outlook for coming year looks relatively unchanged. Government expected to rely on existing statement of philosophy.  There is not indication that education will deal with the confusing application of education to both formal study in school and the broad term implying help to all learners.  Insiders report that the fear factor is still a major challenge to open debate.\n\nHistorically, education for employment has depended on both financial",
  "theme": "06-speeches"
 },
 {
  "slug": "10-clarity",
  "title": "10 Clarity  -",
  "summary": "Opinion/essay advocating for conceptual clarity in education discourse, distinguishing between education as service and school as venue. Argues that educational experiences matter more than institutional structures and calls for precision in educational terminology. Reflects Don's communication philosophy and educational leadership principles, likely prepared as public commentary or speech.",
  "content_preview": "10\n\n\n\n\n\n\nA\nCALL FOR CLARITY\n\n\n\n\n\n\nAs\na frequent participant in conversations about education, I am struck\nby the absence of definitions and boundaries; communication and\nunderstanding may suffer as a result. \n\n\nThe\nDictionary of Education (Good) defines definition as “the process\nof determining the definition or meaning of a word, idea or\nproposition in general and within a given context; the process of\nassigning meaning enhances both precision and clarity.”\n\n\n\n\n\n\n.\nThose who teach, or other-wis",
  "theme": "06-speeches"
 },
 {
  "slug": "100-2-learners-and-learning-script",
  "title": "100-2 Learners and learning - Script",
  "summary": "Presentation script for webinar on learners and learning, foundational to Don's educational philosophy. Explains learning as lifelong behavioral change across affective, psychomotor, and cognitive domains, emphasizes learning occurs throughout life beyond school, introduces the Oregon life roles model, and details conditions nurturing learning. Demonstrates Don's pedagogical approach grounded in understanding individual learner development.",
  "content_preview": "100-2\n\n\nJune 9, 2013\n\n\nEDUCATION SERIES\n\n\n\n\n\n\n\n\nLearners and Learning\n\n\n\n\n\n\n\n\n\n\n\nBirth______________________________________________________________Death\n\n\nRoad\nof Life\n\n\n\n\n\n\n\nLearner\n– every person is\na learner on  the road of life\n\n\n\n\n\n\nAt\nbirth, we are launched on the road of life; it is likely to be long,\ncomplex and sometimes rocky.  \n\n\n\n\n\n\n\nThe\ngood news is that there is help available, help may be in a number of\nforms, but this presentation deals with help in the form of\neducation.\n\n\n\n\n\n\n",
  "theme": "06-speeches"
 },
 {
  "slug": "108-minutes-november21-2007",
  "title": "#108-Minutes November21, 2007",
  "summary": "Minutes from Meeting #108 (November 21, 2007) showing Don's continued leadership and strategic contributions. Documents his presentation of office layout plans and financial advisor outreach strategy for Information/Publicity Committee. Shows Don's involvement in discussions about the annual reception (to be held earlier in year), grant distribution, and 2008 planning. Minutes note the welcome of new Director LouAnn Thomson and reflect ongoing collaboration with core leadership team including Norman Carruthers, David Campbell, Tom Davies, John Robinson, and Myron MacKay.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nBoard Minutes\n\n\n\n\nMeeting No:\t\tMeeting #108\n\nDate and time:\t10:00 a.m., November 21, 2007\n\nLocation:\t\tBoard Room, Century 21, St. Peters Road\t\t\n\n\n\n\nIn attendance: Norman Carruthers, David Campbell, Myron MacKay, \n\nTom Davies, Joyce Gaudet, Don Glendenning, Marie Salamoun-Dunne\n\nHeather MacDonald, John Ives, LouAnn Thomson\n\nRegrets: \tJohn Robinson, David Anderson\n\n\n\n\nCall to Order and Welcome – Norman issued a special welcome to our newest Director",
  "theme": "06-speeches"
 },
 {
  "slug": "12-road-of-life-0119-1",
  "title": "12 Road of life -0119 (1)",
  "summary": "Educational presentation on the concept that education encompasses formative experiences affecting how people think, feel, and act. Provides key definitions distinguishing between education, school, schooling, learning, teaching, and standards. Associated with Education 20/20 Inc. in Charlottetown, PEI.",
  "content_preview": "It’s\n\tabout Education…\n\t\n\n\n\n\t\n\t\n…and\n\tthe experiences that\n\t\nhave\n\ta formative effect \n\t\n\t\non\n\tthe way we \n\t\n\t\n\n\t    think,\n\t\n\t\n\t\n\n\t  feel,\n\t \n\t\n\t\nact.\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nEducation\n\t20/20 Inc.\n\t\n101\n\tKent St., PO Box 624/rue Kent, BP 624\n\t\nCharlottetown,\n\tPEI C1A 1M0 Canada\n\t\nTel:\n\t902-892-2060\n\t\nEmail:\n\tpei@education2020.ca\n\t\n\n\twww.education2020.ca\n\t\n\n\t\n\n\t\n\n\n\n\t\n\t\nIt’s\n\tabout Education…\n\t\n\n\n\n\t\n\t\n…and\n\tthe experiences that have a formative   effect \n\t\n\t\non\n\tthe way we \n\t\n\t\n\n\n\n\t\n\t\n\n\t    think,",
  "theme": "06-speeches"
 },
 {
  "slug": "1918-don-notes-after-presentation",
  "title": "1918- don-notes after presentation",
  "summary": "These personal notes capture Don's key takeaways following a project presentation. He identifies community needs for better information about educational offerings, a local person to promote new programs, and hands-on practical education emphasis. Key possible projects include supervised online courses with a local learning manager, support for transforming Souris School into a community school, encouraging post-secondary institutions to offer program modules locally, and initiating a research project on workforce training delivery to rural communities. The notes emphasize the importance of local coordination and community-level programming.",
  "content_preview": "SOURIS PROJECT\n\nMy takeaway from presentation\n\nSouris 1919-1\n\nNeeds  \n\n  \nMore information about offerings\n  \nA person in the community to promote new offerings\n  \nA local learning manager\n  \nIncreased emphasis on hands-on, application, practical education (Need to clarify what this means)\n  \n Training support needed for all domains:  attitudes, skills and knowledge\n  \nEncourage local cooperation and support\n\n\n \n\nPossible projects:\n\n  \nSupervised on-line courses, need a facility with 10 computer",
  "theme": "06-speeches"
 },
 {
  "slug": "2-delivery-proposed",
  "title": "2 Delivery Proposed",
  "summary": "Proposed education delivery system diagram dated 2017, showing recommended restructuring of educational providers and services. Similar institutional categories as current system but implies reorganization or prioritization changes. Emphasizes professional organizations, coordinated educational access, and integrated service delivery. Represents Don's visionary thinking about how PEI's education system should evolve to better serve all citizens. Less detailed than current system diagram but suggests streamlined, more coordinated approach to educational service delivery.",
  "content_preview": "EDUCATION\nDELIVERY SYSTEM-CURRENT\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nPresent\n\n\n2017\n\nFor profit\n\n\n\n\n\n\n\t\n\n\n\tPROFESSIONAL\n\tORGANIZATIONS\n\t\n\n\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tkindergarten\n\t& ECE\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\n\n\n\n\n\n\t\n\t\nEARLY\n\tcHKindergarten\n\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n\n\tPublic\n\tSchools\n\n\n\n\tCitizen\n\n\n\n\n\t\n\n\n\n\t\n\n\t\n\n\n\n\n\tMEDIA\n\t\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\n\tPostsecondary\n\t\n\n\n\n\n\n\tEDUCATION\n\tSTORES\n\n\n\n\n\n\n\n\n\n\n\n\tPrivate\n\tschools\n\n\n\n\n\n\n\n\t\n\n\n\n\n\tSPECIALISTS\n",
  "theme": "06-speeches"
 },
 {
  "slug": "2-learning",
  "title": "2 Learning",
  "summary": "Educational philosophy piece defining learners and the learning process. Explains that all people are learners with different capacities and life roles (individual, student, citizen, family member, producer, consumer). Details that learning involves measurable change in knowledge, beliefs, feelings, and abilities. Presents teaching as arranging experiences for others' learning. Includes comprehensive critique of PEI education system's failure to define terms clearly, conflation of school attendance with education, and recommendations for adopting shared definitions and implementing systemic change to address organizational accountability and program advisory structures.",
  "content_preview": "About\nEducation\t\t\t\t\t\t\t\t\n\n\nLearners\nand Learning\n\n\n\t\t\n\t\t\t\t\t                             \t           About 4-16\n\n\n\n\t     \n\t\n\t\n\n\tLearners are people who, for whatever\n\treason, are trying to bring about change in their lives – trying\n\tto change an acritude, gain new knowledge, or add skills. But\n\tlearners are neither empty jars or blank slates; each learner\n\tcarries three pieces of luggage to every new learning situation:\n\t\n\t\t\n\n\n\t\tCertain\n\t\tphysical, mental nd emotional conditions with which a learn",
  "theme": "06-speeches"
 },
 {
  "slug": "2-presentation-to-standing-committee-2014-2015-04-01t00-59-24",
  "title": "2 Presentation to Standing Committee-2014@2015-04-01T00;59;24",
  "summary": "Formal presentation to Standing Committee on Education and Innovation outlining Education 20/20's mission and framework for educational change in PEI. Glendenning articulates definitions of education versus schooling, describes consultation findings showing Islanders want change but feel excluded from decision-making, and proposes characteristics of quality education systems including professional teacher autonomy, learner-centered support, and community engagement.",
  "content_preview": "September\n30, 2014\n\nPresentation\nto \n\n\nStanding\nCommittee on Education and Innovation\n\nFramework\nfor decision-making\n\n\n\n\n\n\nEducation\n20/20 Inc.\t\n\nEducation\n20/20 is a national, not-for-profit education organization, located\nin Charlottetown, PEI. We are governed by a volunteer Board of\nDirectors, comprised of people who have demonstrated an interest in\nand knowledge of education, but are not representative of an\neducational constituency. Our mission is to improve the quality of\neducation for eve",
  "theme": "06-speeches"
 },
 {
  "slug": "20-1-2-obe-paper",
  "title": "20-1-2 OBE paper",
  "summary": "Revised version of OBE paper with similar structure to File 17 but streamlined presentation. Includes background comparing traditional content-based education with OBE's learner-centered, outcomes-focused approach. Presents Spady's \"OBE Paradigm\" with three premises and four power principles. Provides definitions and characteristics of OBE systems emphasizing clear outcome statements, high expectations, individualized help, demonstrated achievement, and community involvement. Lists strengths (consistency, accountability, accessibility) and weaknesses (lack of standard models, confusion between outcomes and levels, implementation challenges in time-based schools). Includes examples of exit outcomes and recommendations for PEI. Document concludes that while province is commended for OBE commitment and regular reviews, it is time to update the model, implement additional elements, renew outcome identification process, and prepare implementation handbook.\n- **Key People**: Spady, William\n- **Key Organizations**: PEI Department of Education, Saranac Lake Central School District, Atlantic provinces, Michigan schools\n- **Tags**: EDUCATION, PROFESSIONAL, HOLLAND_COLLEGE, MANUSCRIPT\n- **Eulogy Relevance**: HIGH - Represents Don's detailed analysis and recommendations for educational reform specific to PEI context. Shows his role as educational consultant and thought leader on curriculum matters.",
  "content_preview": "200-1-3\n\n\nOutcomes Based Education\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBackground\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTraditionally\nschools focused on content to be learned, whether it be on the arts,\nscience or business.  Fields are divided into subjects, courses and\nunits and lectures or lessons for the purpose of teaching and\nlearning. Assignments and assessment followed suit.  One’s\neducation, at least the part experienced in school, became the study\nof a series of discrete experiences too seldom integrated into a\ncoherent life relate",
  "theme": "06-speeches"
 },
 {
  "slug": "2005-probus-profile",
  "title": "2005-Probus Profile",
  "summary": "November 2004 Probus presentation profiling Don's biography from Miramichi farming family, teacher roles, and founding presidency of Holland College. Traces his educational philosophy development and commitment to vocational education, capturing his journey from youth to professional expertise.",
  "content_preview": "Notes for Probus Profile Presentation\n\nCharlottetown, PEI\n\nThursday, November 12, 2004\n\n\n\n\nFamily\n\nLike all Miramichiers, born young and got an early start\n\nYoungest of nine.\n\nDad came from down shore near Bathurst\n\nMother from Miramichi\n\nMost members of both families went to work in USA\n\nHeavy construction – mostly dams in Wisconsin, Tennessee. Alabama, Texas, Connecticut\n\nLangley Field Virginia\n\nCame to Miramichi in 1919 and farmed until his death in 1938\n\n\n\n\n\tMarried 46 years\n\n\tCarol a US cit",
  "theme": "06-speeches"
 },
 {
  "slug": "2007-1-robertson-mark",
  "title": "2007-1 Robertson, Mark",
  "summary": "A memorandum (SD-2007-2) dated August 21, 2007, documenting Don's discussion with Mark Robertson regarding potential involvement with CFPEI. The memo outlines areas where the foundation needed support: editor of community reporter, media releases, brochure preparation, information sessions, electronic newsletter editing, and presentations to professional advisors. Don notes Robertson's impression of a recent board presentation and his willingness to serve on a development committee. The memo demonstrates Don's systematic approach to volunteer recruitment and board development, his ability to identify organizational needs, and his skill at matching individuals with opportunities where they can contribute.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nSD-2007-2\n\nDate:\t\tAugust 21, 2007\n\nPrepared by:\tDon Glendenning\n\n\n\n\nSubject;\tDiscussions with Mark Robertson\n\n\n\n\nI had coffee yesterday with Mark Robertson to talk about our mutual interests in CFPEI; in particular, \n\n\n\n\nI identified the following as areas of need:  Editor of community Reporter, media releases, preparation of brochures, community information sessions, Editor of the electronic newsletter, presentations to professional advisors, etc",
  "theme": "06-speeches"
 },
 {
  "slug": "2007-credit-union",
  "title": "2007 Credit Union",
  "summary": "Presentation proposal (March 12, 2007) to Credit Union Central of PEI for \"Community Challenge Initiative.\" Proposes supporting communities in establishing undesignated charitable endowments through matching grants model: CFPEI matches community contributions at rate where $5,000 community fundraising generates $1,000 annual CFPEI grants. Initiative builds $25,000 endowments over five years, enabling perpetual community giving. Demonstrates Don's strategic thinking about leveraging CFPEI resources to catalyze community development and long-term charitable sustainability.",
  "content_preview": "Credit Union\n\n\n\nPresentation Notes\n\n\n2\t           \t\t\t\t\t            \n    March 12, 2007\n\n\n\n\t\n\n\n\t\n\t\nCommunity\n\tChallenge Initiative\n\t\n\n\n\n\t\n\t\nBackground:\n\t\n\n\n\n\t\n\t\nThe Community\n\tFoundation of Prince Edward Island works with Islanders and Island\n\torganizations with an interest, and often a passion, for bettering\n\ttheir community many also have the means to make a difference.\n\t\n\n\n\n\t\n\t\nBased on\n\tour experience, we find that communities respond to charitable needs\n\ton a crisis basis i.e. new hospital e",
  "theme": "06-speeches"
 },
 {
  "slug": "2007",
  "title": "2007",
  "summary": "Comprehensive speaking notes (February 12, 2007) for CFPEI information session articulating foundation mission and operations. Emphasizes CFPEI's 15-year history, volunteer governance structure, and positioning among 130+ Canadian community foundations. Details four operational pillars: endowment building (30+ funds), grant-making, community problem-solving, and office administration. Highlights differentiation from traditional charities through donor-directed model, endowment focus, and emphasis on perpetuity. Showcases Don's ability to communicate foundation value proposition to prospective supporters and community leaders.",
  "content_preview": "February 12, 2007\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nSpeaking Notes\n\nOpening remarks \t\n\nWelcome attendees\n\nCoffee\n\nIntroduce CFPEI people present (Use insert)\n\nOne of a number of information sessions being held throughout the Island\n\n\t\tWelcome questions at any time\n\n\n\n\n2\tCFPEI\t\n\nA volunteer driven, non-profit and Island wide charitable organization \n\nMore than 130 sister institutions across the country.\n\nVolunteer  Board of 12 drawn from across the Island (refer  to insert)\n\nEs",
  "theme": "06-speeches"
 },
 {
  "slug": "2009-01-07-agenda",
  "title": "2009-01-07 Agenda",
  "summary": "Development Committee meeting agenda dated January 7, 2009, led by Don (opening remarks). Agenda items include persons of interest discussion (Norman), donor liaison update (Jeniene), professional advisors presentations (Heather), existing trusts/cemetery outreach (David and Donnie), liaison with charitable organizations (Tom), promotional brochure development (Marie and John), and Cotton Trusts discussion. Shows Don's leadership coordinating multiple committee workstreams.",
  "content_preview": "Community Foundation of Prince Edward Island\n\nAgenda – Meeting # \n\nDate: January 7, 2009; 10:30 am\n\nCFPEI Office\n\n\n\n\n  \n    \n      \n        \nItem\n      \n      \n        \nDescription\n      \n      \n        \nAction\n      \n    \n    \n      \n        \n1\n      \n      \n        \nWelcome and opening remarks \n        \nMinutes of meeting on November 5- available at meeting\t\t\n        \n      \n      \n      \n        \nDon\n      \n    \n    \n      \n        \n2\n      \n      \n        \nPersons of Interest: \n        \nWher",
  "theme": "06-speeches"
 },
 {
  "slug": "2009-12-community-needs-opportunities",
  "title": "2009-12 Community needs-opportunities",
  "summary": "An undated strategic document identifying community needs that CFPEI could address, including literacy training, capacity building for smaller organizations, educational improvement initiatives, and youth philanthropy programs. Don recognizes fragmentation in service delivery and advocates for CFPEI to serve as a \"third force\" supporting improvement in critical areas. He highlights the third sector's importance in social and economic development and positions CFPEI as uniquely qualified to lead organizational capacity building, improve sector communication, and support information technology implementation.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nProposed List of Community Needs\n\n\n\n\n\n\n\nCFPEI - Increased operating funds\n\n\n\n\nLiteracy\n\nLiteracy training tends to be fragmented gencies delivering literacy tend to operate in “silos” and yet, we read that programs work best when they engage the entire family.  \n\n\n\n\nCapacity Building of Organizations, especially smaller ones, operating in the \n\n\n\n\nthird sector workshops especially:\n\na regular newsletter \n\nA support person for charitable organizati",
  "theme": "06-speeches"
 },
 {
  "slug": "2009-andrew-letter",
  "title": "2009-Andrew letter",
  "summary": "April 29, 2009 solicitation letter to William E. Andrew (Penn West Energy Trust, Calgary) from Don Glendenning as CFPEI Director. Provides context on Canadian community foundations (150 total) and explains CFPEI's Living Trust. Details the 2007 Wood Islands inaugural planting and subsequent Milton community planting at North Yorke River Road, highlighting its popularity with walkers, bikers, joggers, and snowmobilers. Solicits Andrew's interest in funding additional plantings given his connection to the area and upcoming UPEI convocation.",
  "content_preview": "April 29, 2009\n\n\n\n\nMr. William E. Andrew\n\nDirector and Chief Executive Officer\n\nPenn West Energy Trust, Suite 2200\n\n425 First Street S.W\n\nCalgary, Alberta\tT2P 3L8\n\n\n\n\nDear Mr. Andrew:\n\n\n\n\nCommunity foundations, and there are 150 in Canada today, administer charitable trusts on behalf of individuals and organizations.  The Community Foundation of Prince Edward Island serves PEI and is governed by a group of 12 volunteers drawn from across the Island.  \n\n\n\n\nAmong our endowments is the Living Trust",
  "theme": "06-speeches"
 },
 {
  "slug": "2009-georgetown-theatre",
  "title": "2009 Georgetown Theatre",
  "summary": "Brief presentation notes (April 21, 2009) for Georgetown community event at local theatre. Positions CFPEI as development tool and community infrastructure rather than fundraising organization. Highlights Don's personal engagement with Georgetown community (Holland College welding facility, restaurants, theatre, gardens) demonstrating commitment to understanding local contexts. Incomplete notes suggest outlines for discussing how community foundations serve communities beyond specific causes.",
  "content_preview": "COMMUNITY FOUNDATION  OF PRINCE EDWARD ISLAND\n\n\n\n\nNotes for presentation at Georgetown, PEI\n\n\n\n\nMonday, April 21, 6:30 pm\n\n\n\n\nIntroduction\n\nIntroduce Lou Ann Thomson and Don Macdonald\n\n\n\n\nThanks for opportunity to present\n\n\n\n\nAware of revitalization of Georgetown; among other things, I have driven past the Holland College welding facility, eaten at your restaurants, attended events at the Georgetown theatre, visited the shops including xxx craft shop, and enjoyed the beauty of the gardens (ackno",
  "theme": "06-speeches"
 },
 {
  "slug": "2009-souris-reception",
  "title": "2009  - Souris Reception",
  "summary": "Speaking notes for Souris community reception (November 21, 2009) featuring co-presenters. Don's segment emphasizes community foundation innovation in charitable giving, noting 160 Canadian foundations. Highlights geographic model of giving (Souris Fund supporting local initiatives), describes innovative examples including US couple establishing nurse scholarships for Souris, Cumberland-Rocky Point Women's Institute converting school funds to book grants. Illustrates CFPEI's role connecting donors with community needs and enabling lasting change. Demonstrates Don's skill in engaging community audiences with compelling examples.",
  "content_preview": "November 5, 2009\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nSpeaking Notes for Reception \n\nNovember 21, 2009 2:30 to 4:00 pm \n\n\n\n\n\n\n\nINTRODUCTION - CAROL\n\nGood afternoon and welcome.\n\nI have been a big fan of the Foundation for the past 5 or 6 years – from the time that a friend of mine (Margaret Ching) was elected to the Board of Directors.  The philosophy of the Foundation made so much sense to me and I was very pleased and honoured to be asked to be a member of the Board.\n\n\n\n\nThe bu",
  "theme": "06-speeches"
 },
 {
  "slug": "2009-status-of-arts-agreements-2",
  "title": "2009 - Status of Arts Agreements-2",
  "summary": "Progress notes dated November 26, 2009, documenting Don's conversations with arts organizations about endowment partnerships. Notes College of Piping (Ken Gillis, Chair) is interested but prioritizing capital needs; Carrefour seeking presentation opportunity; PEISO uninterested due to current fundraising focus; Harbourfront (Maurice Gallant) to discuss with chair; Victoria Playhouse to be handled by John Robinson; and Indian River Festival (Rene Hurtubise, Chair) expecting board approval and completing federal application.",
  "content_preview": "November 26, 2009\n\n\n\n\nStatus of Arts Agreements\n\n\n\n\nCollege of Piping - spoke with Ken Gillis, Chair.  While interested in an endowment, College is in great need of capital and expects  to focus on that in the near future.  Wants to be kept informed and would like to be invited to any meetings\n\nCarrefour - spoke with Michelle Blanchard – She would like us to make a presentation to the board but probably not until December.\n\n\n\n\nPEISO – interested but cannot see their way clear to campaign for fun",
  "theme": "06-speeches"
 },
 {
  "slug": "2010-1-heritage-cemeteries",
  "title": "2010-1 Heritage Cemeteries",
  "summary": "Strategic proposal for a Heritage Cemetery Network (HCN) as a non-profit organization to address cemetery maintenance concerns across PEI. Don documents community concerns about physical maintenance and trustee recruitment, particularly in cemeteries unattached to active churches. The proposal outlines a funding model incorporating local fundraising, family fees, endowments, and surplus fund transfers. Don suggests CFPEI establish a commission to explore implementation. This document demonstrates his commitment to preserving heritage infrastructure and addressing rural community needs through innovative organizational solutions.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nHeritage Cemetery Network \n\n Background\n\n\n\n\nOn a number of occasions community leaders have expressed concern about the care of cemeteries throughout the Island, especially cemeteries not directly attached to an active church; the most recent being on Monday with heritage activist, Dr. Catherine Hennessey.\n\n\n\n\nThe concerns are twofold.  One concern is that of the actual physical care and maintenance – lawn, fences, shrubs, sunken graves, signage, etc",
  "theme": "06-speeches"
 },
 {
  "slug": "2010-presentation-notes",
  "title": "2010 Presentation notes",
  "summary": "Comprehensive presentation notes by Don Glendenning outlining CFPEI's role and importance to PEI communities. Defines community foundations as development organizations and third-sector coordinators focused on improving quality of life. Emphasizes characteristics of continuity, transparency, flexibility, and long-term vision. Highlights CFPEI's 50 funds totaling $1.5 million with annual grants of $50-60,000. Includes PEI examples and community funds, outlines CFPEI activities (endowment building, grant-making, leadership/liaison, office operations), and frames community foundations as problem-solving mechanisms complementing government and town council efforts.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nPresentation Notes\n\n\n\n\n\n\n\nCOMMUNITY FOUNDATIONS ARE\n\n\n\n\nCommunity development organizations\n\nCoordinators and leaders in the third sector\n\nCommitted to improving the quality of life in their communities \n\nServe all sectors: health, social development, religion, environment, heritage, education, \n\n\n\n\n\n\n\nCHARACTERIISTICS\n\n\n\n\nContinuity\n\nTransparency and accountability\n\nLow administration fee\n\nProfessional investment management\n\nMaintenance of princi",
  "theme": "06-speeches"
 },
 {
  "slug": "2010-summerside-trinity",
  "title": "2010 Summerside-Trinity",
  "summary": "Detailed speaking notes (September 22, 2010) for Trinity Men's Group presentation in Summerside. Positions CFPEI among 170 Canadian community foundations as transforming charitable giving by shifting agency from organizations to donors. Provides extensive local examples: Mel Campbell youth fund, hockey fund, women's institutes, art matching funds, MacKay emergency response fund, Robinson memorial fund. Explains four CFPEI services with specific examples, addresses differences from traditional charities (foundation status, grant-making model, flexibility). Demonstrates Don's sophisticated understanding of community psychology and engagement strategies.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nSpeaking Notes\n\nTrinity Men’s Group\n\nSeptember 22, 2010 – 7:30 am – Gentleman Jim’s\n\n\n\n\n1    Delighted to be here\n\nold friends\n\n\t\t\tNew friends\n\n\t\t\tThanks for invitation\n\n\t\n\n\t\t\tRod Nicholson\n\n\t\t\tJeniene Peake\n\n\n\n\n2    Community foundations -\t\n\nNewest development in the sector \n\n\tExciting\n\n\tIn 170 communities in Canada\n\n\tSpreading around the world\n\n\n\n\n\tTurned giving on its head\n\nInstead of organizations telling us what’s important\n\nDonors are tellin",
  "theme": "06-speeches"
 },
 {
  "slug": "2011-08-31v4-presidents-remarks-at-upson-recpn",
  "title": "2011-08-31v4 Presidents remarks at Upson Recpn",
  "summary": "Formal remarks prepared for a reception honoring The Community Foundation of Prince Edward Island on August 31, 2011. Acknowledges hosts Tim and Kathy Upson. Discusses the history and value of community foundations, noting that the first was established over a century ago, with major growth in recent decades (approximately 175 now exist in Canada). Explains how community foundations allow charitable donors to manage charitable interests through a single foundation account, reducing costs and administrative overhead compared to establishing private charities. Emphasizes the Foundation's mandate to assist and stimulate caring Islanders in delivering charitable interests. Demonstrates Don's leadership voice and institutional philosophy regarding philanthropy.",
  "content_preview": "Hello, thanks & intro and greetings as required\n\n\n\n\nIt’s my pleasure to Acknowledge and thank Tim and Kathy Upson for hosting today’s Reception to recognize the support to, and contributions of, The Community Foundation of Prince Edward.  -----------\n\n\n\n\nAlthough the first community foundation was established more than one hundred years ago, and there are now about 175 in Canada, their major growth has taken place in the last couple of decades as people realized that they, in effect, can use the",
  "theme": "06-speeches"
 },
 {
  "slug": "2011-dr-glendenning-speaking-points-2",
  "title": "2011 Dr. Glendenning Speaking Points 2",
  "summary": "January 2011 speaking points for Holland College's 'Learning. For Life.' capital campaign with Don as Honorary Chair. Brief remarks emphasizing the college's importance to island and wider community, with gratitude to campaign leadership and donors.",
  "content_preview": "Learning.\nFor Life.\nCapital\nCampaign – “Celebrating Success”\n\n\nJanuary\n28, 2011\n\n\n\n\n\n\n\n\nSpeaking\nPoints \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrder\n\n\t\n\n\n\tDr.\n\tBrian McMillan – will speak first, will welcome Don Glendenning to\n\tthe podium, and will introduce the campaign.  3\n\tminutes\n\t\n\t\n\t\n\n\n\tDr.\n\tGlendenning – shares the stage with Brian, after opening remarks.\n\t2\n\tminutes\n\t\n\n\n\tRobert\n\tIrving and Ray Murphy – will share the stage, introduce the\n\tcabinet, show the video, and introduce the Premier. \n\t5 minutes speaking ",
  "theme": "06-speeches"
 },
 {
  "slug": "2011-new-presentation-slide",
  "title": "2011 new presentation slide",
  "summary": "Outline suggestions for presentation slides addressing individual and group benefits from CFPEI. Lists 21 key value propositions including: privacy, low fees, single giving gateway, flexibility, transparency, perpetuity, convenience, participation in decisions, anonymity options, professional management, national network participation, and local leadership. Represents refined messaging about differentiating CFPEI benefits and appealing to diverse donor motivations from legacy preservation to immediate impact.",
  "content_preview": "Perhaps as the last frames you might address  the issue of \"What do we offer individuals and groups (or 2 slides) and include such things as:\n\n \n\n Charitable giving screened from public view\n\nLow administration fees \n\nA single gateway for your charitable giving \n\nNo cost to changing your mind \n\nAssistance in developing a giving plan \n\nTransparency \n\nLong term oversight in hands of Islanders \n\nPart of a national network \n\nExpanding segment of philanthropy \n\nService \n\nRegular/scheduled review \n\nPa",
  "theme": "06-speeches"
 },
 {
  "slug": "2012-06-14-report-from-chair",
  "title": "2012-06-14 Report from Chair",
  "summary": "Interim Chair Don Glendenning's report dated June 7, 2012 to Education First Canada showing substantial progress. Organization officially registered as \"Education First Canada Inc.\" with PO Box address and email; lawyer Margaret Ann Walsh managing incorporation; $2,000 in account with $3,000 commitment; charitable status application underway with CFPEI administering funds. Don reported successful preliminary conversations with Regis Duffy and Kirk Cutcliffe about funding and innovation networks, plus outreach on reading initiatives and upcoming award development. Demonstrates Don's effectiveness in fundraising and organizational development.",
  "content_preview": "SD1\n\nJune 7, 2012\n\nReport from Chair \n\nCoordinates:\n\n\n\n\n \t1  Registered Name:\tStill in progress\n\n2  Temporary name:\tEducation First \n\n2  Official Address:\n\n\n\n\n3  Contact address:\tPO Box 624, 101 Kent St, Charlottetown,  PE C1A 1M0\n\n4  Email:\t\t\teduc.first@gmail.com\n\n5  URL:\n\n6  Tel:\n\n7  Interim signing officer:\tDon Glendenning\n\n8  Finances:\t\tArrangements with CFPEI\t\t\n\n9  Slogan: \t\tA quality education for every Canadian\n\n10 Lawyer: \t\tMargaret Ann Walsh of Stewart McKelvey, \n\n\n\n\nActivities to date\n",
  "theme": "06-speeches"
 },
 {
  "slug": "2012-12-04-opening-remarks",
  "title": "2012-12-04 Opening Remarks",
  "summary": "Opening remarks for December 4, 2012 panel discussion \"Community Engagement & Early Childhood Learning.\" Don introduces Education 20/20 (renamed from Education First) as an independent national educational organization. Emphasizes engagement from both learner and school perspectives. Introduces Alice Taylor as \"experienced teacher, former instructor at Holland College, published author and active innovator\" and frames the evening as the organization's first action event.",
  "content_preview": "Panel Discussion\n\nDecember 4, 2012\n\nWelcome:  My name , welcome, delighted to see so many, \n\nBackground\n\n  \nFor the past few months, a number of us have been meeting in a variety of combinations\n  \nWe’ve focused on education in the broadest sense\n  \nShare a similar view of education, nature, importance\n  \nCompared to other sectors, there are few opportunities for people with an interest in education to come together\n  \nSo we decided to do something about it\n\n\nEducation 20/20\n\n  \nEstablished a ne",
  "theme": "06-speeches"
 },
 {
  "slug": "2012-trinity-supper-club-2",
  "title": "2012-Trinity Supper Club-2",
  "summary": "Speaking notes prepared for a presentation to Trinity United Church Supper Club addressing key issues in education. Don discusses education as the most important issue of modern times, argues that schools have hijacked the education agenda, and raises concerns about public engagement in educational policy. Proposes that education must be broader than schooling, that credentials receive too much emphasis, and that external interventions and informed public engagement are necessary for meaningful change.",
  "content_preview": "Speaking\nNotes \n\n\n\nTrinity\nUnited Church Supper Club\n\n\n6:00\np.m., February 7, 2012\n\n\n\n\n\n\n\n\nIssues\nin Education\n\n\n\n\n\n\n\nKinsey\nSmith\n\nChairman,\nFriends all\n\n\n\n\n\n\nLayman’s\nSunday\n\n\t\n\n\n\tRead\n\tnote from Helen MacDonald\n\t\n\n\n\tSince\n\tthen, I sneak in, only after dark, sit in back row and leave before\n\tthe lights come on.\n\n\n\n\n\n\n\nWhy\nI accepted the invitation:\n\n\t\n\n\n\tIt\n\thelps/forces me to learn\n\t\n\n\n\tChance\n\tto test ideas\n\t\n\n\n\tEducation\n\tmost important issue of our time.\n\t\n\n\n\tOur\n\tfutures as individuals, c",
  "theme": "06-speeches"
 },
 {
  "slug": "2014-learning-invitation",
  "title": "2014-Learning Invitation",
  "summary": "Public invitation to January 20, 2014 workshop featuring opening remarks by Don Glendenning, a presentation on \"Taking the Pulse of Island Youth\" by Steve McQuaid and Katherine MacDonald, facilitated roundtable discussion on preparedness gaps, and closing comments by Bill Whelan. The event structure balanced expert presentation with community dialogue, reflecting Don's belief in inclusive public discourse.",
  "content_preview": "Education\n\t20 20: Quality Education for All\n\t\n\n\n\n\t\n\n\n\n\n\n\n\n\n\nYou\nAre Invited to a\n\nPresentation\nand Round Table Discussion on \n\n\n\n\n\n\n\n “Education\nand Preparedness” \n\n\n\n\n\n\n\nMonday,\nJanuary 20,  2014 ,  7:00 pm\n\nSouthport\nRoom, Stratford Town Hall, Stratford, PEI\n\n(Storm\ndate January 22, 2014)\n\n\n\n\n\n\nAgenda\n\n\n\n\n\n\n\t\n\nOpening\n\tremarks by  D. Glendenning\n\n\n\n\n\n\n\n\t\n\n“Taking\n\tthe Pulse of Island Youth”  - a presentation by Steve McQuaid,\n\tVice President,    Community Foundation of Prince Edward Island and",
  "theme": "06-speeches"
 },
 {
  "slug": "2014-notes-for-facilitators",
  "title": "2014-Notes for facilitators",
  "summary": "Comprehensive facilitator guide for the Education and Preparedness workshops. Don details workshop objectives, presentation structure (30-45 minute CFPEI presentation), roundtable facilitation strategies, and recorder roles. The document demonstrates his understanding of adult learning, group dynamics, and the importance of creating space for diverse voices—key elements of transformative public dialogue.",
  "content_preview": "_____________________________________________________________________________________\n\nEducation\nand Preparedness\n\nNotes\nfor facilitators\n\n\n\n\n\n\nEducation 20/20 is\norganizing a series of workshops on Education and preparedness\nthroughout Prince Edward Island.  The\nbasis of the workshops is a survey of youth issues undertaken by the\nCommunity Foundation of Prince Edward Island; the survey gathered\ninformation and sought the views of more than 200 young people\nbetween the ages of 15 and 25.  The re",
  "theme": "06-speeches"
 },
 {
  "slug": "2015-1-hubley-little",
  "title": "2015 (1) Hubley-Little",
  "summary": "Earlier draft invitation from Don Glendenning to a presentation by Dr. Tammy Hubley-Little, Leader of Curriculum Delivery for the English Language School Board, on \"Education.\" Event scheduled for January 21, 2015, at Haviland Club as part of Education 20/20's series fostering dialogue among Island educators. Showcases Don's effort to engage educational leaders in discussing contemporary issues.",
  "content_preview": "On\nbehalf of Education 20/20 Inc. \n\n\nI\nam pleased to invite you to a presentation by \n\n\nDr.\nTammy  Hubley-Little.\n\n\n\nLeader\nof Curriculum Delivery for the English Language School Board \n\n\non\nthe topic of \n\n\n\n\n\n\n\n“Education”\n\n\n\n\n\n\nThe\nevent is informal and will provide opportunities to meet and talk \n\n\n\nto\nothers who share an interest in education. \n\nThe\nsession, the first of a series of conversations with Island\neducators, \n\n\n\nwill\nbe held at the \n\n\n\n\n\n\n\nHaviland\nClub from 4-6:00 pm \n\n\nWednesday",
  "theme": "06-speeches"
 },
 {
  "slug": "2015-brown-and-notes2015",
  "title": "2015 Brown and  notes2015",
  "summary": "November 23, 2015 meeting notes with Hon. Richard Brown (Workforce and Advanced Learning Minister) and Deputy Sharon Cameron. Don, as Education 20/20 President, presented organizational goals: keeping education debate alive, promoting quality education for all Canadians, federally incorporated non-partisan status. Discussion centered on \"preparedness gap\"—the mismatch between educational credentials and employer-required qualifications. Key points: Canada and US uniquely lack formal qualification authorities; high school diplomas have declining employment value; Education 20/20 proposes establishing separate qualification authority (like apprenticeship model). The meeting demonstrates Don's sophisticated policy engagement, bringing workforce development and credential reform into educational conversation through evidence-based analysis.",
  "content_preview": "3-\n\nMeeting with the Minister\n\n Workforce and Advanced Learning\n\n\n\n\nDate:\t\tMonday, November 23\n\nTime:\t\t2:00 pm at the Minister’s office, 3rd floor Shaw North\n\nAttendees:\tHon. Richard Brown, Workforce and Advanced Learning\n\nSharon Cameron, Deputy Minister, Workforce and Advanced Learning\n\n \t\tDon Glendenning, President, Education 2020    \t\t?\n\n\n\n\nOUR NOTES\n\n  \n\n\n\n\n\n\nOPENING REMARKS\n\n  \nAppreciate opportunity\n  \nTell you about our activities\n  \nWillingness to help\n\n\n\n\n\nEDUCATION 2020\n\nAbout 20/20 \n\n",
  "theme": "06-speeches"
 },
 {
  "slug": "2015-minister-perry-notes2015-2016-04-21t23-22-02",
  "title": "2015 Minister Perry notes2015@2016-04-21T23;22;02",
  "summary": "Notes for Don Glendenning's presentation to Minister of Education Hal Perry and deputy minister Susan Willis regarding Education 20/20's vision and mission. Topics include quality education philosophy, the Learning Path Model concept based on student needs, Prior Learning Assessment Recognition (PLAR), and a preparedness gap between school credentials and workforce qualifications.",
  "content_preview": "1-6-4\n\nMeeting of the\n\nMinistry of Education, Early Learning and Culture and Education 2020\n\n\n\n\nDate:\t\tThursday,\tAugust\t6,2015\n\nTime:\t\t1 pm at the Minister’s office\n\nAttendees:\tHon.Hal Perry, Minister of Education, Early Learning and Culture\n\nSusan Willis, Deputy Minister of Education, Early  Learning and Culture\n\n \t\tDon Glendenning, President, Education 2020 \n\n   \t\tBill Whelan, Vice--‐President,Education 2020\n\n\n\n\nAGENDA\n\n  \n\n  \nWelcome\n\n\n\n\n\n2. Education 2020\n\na. Vision/Mission\n\nb. Activities/Pa",
  "theme": "06-speeches"
 },
 {
  "slug": "2015-note-to-committee",
  "title": "2015-note to Committee",
  "summary": "Brief email communication to a committee summarizing progress on employer needs assessment since their meeting. Glendenning distinguishes between two separate needs: employers finding mathematically skilled workers and improving math instruction overall. Reports gathering considerable information about math skills and competencies, coordination with Lori Johnston for a presentation on Workplace Learning PEI services, and mentions TOWES (Test of Workplace Essential Skills) as an alternative assessment tool. Notes his temporary absence from the province.",
  "content_preview": "I was certain that I sent a letter following our meeting but apparently not; here’s a summary of what’s happened since:\n\n  \nThere appears to be two separate needs:\n\n\n  \nOne is for employers to find people with the math skills they need – this is the subject of this Email\n  \nThe second is an over- all plan to improve instruction in math; we’ll deal with that later \n\n\n  \nAs far as I can determine, a survey of employers’ math needs has not been done. \n  \nI’ve gathered considerable information about",
  "theme": "06-speeches"
 },
 {
  "slug": "2016-challenge-for-credit",
  "title": "2016 Challenge for credit",
  "summary": "Brief presentation outline advocating for PLAR initiatives, exemptions, and challenge-for-credit options for high school students as alternatives to traditional educational pathways.",
  "content_preview": "presentation\n\n\nChAllenge for credit\n\n\n\n\n\n\n\n\nBackground\n\n\nOn\nSeptember 24, 2014, Education 20/20 made a presentation to the\nEnglish School Board on PLAR\n\n\n(Prior\nLearning Achievement Recognition); it’s time to do another.\n\n\n\n\n\n\n\n\nPossible\ntopics:\\\n\n\t\n\n\n\tPLAR\n\t– update\n\t\n\n\n\tRestore\n\texemptions\n\t\n\n\n\tChallenge\n\tfor Credit - all subjects, for  Grade 12 students only. \n\t\n\t\n\n\n\tTechnology",
  "theme": "06-speeches"
 },
 {
  "slug": "2016-minister-of-educ-2016-01-28t13-48-16",
  "title": "2016-Minister of Educ @2016-01-28T13;48;16",
  "summary": "Presentation notes to Minister Doug Currie expressing concern about PEI's education system. Don emphasizes education's importance to personal and community development, notes favorable conditions for change, and raises critical questions about spending on remedial education, lack of challenge-for-credit options, outdated provincial education philosophy, and the need for systemic engagement and innovation.",
  "content_preview": "Presentation \n\nTo\n\nMinister Doug Currie\n\n\n\n\nOpening comments\n\n  \nThanks\n  \nRespect you for what you have done\n  \nYou did not cause the problems but you have the responsibility to solve them\n\n\n\n\n\nMy concern is about education\n\n  \nImportance to each person\n  \nImportance for future of the Island\n  \nThe need for change\n  \nWe could be a demonstration centre for quality education\n  \nConditions are favourable for change\n\n\n\n\n\nQuestions I am being asked:\n\n  \nHow come we justify spending millions of dolla",
  "theme": "06-speeches"
 },
 {
  "slug": "2016-poster-bi",
  "title": "2016-Poster (Bi)",
  "summary": "Bilingual (English-French) promotional poster for the 2016 Excellence in Education Award highlighting technology's application to quality education. Poster announces open nominations for K-12 schools and early learning centres, closing April 30, 2016, with award presentation in late May. Includes $2,500 award amount and contact information for both organizations. This bilingual format reflects PEI's commitment to accessibility and Don's inclusive approach to program promotion.",
  "content_preview": "_____________________________________________________________________________\n\n\nNominate your school for a\n\n\n\n\n\n\n\n\n$2,500\n\n\n\n\n\n\n\n\nExcellence in Education\nAward\n\n\n\n\n\n\n\n\nfor the application of\ntechnology \n\n\n\nto the provision of a\nquality education\n\n\n\n\n\n\n\n\nNominations\nnow being received:\n\n\t\n\n\n\tAny K-12 school or early\n\tearning centre on PEI\n\t\n\n\n\tAnyone may nominate\n\t\n\n\n\tNominations close on April\n\t30, 2016 \n\t\n\t\n\n\n\tThe Award will  be made in\n\tlate May\n\t\n\n\n\tFurther information\n\tavailable at www.educa",
  "theme": "06-speeches"
 },
 {
  "slug": "2017-math-for-pei",
  "title": "2017-MATH FOR pei",
  "summary": "Cabinet presentation addressing mathematics education through Don's learner-centered framework, outlining educational services, competency-based approaches, and multi-provider models.",
  "content_preview": "Education: A framework for change\n\nPresentation to\n\nPEI Cabinet\n\nDate and location\n\n\n\n\nA) OPENING REMARKS\n\n  \nElected members\n  \nThanks for invitation\n  \nThanks for warm welcome\n  \nI am in awe of the voluntary contributions of Islanders\n  \nThanks each of you for the role you play on my behalf to make this Province what it is today\n  \nEducation is the most important issue of the day\n  \nWhat we do/become, what this Island becomes will be determined to a large degree, by the education that we provi",
  "theme": "06-speeches"
 },
 {
  "slug": "2019-party-leaders-outline",
  "title": "2019-Party Leaders- outline",
  "summary": "Presentation outline for party leaders addressing education definitions, learner pathways, and international quality standards.",
  "content_preview": "4-Pres/com-7\n\n10\n\nEDUCATION\nFRAMEWORK\n\nPARTY\nLEADERS\n\nAugust\n28, 2019 – 3:30 pm\n\nHaviland\nClub\n\nWELCOME\n\n\t\n\nOPENING\n\tREMARKS:\n\t\n\nWelcome\n\t\n\nEducation\n\t20/20\n\n\nEDUCATION\n\n\t\n\nDefiniins\n\n\nROAD\nOF LIFE\n\n\n\n\n\n\nFRAMEWORK\n\n\n\n\n\n\nLEARNING\nPATH\n\n\n\n\n\n\n\n\n\n\n\nQUALITY\n\n\t\n\nOECD\n\t\n\nUNICEF\n\t\n\nMEC\n\n\n\n\n\n\n\nTHANKS",
  "theme": "06-speeches"
 },
 {
  "slug": "2019-pei-ret-tchrs-outtline",
  "title": "2019-PEI Ret tchrs outtline",
  "summary": "Presentation to retired teachers on education framework, learning approaches, essential skills development, and international best practices in education, with personal acknowledgments to Don's background.",
  "content_preview": "1/13/PEIRTA\n\t\n\n\t\n\n\n\t\n\t\nEDUCATION\n\tFRAMEWORK\n\t\nPEI\n\tRetired Teachers\n\t\nNovember\n\t7, 2019 – 10:45 -11:30 am\n\t\nRed\n\tShores\n\t\nCynthia\n\tMacDonald-75 people expected\n\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nINTRO\n\t\n\t\t\n\nAcknowledge\n\t\tteachers\n\t\t\n\nMRHS\n\t\t\n\nAnnie\n\t\tGulliver\n\t\t\n\nMother\n\t\t\n\nSwift\n\t\tCurrent – auditorium\n\t\t\n\nTC\n\t\t– a way for underprivileged to enter\n\t\t\n\n\n\t\tOpen to questions\n\t\n\t\n\n\n\n\t\n\t\nROAD\n\tOF LIFE\n\t\n•\t150,000\n\tIslanders\n\t\n•\tLife\n\troles\n\t\n•\tIndividuals\n\t\n•\tNeed\n\thelp with learning\n\t\n\n\n\n\t\n\t\nEDUCATION\n\t20/20 INC\n\t\n\t",
  "theme": "06-speeches"
 },
 {
  "slug": "2019-probus-2",
  "title": "2019 PROBUS-2",
  "summary": "Partially corrupted press release about Glendenning's presentation to Charlottetown PROBUS Club (Professional and Business) on PEI education issues. Survey data from Souris area revealed community interest in online courses, concerns about rural internet capacity, and need for practical hands-on training. Local agriculture, fisheries, and tourism sectors needed employee training. The presentation generated discussion on mathematics, arts, testing, and school autonomy. Document corruption limits full analysis but indicates his engagement with professional business community on education-workforce alignment.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\n\n\n\n\n\n\nAbout\npublic education in PEI\n\n\n\n\n\n\n\nMembers\nof the Men’s Charlottetown PROBUS Club WWW.PROBUSpei.ca\nwere briefed at their recent meeting on some of the issues facing\neducation in Prince Edward Island. A survey in late 2018 in the\nSouris area by\nEducation 20/20 Inc.\nrevealed an interest in on-line courses but respondents were not sure\nthat the local internet can accommodate the lat",
  "theme": "06-speeches"
 },
 {
  "slug": "2019-to-do",
  "title": "2019 To Do",
  "summary": "Brief to-do list for Glenway maintenance tasks in 2019: measure corner of Lot 1, address erosion, arrange gravel delivery, and contact Sherry Pilkey-Belfast (likely regarding watershed/erosion management). Reflects Don's hands-on management of community infrastructure projects.",
  "content_preview": "GLENWAY 2019\n\nTO DO\n\n\n\n\n  \nMeasure corner of Lot 1\n  \nErosion especially aat corner\n  \nGravel\n  \nSherry Pilkey-Belfast",
  "theme": "06-speeches"
 },
 {
  "slug": "2918-don-notes-2",
  "title": "2918- don-notes-2",
  "summary": "Don's personal notes from a Souris presentation, capturing his key takeaways. Identifies needs: better information about offerings, local education coordinator, learning managers, emphasis on hands-on practical education, training across all domains, and local involvement. Proposes specific projects including computer instruction space, supervised online training in blocks, investigating practical education definitions, supporting high school as community school, recruiting postsecondary offerings locally, technology awareness days, short classes, itinerant counsellor, drop-in skills centre, and community education research. Reveals Don's creative thinking and project-specific insights.",
  "content_preview": "SOURIS PROJECT\n\nMy takeaway from presentation\n\nSouris 2018-2\n\nNeeds  \n\n  \nMore/better information about offerings\n  \nA local promoter, organizer coordinator of education services\n  \nLocal learning managers, especially because much instruction will not be full time.\n  \nIncreased emphasis on hands-on, application, practical education (Need to investigate)\n  \n Training support needed for all domains:  attitudes, skills and knowledge\n  \nEncourage local involvement and oversight\n\n\n \n\nPossible project",
  "theme": "06-speeches"
 },
 {
  "slug": "3-general-backgound-notes-2018",
  "title": "3 General Backgound notes 2018",
  "summary": "Foundational framework notes from 2018 establishing Don's educational philosophy and analysis approach. Opens with rhetorical \"Why am I here?\" reflecting on education's importance despite limited public discussion, institutional narrow views, and knowledge of improvement possibilities. Identifies Premier as responsible for all Islander education. Analyzes learners (150,000 Islanders with diverse ages, interests, cultures, aspirations), introduces \"Road of Life\" concept (six roles: individual, family member, learner, citizen, consumer, producer), articulates education functions/beliefs, and defines key concepts (education, schooling, education quality). Advocates eight-year improvement timeline with sequential steps from mandate/mission definition through functional analysis, organization, autonomy/accountability, competency frameworks, and instructional models. Lists contemporary education \"Turmoil\" (curriculum handbooks, provincial reforms). Extends to regional education office proposals, learning managers/advisers, learner-centered approaches, and self-paced learning. Establishes Don's foundational thinking framework.",
  "content_preview": "About Education\n\nDon Glendenning\n\nCharlottetown: TBA, \n\n4/present/Notes-3\n\n\n\n\n  \nWhy am I here/\n\n\n  \nEducation is important\n  \nNot much public discussion\n  \nEducators promote an institutional/narrow view\n  \nWe know how to make it better\n  \nOnly premier has a responsibility for education of all Islanders\n\n\n\n\n\n  \nWHY ARE YOU HERE?/INTERESTS?\n\n\n\n\n\nLEARNERS  \n\nIslanders\n\n  \n150,000 – ages, interests; locations; cultures\n  \nEach individual - born with, learned, aspirations\n  \nAspirations\n\n\nIndividual",
  "theme": "06-speeches"
 },
 {
  "slug": "4-peihsf-2015",
  "title": "4 PEIHSF 2015",
  "summary": "Detailed presentation on Competency-Based Education (CBE) using Holland College DACUM model. Traces historical context from postwar Canada through Canada NewStart Corporations to Holland College 1969 founding. Explains DACUM (Developing A Curriculum) concept and competency identification through committee-based brainstorming. Discusses oil burner mechanic example, rating scales with benchmarks, program planning grids, learning guides, resource centers. Covers learning management emphasizing instructor characteristics and training. Includes recognition/credential systems and general comments on field-based analysis and transparent processes. Comprehensive treatment reflecting Don's expertise with competency-based education systems.\n- **Key People**: None specifically named\n- **Key Organizations**: Holland College, PEIHSF, Bow Valley College (Calgary), Canada NewStart Corporations, Nova Scotia NewStart Corporation\n- **Tags**: PROFESSIONAL, EDUCATION, SPEECH, HOLLAND_COLLEGE\n- **Eulogy Relevance**: HIGH - Detailed exposition of Holland College's DACUM model and competency-based education approach under Don's leadership",
  "content_preview": "Prog/present\n\nCBE based on DACUM model\n\nss practiced at Holland College\n\nFriday, March 27, 2015\n\nUpstairs at Casa Mia\n\n\n\n\n\n\n\n\n\n\nINTRODUCTION\n\n\tRoad of life\n\nLife roles\n\n\tEducation – preparation for life roles\t\t\t\t\t\t\t\t\n\n\n\n\nPOST-WAR CANADA\n\n\tImmigration from Western Europe\n\n\tSlowdown\n\n\tUnskilled Canadians\n\n\tCVTA Act 1960-1967 \n\n\tPrograms/facilities\n\nCanada NewStart Corporations\n\n\tNova Scotia NewStart Corporation\n\n\tOrigin of DACUM?\n\n\n\n\n\n\n\nHOLLAND COLLEGE\n\n\t1969-only prov without pos sec institute\n\nP",
  "theme": "06-speeches"
 },
 {
  "slug": "42-miniversity",
  "title": "42 - Miniversity",
  "summary": "Glendenning highlights innovative global school models: Westside School's \"miniversity\" in Vancouver using tutorial methods (20-day blocks, one subject per teacher), Oberländer School in Berlin (no grades until age 15, student-chosen subjects), and conceptualizes public schools as customer-responsive businesses. Announces \"Beyond Measure\" documentary on overscheduled/over-tested generation and literacy presentation for September 14. Celebrates Bill Whelan's Meritorious Service Medal from Governor General for Canadian Cancer Society, Science Fair, and Home & School Federation work.",
  "content_preview": "Open\nEducation\t\t\t\t\t\n    \n\n\n\n\nNo. 42\t\t\t\t\t\t\t\t\t\t             July 18, 2016\n\n\n\n\n\n\n\n\n“One\nshould ask whose knowledge is best not who knows the most.” –\nMontaigne \n\n\n\n\tElsewhere\n\tin the news\n\t\n\n\t\n\n\n\t\n\t\nWestside\n\tMiniversity\n\thttp://vancouversun.com/opinion/opinion-miniversity-follows-different-path-in-education\n\t\n\n\n\n\t\n\t\nWestside\n\tSchool in Vancouver is breaking new ground with its “miniversity”,\n\ta senior high school for Grades 10, 11 and 12 within a regular\n\tschool. In each block of 20 days, each stu",
  "theme": "06-speeches"
 },
 {
  "slug": "5-learning-journey-2018",
  "title": "5-Learning Journey-2018",
  "summary": "Updated 2018 version of the Road of Life presentation framework with refined language and structure. Maintains core educational beliefs while sharpening key concepts: education is urgent, quality requires collective effort, all people can learn individually yet in group settings. Framework components remain consistent—learners with diverse backgrounds, six-lane road metaphor, barriers and support systems. Updates population reference from 140,000 to 150,000 Islanders. Includes identical skills taxonomy (must know: literacy/numeracy; should know: IT/science; nice to know: history/geography) and support resources (information, instruction, practice, counseling, feedback). Credits the same production team and acknowledges Oregon School System inspiration from early 1990s.",
  "content_preview": "Pres/com-5\n\nEDUCATION\nFRAMEWORK\n\nCommentary\n\n2018\n\nSLIDE\n1\n\nWELCOME:\n\n\t\n\nON BEHALF OF\n\tEDUCATION 20/20 INC. I AM PLEASED TO WELCOME YOU TO “OUR LEARNING\n\tJOURNEY”\n\n\n\n\n\n\n\nDEFINITIONS:\n\n\n\n\n\n\nBELIEFS:\n\nIT IS OUR VIEW\nTHAT:\n\n\t\n\nEDUCATION IS\n\tTHE MOST URGENT ISSUE OF THE DAY\n\t\n\nOUR\n\tINDIVIDUAL FUTURES, AND THAT OF OUR COMMUNITY, DEPEND TO A LARGE\n\tDEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR OUR CITIZENS\n\t\n\nENSURING\n\tQUALITY REQUIRES THE EFFORTS OF MANY AND A SHARED VISION BY ALL\n\t\n\nALL PEOPLE\n\tC",
  "theme": "06-speeches"
 },
 {
  "slug": "500-nzqa",
  "title": "500 NZQA",
  "summary": "Don documents the New Zealand Qualifications Framework developed to address fragmentation in their qualifications system—gaps in recognized qualifications, unclear pathways, lack of prior learning recognition, and inconsistent terminology. The framework's key principles include simplification, open pathways with credit portability, promotion of lifelong learning with no distinction between general and career education, and performance-based assessment against national standards. The framework spans eight levels from primary through advanced degrees, with National Certificates recognizing levels 1-4, National Diplomas levels 5-7, and advanced qualifications at level 8. Units of Learning form the building blocks, each with credit ratings and standards including performance criteria, benchmarks, and elements. Schools are accredited and monitored for teaching quality.",
  "content_preview": "DACUM\n\n\n\n\n\n\n\n\tDACUM has come a long way since the first analysis was undertaken in Ottawa in January of 1968.  For people not familiar with the term, DACUM is an acronym for Design A Curriculum and is a widely accepted approach to identifying competencies being practiced or to be learned – and it is no longer limited to an analysis of traditional occupations. And it is a Canadian idea at that.\n\n \n\nDACUM is most widely used  as a rigorous, relevant, inexpensive and internally consistent approach ",
  "theme": "06-speeches"
 },
 {
  "slug": "53-reading",
  "title": "53  Reading",
  "summary": "Extensive analysis of literacy challenges in Prince Edward Island and Canada, presenting statistics showing 30-40% of Islanders lack adequate literacy. Examines definitions of reading, competencies, and curriculum outcomes in Atlantic provinces. Emphasizes that reading development begins in early childhood and home environments, arguing that schools alone cannot address literacy deficiencies without community and family support.",
  "content_preview": "About\nReading\t\t\t\t\t\n\n\n\nOccasional paper No. 0\t\t\t\t\t\t\t\t\t Date\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nCanada has a\n\treading problem; it is a community problem it cannot be solved by\n\tschools alone \n\t\n\t\n\n\n\n\t\n\t\nSome PEI\n\tstatistics:\n\t\n\t\t\n\nThe Guardian,\n\t\tJanuary 17, 2013 reported that “40 percent of Islanders haven’t\n\t\tsquirted a level of literacy or numeracy to allow them to complete\n\t\ttheir high school studies.”                                      \n\t\t\t\t\n\t\t\n\nThe Guardian,\n\t\tSept 28, 2006:  International tests place 15 ye",
  "theme": "06-speeches"
 },
 {
  "slug": "6-instruction",
  "title": "6 Instruction",
  "summary": "Visual presentation mapping instructional components onto learners as citizens on the road of life. Shows instruction system elements (presentation, diagnosis, counselling, guided practice, information, demonstration, benchmarks, curriculum) applied to learners with varying genetic makeup, prior learning, and aspirations. Emphasizes preparation for six life roles: individual, learner, family member, consumer, producer, citizen. Demonstrates Don's holistic view of instruction serving complete human development across multiple life contexts.",
  "content_preview": "INSTRUCTION\n\t\n\n\tPresentation\n\t\n\n\tDiagnosis\n\t\n\n\tCounselling\n\t\n\n\tGuided\n\tpractice\n\t\n\n\tInformation\n\t\n\n\tDemonstation\n\t\n\n\tBenchmarks\n\t\n\n\tCurriculum\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tPres-6\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tInstruction\n\tSystem  \n\t\n\t\n\n\t            \n\t\n\t\n\n\tCITIZENS\n\t\n\t\n\t\n\n\tGenetic\n\tmake-up\n\t\n\n\tPrior\n\tlearning\n\t\n\n\tAspirations\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tLearners\n\ton the road of life\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n",
  "theme": "06-speeches"
 },
 {
  "slug": "6-structural",
  "title": "6- structural",
  "summary": "An editor's letter or public essay examining structural issues in PEI's education system. Defines education as helping people change how they think, feel, and act; outlines six life roles and seven essential education services. Argues that government embedding of education services restricts professional autonomy and suggests education needs broader community engagement and clearer purpose definitions.",
  "content_preview": "Editor\n\nIssues in public education\n\nGuardian\n\n\tFor some time now, I have engaged Islanders in conversations about public education, learning paths, continuing education, citizen math, curriculum development, professional autonomy and accountability, politicization, transition to employment and the list goes on. \n\n\tMy own view of education is quite simple.  Learning is a very personal matter and is about people changing the way they think, feel and act; education is about people helping  other pe",
  "theme": "06-speeches"
 },
 {
  "slug": "7-framework-probus-2019",
  "title": "7-Framework Probus 2019",
  "summary": "Speaking notes for a March 14, 2019 presentation to PROBUS (Professional Business Service organization) at Blanchard Hall. Opening remarks reference \"50 years yesterday\" (since Don's arrival in PEI in 1969). Discusses current educational turmoil including curriculum development challenges, provincial variations in math approaches, school autonomy questions, and accountability frameworks. Identifies significant gaps in education delivery: night classes, continuing education, part-time options, hands-on learning, geographical access, and social capital building. Proposes systematic framework needs: overarching belief statements, functional definitions, service specifications, and accountability mechanisms. Presents the Road of Life framework as solution, emphasizing its application to complex policy decisions and its representation of educational reality across all citizen levels.",
  "content_preview": "Pres/com-7\n\nEDUCATION\nFRAMEWORK\n\nPROBUS\n\nMarch\n14, 2019 – 10:00 am\n\nBlanchard\nHall\n\nOPENING\nREMARKS:\n\n\t\n\nThanks\n\t\n\n50\n\tyears yesterday\n\n\n\n\n\n\n\nTurmoil\n\n\t\n\nCurriculum\n\tDevelopment handbook\n\t\n\nAlberta\n\tMath\n\t\n\nGCACC\n\t\n\nNova\n\tScotia Study\n\t\n\nNfld\n\t\n\nWaterloo\n\t– school grades\n\t\n\nCalgary\n\tHerald – math, major overhaul\n\n\n\n\n\n\n\nLAST\nFEW MONTHS\n\n\t\n\nRead\n\twidely\n\t\n\nLearning\n\tpath\n\t\n\nSouris\n\t\n\nMet\n\twith math people\n\t\n\nExplored\n\tnumeracy\n\t\n\nDept\n\tof Educ philosophy statement\n\t\n\nMandate\n\tletters\n\n\n\t\n\nVision\n\t",
  "theme": "06-speeches"
 },
 {
  "slug": "8-framework-rotary-2019",
  "title": "8 -Framework Rotary 2019",
  "summary": "Speaking notes for March 27, 2019 presentation to Charlottetown Rotary Club at Charlottetown Hotel. Opening remarks again reference \"50 years since my arrival in PEI,\" expressing concern about the coming generation and acknowledging distance from public education during his tenure. States he is \"not a natural critic\" despite concerns. Presents three core components of education: Learners (people engaged in learning), Teachers (people providing help), Education System (community services supporting citizen education). Defines citizen population as 152,000 with differences in innate conditions, prior learning, and future roles requiring new skills. Outlines government's educational support including information services, counseling, economic support, practical and hands-on training, continuing education, and skill upgrading options.",
  "content_preview": "Pres/com-8-b\n\nEDUCATION\nFRAMEWORK\n\nCharlottetown\nRotary\n\nMarch\n27, 2019 – 7:15 a.m.\n\nCharlottetown\nHotel\n\nOPENING\nREMARKS:\n\n\t\n\nThanks\n\t\n\n50\n\tyears since my arrival In PEI\n\t\n\nDelighted\n\tto be here\n\t\n\nWorry\n\tabout coming generation\n\t\n\nWay\n\tfrom Public Education\n\t\n\nNot\n\ta natural critic\n\t\n\n\n\n\nHandouts\n\n\t\n\n20/20\n\tbrochure\n\t\n\nEducation\n\tis … \n\t\n\n\n\n\n\n\n\nComponents:\n\n\t\n\nLearners\n\t-people who are engaged in learning\n\t\n\nTeachers\n\t- People who help  them\n\t\n\nEducation\n\tSystem -Services put in place by a com",
  "theme": "06-speeches"
 },
 {
  "slug": "9-lions-sherwood-2019",
  "title": "9-Lions Sherwood 2019",
  "summary": "Nearly identical presentation to the Rotary Club address, delivered April 10, 2019 at Sherwood Hall to Lions Club. Same opening remarks about 50 years in PEI, concern for coming generation, and caveat about not being a natural critic. Repeats the three-component educational model (Learners, Teachers, Education System) with 152,000-citizen population base. Maintains identical structure addressing differences in citizens' conditions, life roles, skill needs, and government educational support services. Demonstrates Don's consistent messaging across community organizations and his commitment to spreading educational awareness through service clubs.",
  "content_preview": "Pres/com-8-9\n\nEDUCATION\nFRAMEWORK\n\nLions\nClub\n\nApril\n10, 2019 – 7:15 a.m.\n\nSherwood\nHall\n\nOPENING\nREMARKS:\n\n\t\n\nThanks\n\t\n\n50\n\tyears since my arrival In PEI\n\t\n\nDelighted\n\tto be here\n\t\n\nWorry\n\tabout coming generation\n\t\n\nWay\n\tfrom Public Education\n\t\n\nNot\n\ta natural critic\n\t\n\n\n\n\nHandouts\n\n\t\n\n20/20\n\tbrochure\n\t\n\nTypical\n\tServices… \n\t\n\n\n\n\n\n\n\nComponents:\n\n\t\n\nLearners\n\t-people who are engaged in learning\n\t\n\nTeachers\n\t- People who help  them\n\t\n\nEducation\n\tSystem -Services put in place by a community to enc",
  "theme": "06-speeches"
 },
 {
  "slug": "9-school-services",
  "title": "9 School Services",
  "summary": "Extends the education services framework to school-specific offerings, dated July 4, 2022. Lists basic education services plus school-specific additions: credential evaluation, certification, newcomers programs, web services, and online offerings. Details PEI-specific services: APSEA support, community access facilitation, counselling, EAL, HEAR, inclusive education, psychology, speech/language diagnosis, and research. Shows Don's understanding of the comprehensive service ecosystem schools operate within.",
  "content_preview": "Glendenning\n\n\nNotes\n\n\n   9\t\t\t\t\t\t\t\t\n\n\nSchool\nServices\n\n\n\t\t \t\t\t\t\t              \n           \n\n\n\n\n\t\n\n\n\t\n\t\n\n\tFunctions and services can be confusing\n\t\n\t\t\n\n\n\t\tFunction\n\t\t- \n\t\t\n\t\t\n\n\n\t\tService\n\t\t- \n\t\t\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tEducation is a service; a service is\n\tfurther defined as:\n\t\n\t\t\n\n\n\t\tan\n\t\tact of help or assistance\n\t\t\n\n\n\t\tan\n\t\torganized system of labour and material aids to supply the needs of\n\t\tthe public\n\t\t\n\n\n\t\tThe\n\t\tsupply, installation or maintenance of goods carried out by a\n\t\tdealer\n\t\t\n\n\n\t\tThe\n\t\tstat",
  "theme": "06-speeches"
 },
 {
  "slug": "91-b-learner",
  "title": "91-B Learner",
  "summary": "Don defines learners as agents of change who bring three types of prior knowledge to learning: innate conditions, prior learning, and aspirations. He outlines education services learners need (information, presentation, feedback, counselling, opportunity, products). He criticizes PEI's Department of Education for conflating schooling with education and advocates for a comprehensive glossary of terms. Published August 20, 2020 in Open Education No. 91-B.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 91\t -B\t   \t\t\t                                \n\t       \t                 August 20, 2020\n\t\n\n\tWhen\n\tschools and ministries are managed well, learning happens-World Bank\n\t\n\n\t\n\n\n\t\n\n\n\n\tTHE\n\tLEARNER\n\t\n\n\t\n\n\n\t\n\t\n\n\tA\n\tlearner is a person who, for whatever reason, is trying to bring\n\tabout change in his/her life - trying to change an attitude, gain\n\tnew knowledge or add to one’s skills.  But learners are neither\n\tempty jars nor blank slates; each learner carries three pieces of\n\tlu",
  "theme": "06-speeches"
 },
 {
  "slug": "a-framework-notes-2016-04-18t02-59-01",
  "title": "A FRAMEWORK NOTES @2016-04-18T02;59;01",
  "summary": "Framework presentation notes articulating Don's core educational philosophy that education is the most urgent issue facing society. Develops the 'Road of Life' and 'Traveller' conceptual vectors, emphasizing that quality of life journey depends on educational quality, drawing from the Oregon 1990 life roles concept.",
  "content_preview": "POWERPOINT\n\nAn Education Framework\n\n\n\n\nEDUCATION IS THE MOST URGENT ISSUE OF THE DAY\n\nOUR INDIVIDUAL FUTURES, AND THAT OF OUR COMMUNITY, DEPENDS TO A LARGE DEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR OUR CITIZENS\n\nENSURING QUALITY REQUIRES THE EFFORTS OF MANY AND A SHARED VISION BY ALL\n\nTHIS PRESENTATION PROVIDES A FRAMEWORK FOR THOSE DECISIONS\n\n\n\n\nTHE FRAMEWORK HAS TWO VECTORS\n\nTHE ROAD OF LIFE\n\nAND THE TRAVELLER\n\nTHE QUALITY OF THE JOURNEY IS LARGELY DETERMINED BY OUR EDUCATION\n\n\n\n\nTHE ID",
  "theme": "06-speeches"
 },
 {
  "slug": "a-framework-notes-2016-04-19t22-59-26",
  "title": "A FRAMEWORK NOTES @2016-04-19T22;59;26",
  "summary": "PowerPoint notes (April 2016) for Don's \"Education Framework\" presentation emphasizing education as the most urgent issue because individual and community futures depend on educational quality. The framework presents life as a journey with multiple overlapping roles, each with unique characteristics (innate conditions, learning experiences, aspirations), barriers, and required support. This synthesizes his lifetime of thinking about education's purpose and structure.",
  "content_preview": "POWERPOINT\n\nAn Education Framework\n\n\n\n\nEDUCATION IS THE MOST URGENT ISSUE OF THE DAY\n\nOUR INDIVIDUAL FUTURES, AND THE FUTURE OF OUR COMMUNITY, DEPENDS TO A LARGE DEGREE, ON THE QUALITY OF EDUCATION PROVIDED FOR OUR CITIZENS\n\nENSURING QUALITY REQUIRES THE EFFORTS OF MANY AND A SHARED VISION BY ALL\n\nTHIS PRESENTATION PROVIDES A FRAMEWORK FOR CONVERTING THOSE VISIONS TO REALITY\n\n\n\n\nWE ARE ALL TRAVELLERS ON THE ROAD OF LIFE  \n\nAND MOST PLAY ALL ROLES: THERE ARE SIX\n\nTHAT OF AN INDIVIDUAL, FAMILY MEM",
  "theme": "06-speeches"
 },
 {
  "slug": "a-key-definitions",
  "title": "A Key definitions",
  "summary": "Glossary of ten essential education terms with carefully crafted definitions: learner (person pursuing behavioral change), learning (multidimensional process of formative experience), education (result of life-affecting experiences), education system (services supporting community development), teaching (arranging change-producing experiences), school (facility supporting groups), school system (schools under single administration), educated (capacity to address everyday issues), and life roles (six domain framework). Dated November 25, 2022. Demonstrates belief that definitional clarity precedes meaningful system reform.",
  "content_preview": "About education\n\nGlendenning Notes\n\nKEY DEFINITIONS\n\nNew\t\t\t\t\t\t\t\t\t\t\n\n----------------------------------------------------------------------------------------------------------------------------\n\nIn the interest of clarity, below are some standard definitions. \n\n  \nLearner – a person who, for whatever reason, needs, wants or is trying to bring about change in his/her life – trying to change an acritude, gain new knowledge, or add skills. But learners are neither empty jars nor blank slates; each l",
  "theme": "06-speeches"
 },
 {
  "slug": "aqua-1",
  "title": "AQUA-1",
  "summary": "An August 26, 2005 draft proposal for AQUA with comprehensive background, concept development, and implementation framework. Don's detailed background explains that education and certification are separate functions incorrectly conflated through institutional delivery. The concept proposes an independent, private sector-driven body with authority to assess and certify performance on tasks found in occupations or fields. Characteristics include independent governance, fee-for-service operation, direct or referral-based client acceptance, performance-based certification, provision of competency gap information, and extensive use of advisory panels. Benefits explicitly address removing certification barriers, focusing certification on performance, encouraging self-study, separating teaching and certification functions, and eliminating time as a certification factor. Implementation includes four sequential steps, demonstrating Don's systematic approach to innovation.",
  "content_preview": "Draft  TIME \\@ \"MMMM d, yyyy\" August 26, 2005\n\n\n\n\nATLANTIC PROVINCES QUALIFICATION AUTHORITY\n\n\n\n\n\n\n\nBackground\n\n\n\n\nThe acquiring of an education and the certification of qualifications are two separate functions although the two are closely linked and frequently one is thought to be the other.  The fact that the delivery of both functions is, to a large degree, provided or driven by educational institutions often works to the individual’s disadvantage in terms of both education and certification",
  "theme": "06-speeches"
 },
 {
  "slug": "b-2-2-presentation",
  "title": "B-2-2 Presentation",
  "summary": "Third version of transition-in-math presentation addressing curriculum development steps, underlying beliefs about education, and specific conclusions about systemic issues. Recommends competency-based education, master competency lists, standard assessment criteria, and annual professional development for teachers. Shows iterative development of policy recommendations.",
  "content_preview": "instruction\nis an issue; this became very obvious when we discussed graduation\nand entrance requirements; a glossary of related terms would be\nuseful.  Is it a project that we should take on?\n\n\n\n\nAbout/B-2-2\n\n_____________________________________________________________________________________\n\n\n\n\n\n\nTransition\nin Math\n\nEducation\n\n\n\n\n\n\nEducation\nis a provincial matter. Provinces encourage education for all; they\naccomplish this objective by funding programs at least to the level\nof good citizensh",
  "theme": "06-speeches"
 },
 {
  "slug": "b-2-presentation",
  "title": "B-2 Presentation",
  "summary": "Presentation document on math education in PEI outlining education providers, systemic issues, and recommendations for improvement. Advocates for competency-based approaches, common assessment criteria, and better stakeholder communication. Includes discussion of PISA results and workforce preparedness concerns across the Island.",
  "content_preview": "About/B-2\n\nMath\nPresentation\n\nEducation\n\n\n\n\n\n\nIn\nCanada education is a provincial matter. Provinces agree, it seems,\nthat they have a responsibility to help their citizens develop\nattitudes, skills and knowledge at least to the level of good\ncitizenship; although not as clearly stated, Provinces also have a\nresponsibility to ensure that their community includes the capacity\nto care for itself.   In PEI, that means encouraging more and better\neducation for all 145,000 Islanders and providing fina",
  "theme": "06-speeches"
 },
 {
  "slug": "bloom-levels-of-learning",
  "title": "Bloom-levels of learning",
  "summary": "Structured presentation of revised Bloom's Taxonomy with cognitive domain levels. Organizes six levels from Remembering (1, lowest) through Creating (6, highest), with definitions and action verbs for each level. Creating involves building structures from diverse elements; Evaluating means making value judgments; Analyzing separates concepts into components; Applying uses concepts in new situations; Understanding means comprehending meaning; Remembering recalls previous learning. This framework supports Don's broader vision of progression-based assessment.",
  "content_preview": "100-2\n\nAbout Education\n\nGlendenning\n\n\n\n\nBLOOM’S REVISED TAXONOMY\n\nCognitive Domain\n\n4-11\n\n\n\n\n  \n    \n      \n        \n\n\n        \nCreating: Builds a structure or pattern from diverse elements. Put parts together to form a whole, with emphasis on creating a new meaning or structure.\n      \n      \n        \n\n\n        \n6\n      \n    \n    \n      \n        \n\n\n        \nEvaluating: Make judgments about the value of ideas or materials.\n      \n      \n        \n\n\n        \n5\n      \n    \n    \n      \n        \n\n\n  ",
  "theme": "06-speeches"
 },
 {
  "slug": "change-all-notes",
  "title": "Change-all notes",
  "summary": "Nearly identical to File 5, this is an expanded draft of Don's change management compendium. Contains same ADKAR and Kotter models with identical content and conclusions about the nature of organizational change. The presence of two slightly different versions suggests Don was refining this material for publication or presentation purposes.\n- **Key People**: Don Glendenning (author); John Kotter; Prosci\n- **Key Organizations**: None specified\n- **Tags**: PROFESSIONAL, EDUCATION\n- **Eulogy Relevance**: MEDIUM - As with File 5, demonstrates systematic thinking about institutional change and leadership",
  "content_preview": "Draft August 26, 2012\n\n\n\n\n\n\nUnderstanding\nthe Change Process\n\nby\n\n\n\nDon\nGlendenning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrganizations\ncan no longer continue in their old ways; change is the new constant.\n Most businesses have had to reinvent themselves, and will likely\nhave to do so again – and again.  Education is no exception.  Cost,\nconsumer demand, the economy, the changing environment, changing work\nrequirements, technology - all contribute to the need for change.  In\nthe case of education, pressures form  c",
  "theme": "06-speeches"
 },
 {
  "slug": "chtn-facilitation",
  "title": "Chtn Facilitation",
  "summary": "Don's detailed facilitation notes for the January 20, 2014 Charlottetown workshop. He outlines the session's purpose (inform, engage, identify action), presentation structure, roundtable design with separate facilitators and recorders, and timing allocation (40 minutes for discussion). His emphasis on respectful dialogue and broad participation reflects his commitment to inclusive community problem-solving.",
  "content_preview": "EDUCATION 20/20 INC.\n\n\n\n\nNotes on facilitation\n\n January 20, 2014.\n\n\n\n\n  \nThe purpose of the workshop is to provide background information on youth issues, to engage people in discussion and identify what, if anything can/should be done.  We want to engage as broad a range of people as possible and especially youth, parents and employers. \n  \nThe workshop will start with a presentation by Steve MacQuaid, Vice President of the Community Foundation of Prince Edward Island, and Katherine MacDonald,",
  "theme": "06-speeches"
 },
 {
  "slug": "chtn-invitation",
  "title": "Chtn Invitation",
  "summary": "Formal invitation to the January 20, 2014 Stratford Town Hall workshop with complete agenda: Don's opening remarks, McQuaid/MacDonald presentation, facilitated roundtable on preparedness gaps, and Bill Whelan's closing remarks. The structure balances expert knowledge with community voice, reflecting Don's belief in democratized decision-making.",
  "content_preview": "Education\n\t20 20: Quality Education for All\n\t\n\n\n\n\t\n\n\n\n\n\n\n\n\nYou\nAre Invited to a\n\nPresentation\nand Round Table Discussion on \n\n\n\n\n\n\n\n “Education\nand Preparedness” \n\n\n\n\n\n\n\nMonday,\nJanuary 20,  2014 ,  7:00 pm\n\nSouthport\nRoom, Stratford Town Hall, Stratford, PEI\n\n(Storm\ndate January 22, 2014)\n\n\n\n\n\n\nAgenda\n\n\n\n\n\n\n\t\n\nOpening\n\tremarks by  D. Glendenning\n\n\n\n\n\n\n\n\t\n\n“Taking\n\tthe Pulse of Island Youth”  - a presentation by Steve McQuaid,\n\tVice President,    Community Foundation of Prince Edward Island and\n",
  "theme": "06-speeches"
 },
 {
  "slug": "clarity-a",
  "title": "Clarity - A",
  "summary": "Comprehensive essay on need for conceptual clarity in education. Defines clarity's importance: understanding people served, services provided, learner needs, processes, and values. Cites Good's Dictionary of Education on definitional processes. Lists specific PEI problems: terminology confusion, role clarity issues, distinction between \"education\" and \"going to school,\" and unclear Department purpose. Proposes clarity must address ideas themselves, those promoting them, and those receiving them. Discusses clarity's relationship to self-confidence and institutional coherence.",
  "content_preview": "Abut Education\n\nGlendenning\n\nA CALL FOR CLARITY -A\n\n4-1-11\n\nAs a frequent participant in conversations about education, I am struck by the absence of definitions and boundaries; communication and understanding may suffer as a result. \n\n\n\n\nConceptual clarity is a must to understand the people we serve, the services we provide, learner needs, product, processes and values especially when the subject carries layers of subjectivity. The Dictionary of Education (Good) defines definition as “the proce",
  "theme": "06-speeches"
 },
 {
  "slug": "comments-from-kelly-gillis-2015-11-19t18-46-59",
  "title": "Comments from Kelly Gillis@2015-11-19T18;46;59",
  "summary": "Email correspondence between Prince Street Elementary Vice Principal Kelly Gillis and Don Glendenning regarding the school's 2015 Excellence in Education Award. Gillis describes how students developed school values (P.R.I.N.C.E.), created a school logo and mascot, wrote a school song, and used award funds to upgrade stage facilities for improved student presentation environment.",
  "content_preview": "From: Kelly Gillis \n\nSent: Monday, November 02, 2015 4:40 PM\n\nTo: pei@education2020.ca \n\nCc: Erin Johnston \n\nSubject: Re: Education Award\n\n \n\nHello Don,\n\nI put together a bit of a blurb in case it is useful for you.\n\n \n\nPrince Street Elementary was thrilled to receive the Excellence in Education Award for 2015. We have been working hard to represent the values of our school through an on-going project. Our school had students vote on what \"Prince\" in Prince Street stands for, and decided on P-Pr",
  "theme": "06-speeches"
 },
 {
  "slug": "communication-annentafel",
  "title": "Communication-annentafel",
  "summary": "A structured curriculum framework for English language and communication arts using the \"anentafel\" methodology. The document maps ultimate system outcomes to course exit outcomes and specific skill-building competencies across six-to-twelve grades. It includes 16 general competencies and 108 specific skills organized across domains like reading interpretation, technology-mediated communication, and multimedia presentation.",
  "content_preview": "ENGLISH LANGUAGE AND COMMUNICATION ARTS \n\n\n\n\nUltimate Goals \n\n(System Outcomes) \n\n\n\n\nGeneral Areas of \n\nCompetence (Course Exit \n\nOutcomes) \n\n\n\n\nSpecific Areas of Competence \n\n(Skills) (Enabling Outcomes) \n\n\n\n\nStudents will be able to \n\nfind, evaluate and use \n\ninformation \n\n------,----'-_._.- \n\nStudents will be self- \n\ndirected learners who are \n\nadaptable to change \n\n\n\n\nRead and interpret \n\nvariety of texts \n\nI \n\nI \n\nI \n\n,-- \t' \t.1, \t, \n\nCommunicate \n\nusmg \n\nTechnology \n\n\n\n\n-------- \n\nCritique",
  "theme": "06-speeches"
 },
 {
  "slug": "d-36-b-proposal-better-reading-society",
  "title": "D 36 B Proposal -Better Reading Society",
  "summary": "An August 2011 proposal to establish an independent reading improvement association to increase Islander capacity to address reading challenges. Don provides compelling evidence of the reading crisis: 42% of adults lack Level 3 literacy, students underperform nationally, and projections show 30% of Canadian Grade 6 students struggling with literacy. He advocates for reading focus based on its foundational importance, multiple intervention points, and existing community readiness. The proposal includes objectives for raising awareness, organizing public events, supporting advocacy, and raising initial funds. Budget details include part-time promotion staff, incorporation, public information sessions, and media launch, showing Don's understanding of the infrastructure needed for successful public campaigns.",
  "content_preview": "August 4, 2011\n\nBetter Reading - Proposal #2-B\n\nProposal:\n\n  \nTo increase the future capacity of Islanders to participate in the improvement of reading skills among its people by establishing an association dedicated to the improvement of reading among Islanders.\n\n\nBackground:\n\n  \nEducation is an important key to future life of both individuals, communities and countries\n  \nSupport for change is widespread among both the public and professionals.  \n  \nReports and discussions do not differentiate",
  "theme": "06-speeches"
 },
 {
  "slug": "d-4-proposal-leaders-group",
  "title": "D 4 Proposal-leaders group",
  "summary": "A November 2012 proposal to establish an institute recognizing and developing young educator leaders exhibiting innovation qualities. Selection criteria include Canadian citizenship, current education work, ten years experience, strong communication skills, demonstrated innovation, leadership roles, and employer support. The program features twice-yearly meetings: an initial four-day intensive with dialogue, visits, lectures, and projects; and a follow-up meeting in PEI for dialogue, lectures, project work, and public presentation. Open nominations with supporting letters ensure diverse participation. Budget includes travel, accommodation, meals, and local visits. This initiative reflects Don's belief that leadership for change comes from practicing educators and his commitment to creating platforms for practitioner voices to be heard and developed.",
  "content_preview": "November 27, 2012\n\nLeaders Group\n\n\n\n\nWorking title:   Canadian Education Leaders Institute\n\n\n\n\nPurpose:\tTo recognize, encourage and develop young educators  who exhibit qualities of leadership and innovation. \n\nBackground:\t\n\n\n\n\nNumber of Participants: \n\n  \nYear one:\tOne per Province for two year period \n  \nYear two:\t12 students in second year and  12 students in first year\n  \nYear three\n\n\n\n\n\nSelection Process:\tOpen nomination by an accompanied by five letters of support\n\n\n\n\nQualifications:\n\n  \nC",
  "theme": "06-speeches"
 },
 {
  "slug": "d-9-services-colour-landscape1",
  "title": "D-9 Services-colour landscape1",
  "summary": "Visual presentation paper titled \"Education Services\" detailing typical educational services provided by provinces to citizens. Lists seven main service categories: Information/Counselling (information, counselling, assessment, diagnosis, referral, advocacy, promotion), Instruction (presentation, demonstration, practice, diagnosis, materials, liaison, coaching), Quality Assurance (credential, qualification, proficiency levels), Human Resources (teachers, administrators, advisors, teaching assistants, specialists, counsellors), Learning Products (texts, references, self-instructional materials, assistive technologies, internet, software), Funding (capital, operating, transportation), and Governance/Leadership. Presents services in visual diagram format organized by function.",
  "content_preview": "Education\n\tServices\n\t\n\n\tOccasional paper No.\n\t9\t\t\t\t\t\t\tDecember 22, 2019\n\t\n\n\n\n\t\n\t\n\n\tBackground\n\t\nDefinitions\n\t\n\t\t\n\nEducation:\n\t\tany experience that has a formative effect on the way a person\n\t\tthinks, feels or acts\n\t\t\n\nEducation\n\t\tSystem:  services put in place by a community to encourage and\n\t\tsupport the education of its citizens\n\t\t\n\nEducation\n\t\t services: the performance of a task for the benefit of others\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nA\n\tsearch of the literature reveals the following typical educational\n",
  "theme": "06-speeches"
 },
 {
  "slug": "d-ability-grading-2015-10-09t10-18-41",
  "title": "D-Ability grading@2015-10-09T10;18;41",
  "summary": "Newsletter proposing alternatives to traditional age-based classroom grouping to address wide achievement-level variation. Don advocates for flexible grouping, peer teaching, teacher mobility, technology application, teaching assistants, and tutoring services, arguing that age-based grading is convenient for administration but costly for student achievement and equity.",
  "content_preview": "Open\nEducation\t\t\t\t\t\n    \n\n\n\n\n01\t\t\t\t\t\t\t\t\t\t            April 23, 2013\n\n\nCriterion-referenced\ntesting is typically the most useful way to assess learning \n\n\n\nprogress towards\nlearning goals - unknown\n\n\n\t\n\n\n\t\n\t\n\n\tCatering\n\tto a range of achievement levels \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tSydney Morning Herald of Saturday, July 22, 2015 carried an item\n\tbased on a report by the Grattan Institute on the wide range of\n\tachievement levels in a typical classroom in Australian schools.  In\n\tMath, for example the rang",
  "theme": "06-speeches"
 },
 {
  "slug": "d-gov-t-of-pei-2014-11-10t04-19-45",
  "title": "D Gov't of PEI@2014-11-10T04;19;45",
  "summary": "Major presentation by Education 20/20 to PEI Government (November 5, 2014) on systemic education reform, delivered as Education 20/20 President by Don Glendenning. Don distinguishes between a \"school system\" (institutions, funding, certification) and a true \"education system\" (adding independent counseling, lifelong learning support, governance structure). He critiques PEI's lack of a unified education philosophy and advocates replacing direct government delivery with a Board of Education setting policy and Department of Public Instruction managing implementation. Outlines seven characteristics of quality education systems and calls for government to establish clear vision and educational philosophy.",
  "content_preview": "November\n5, 2014\n\nPresentation\nto \n\n\nGovernment\nof PEI\n\n\n\n\n\n\n\n\n\n\n\n\nEducation\n20/20 Inc.\t\n\n\n\n\n\n\nAppreciate\nopportunity to make presentation\n\n\n\n\n\n\nEducation\n20/20 is a national, not-for-profit education organization, located\nin Charlottetown, PEI. We are governed by a volunteer Board of\nDirectors, comprised of people who have demonstrated an interest in\nand knowledge of education: we are interested for all age groups\nwherever it may take place. but are not representative of any\neducational constit",
  "theme": "06-speeches"
 },
 {
  "slug": "d-ministers-of-education",
  "title": "D Ministers of Education",
  "summary": "Presentation to Ministers of Education (Canadian provincial level) presenting Education 20/20 philosophy on education as formative experience developing skills and knowledge for life roles. Defines education system components including home/school/community instruction, funding, certification, leadership/governance, and information services. Notes education as provincial responsibility while discussing US models with separate policy and instruction authorities. Proposes quality education system characteristics including healthy learners, safe environments, relevant content, community-linked outcomes, learner-focused support, independent timely information, and professional autonomous teachers.\n- **Key People**: None specifically named\n- **Key Organizations**: Provincial Departments of Education (Canada), Education 20/20 Inc.\n- **Tags**: PROFESSIONAL, EDUCATION, SPEECH\n- **Eulogy Relevance**: MEDIUM - National-level policy engagement showing Don's work at provincial/national education policy level",
  "content_preview": "November\n5, 2014\n\nPresentation\nto \n\n\n\nGovernment of PEI\n\n\n\n\n\n\n\n\n\n\n\n\nEducation\n20/20 Inc.\t\n\n\n\n\n\n\nEducation\n20/20 is a national, not-for-profit education organization, located\nin Charlottetown, PEI. We are governed by a volunteer Board of\nDirectors, comprised of people who have demonstrated an interest in\nand knowledge of education, but are not representative of an\neducational constituency. Our mission is to improve the quality of\neducation for every Canadian. Our activities to date include\nnewsle",
  "theme": "06-speeches"
 },
 {
  "slug": "d-qualification-2016-05-11t03-19-21",
  "title": "D-Qualification @2016-05-11T03;19;21",
  "summary": "A revised version of the qualification authority paper with identical content structure and arguments. This represents Don's continued work on educational reform in Atlantic Canada, advocating for a national qualification framework to address systemic inconsistencies in assessment and credentialing across post-secondary and secondary education institutions.",
  "content_preview": "Needed: An Atlantic Qualification Authority\n\n\n\n\nSometimes we need a piece of paper to prove what we’ve learned; this represents a sea change from the days when credentials, a high school diploma or college degree, would open most any door.  But diplomas and degrees are not enough, anymore, employers want evidence as to what a person can do with what he/she knows.  Welcome to the world of qualifications.\n\n\n\n\nThere’s some confusion as to the difference between qualifications and credentials.  My d",
  "theme": "06-speeches"
 },
 {
  "slug": "don-s-remarks",
  "title": "Don's remarks",
  "summary": "Master of ceremonies remarks by Don Glendenning at Living Memorial Trust inaugural event at Wood Islands. Opening welcomes Keuper family (Elinore, Ann from Arizona, John and Anne living locally, grandchildren). Outlines special occasion: launch Living Memorial Trust and inaugural oak tree planting honoring Dr. Charles Keuper. Provides expanded explanation of living memorials concept with Norman Carruthers (CFPEI President) speaking to benefits: environmental enhancement, wildlife shelter, erosion reduction, air quality improvement, visitor comfort. Extensive biography of Dr. Keuper. Acknowledges cooperative agencies: George Coade (Forestry), John Callaghan (Tourism Trails Manager), Leo Gill (Transportation), Mary Elliot (Wood Islands Development Corp). Thanks: Brendon McGinn, Bruce Lewis, Gary Schneider, Keuper family, John. Refreshments at Train Station hosted by Volunteer Social Committee/Plough the Waves Centre.",
  "content_preview": "Living Memorial Trust\n\nJuly 21, 2007 at 3:00pm\n\nWood Islands, PEI\n\n\n\n\n\n\n\n1\tMy name is Don Glendenning, \n\nI will be your Master of Ceremonies today \n\nOn behalf of CFPEI, Welcome to all\n\nEspecially the Keuper family \tMrs Keuper\n\n\t\t\t\tAnn from Arizona\n\nJohn and Anne who live just up the road \n\nJohn operates Island Pride Nursery\n\n\t\t\t\tGrandchildren\n\n\n\n\n2\tSpecial occasion\tLaunch the Living Memorial Trust\n\n\t\t\t\tInaugural planting, \n\nOak trees in memory of Dr. Charles Keuper\n\n\n\n\n\n\n\nNorman Carruthers, Pres",
  "theme": "06-speeches"
 },
 {
  "slug": "educ-service-1-grid-1-truncated",
  "title": "Educ Service 1  grid 1 truncated",
  "summary": "Draft document outlining typical education services organized into six categories: Information & Counselling (information, counselling, assessment, diagnosis, referral, advocacy), Instruction (presentation, demonstration, practice, coaching, record keeping), Governance (leadership, planning, liaison, support, research, advocacy, quality control), Learning Products and Technology (texts, self-instructional materials, assistive technologies, internet, software, MOOCs), and Funding (capital, operating, transportation). This represents a systematic categorization of education service delivery.",
  "content_preview": "Typical\nEducation services\n\n\n(DRAFT)\n\n\n\t\n\n\n\t\n\t\nINFO\n\t& COUNSELLING: \t\n\t\nInformation\n\t\nCounselling\n\t\nAssessment\n\t\nDiagnosis\n\t\nReferral\n\t\nAdvocacy\n\t\n\n\n\n\t\n\t\nINSTRUCTION\n\t\nPresentation\n\t\nDemonstration\n\t\nPractice\n\t\nDiagnosis\n\t\nInstructional\n\tmaterials\n\t\nLiaison\n\t\nCoaching\n\t\nRecord\n\tkeeping\n\t\nGuided\n\tPractice\n\t\nWork\n\texperience\n\t\n\n\t\n\n\n\t\n\t\nGOVERNANCE\n\t\n\t\n\t\nLeadership\n\t\nPlanning\n\t\nLiaison\n\t\nSupport\n\t\nResearch\n\t\nAdvocacy\n\t\nQuality\n\tControl       ?\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n",
  "theme": "06-speeches"
 },
 {
  "slug": "email-june-3",
  "title": "Email, June 3",
  "summary": "Substantive email from Don Glendenning to Executive members (Whelan, Read, Glendenning) dated June 3, 2018, outlining six critical decisions requiring Executive attention. Don emphasizes the need for close coordination with the Executive on handling future items and proposes bi-weekly Executive meetings before Directors' meetings. Key issues include: Award presentation at Bluefield, evaluation of the Education Award's focus and funding model, establishment of hosting project fees (noting competitive organizations charge for such services), financial document amendments from the annual meeting, confirmation of Katherine's assumption of MRSB chief contact role, and consideration of expanding the Executive to include Committee chairs. The email demonstrates Don's detailed administrative focus and collaborative governance approach.",
  "content_preview": "Executive\n\nEmail to Whelan, Read, Glendenning\n\nJune 3, 2018\n\nMy understanding is that I should work very closely with the Executive as to the handling of future items; in saying that, we agreed on an Executive meeting two weeks before each Directors meeting.  While I agree with that, I find that we have a number of items about which decisions must be taken.  Here are six. I expect there may be others:\n\n1.\tAward; Jeniene (Awards Committee) and I visited Bluefield and presented the Award; distribu",
  "theme": "06-speeches"
 },
 {
  "slug": "final-3-award-14-01-en",
  "title": "Final 3 Award 14-01 En",
  "summary": "Comprehensive proposal document establishing the rationale and framework for the Education Engagement Award. References National Parent Teacher Association research showing that \"when families, schools, and communities work together, student achievement improves, teacher morale rises, communication increases.\" Notes that education, unlike other sectors, lacks economic incentives for improvement. Proposes awards as recognition mechanism to highlight effective school characteristics. Five engagement areas: student-to-student, student-to-teacher, student-to-learning materials, student-to-community partnerships, and parental involvement. Timeline: nominations open February 13, 2014, close April 26, 2014; award presentation early May 2014. Emphasizes focus on daily operational engagement within school control.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nEducation Award\n\n\n\n\n\n\n\n\nEducation, as compared to\nother sectors, lacks appropriate economic incentives for either the\nstudent, teacher, institution or the provider to provide a better\nproduct or service and do so ahead of schedule, however, there is\nincreasing support for the view that incentives and awards help to\nimprove student results; it is an award for having done something\nrather than a grant to help a s",
  "theme": "06-speeches"
 },
 {
  "slug": "framework-20-1",
  "title": "Framework-20-1",
  "summary": "This comprehensive education framework document articulates Don's fundamental philosophy on education and learning. It provides key definitions distinguishing learners, education, instruction, learning, teaching, and education systems. Operating beliefs emphasize that education occurs beyond schools, that home is the major contributor, and that institutions' importance is declining. The document identifies typical functions and support services of education systems, provincial government mandates, and multiple service providers. It catalogs education issues including service gaps, politicization, lack of autonomy, and over-emphasis on knowledge. The framework identifies barriers to change (politicization, bureaucracy, inertia) and characteristics of quality systems (accessible, affordable, flexible, accountable, transparent). Key intervention points address assessment, mission, government role, and autonomy.",
  "content_preview": "About Education\t\t\t\t\t\t\t\t\n   \n\n\n\nAn\nEducation Framework\n\n\n0-1\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nINRODUCTION\n\n\nPrince\nEdward Island, Canada’s smallest Province has a population of\n155,000 people. Like Canadians everywhere, they are individuals,\nfamily members, citizens, consumers, producers and learners (1).  All\nare educated; nature and range varies; many want and need more.\nEducation is a Provincial responsibility; most provinces are focused\non instruction in institutions. This brief document attempts to\nbroaden the",
  "theme": "06-speeches"
 },
 {
  "slug": "framework-7",
  "title": "Framework 7",
  "summary": "2017 publication 'An Education Framework' by Don addressing citizen concerns about educational quality. Defines education, learning, and teaching; establishes quality criteria and guiding principles reflecting his lifelong belief that all people can learn and education serves life-long journeys.",
  "content_preview": "Doc/Frame\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAN\n\n\nEDUCATION\n\n\nFRAMEWORK\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald\nE. M. Glendenning\n\n\nCharlottetown,\nPEI\n\n\n2017\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nINTRODUCTION\n\n\t\n\nIs\n\ta response to growing concern among our citizenry about the quality\n\tof existing educational services.\n\t\n\nHelps\n\taddress the desire of the public for independent information to help\n\twith their decision-making.\n\t\n\nGrows\n\tout of questions and conversations with others who have an interest\n\tand concern about the c",
  "theme": "06-speeches"
 },
 {
  "slug": "function-graph",
  "title": "Function graph",
  "summary": "A visual educational functions diagram depicting the intersection of educational services with diverse island citizens. The framework presents Education Functions organized by Counselling (information, counselling, assessment, interests), Governance (board, commission, leadership, quality control), Instruction (presentation, demonstration, practice, assessment, analysis), Diagnosis (health, previous education, proficiency), Funding (tuition, grant, fund institution), Quality Assurance (credential, inspection), and Learning Products (textbooks, references, self-instructional material, assistive technologies, internet, software, MOOCs). This represents a comprehensive graphic framework for educational service delivery.",
  "content_preview": "COUNSELLING: \t\n\t\n\n\tInformation\n\t\n\n\tCounselling\n\t\n\n\tAssessment\n\t\n\n\tInterests\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\tGOVERNANCE\n\t\n\n\tBoard\n\t\n\n\tCommission\n\t\n\n\tLeadership\n\t\n\n\tQuality control\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\tINSTRUCTION\n\t\n\n\tPresentation\n\t\n\n\tDemonstration\n\t\n\n\tPractice\n\t\n\n\tAssessment\n\t\n\n\tAnalysis\n\t\n\n\n\n\t\n\t\nPres-7\n\t\n\n\n\n\t\n\t\nEDUCATIONAL\n\tFUNCTIONS\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\tISLAND CITIZENS\n\t\t\nAge\n\t\t\nLocation \n\t\t\n\t\t\nEmployment\n\t\tstatus\n\t\t\nAspirations\n\t\t\nEducation level\n\t\t\nOccupation\n\t\t\n\n\n\n\n\n",
  "theme": "06-speeches"
 },
 {
  "slug": "functions-education-system",
  "title": "Functions- Education System",
  "summary": "A detailed enumeration of six primary functions that education systems must perform: Information/Counselling/Advice (including assessment, referral, advocacy, diagnosis), Financing/Funding (grants, tuition, fees), Instruction (presentation, demonstration, coaching, assessment, recordkeeping), Governance/Leadership (planning, research, coordination, monitoring, quality control), Human Resources (teachers, administrators, specialists), and Products/Technology (textbooks, technologies, devices, assessment tools, Internet access). Provides functional framework for evaluating education system completeness and effectiveness, dated 2018.",
  "content_preview": "Ref:\n5-1\n\n\n2018\n\n\nEducation\nFunctions\n\n\n___________________________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t1-Information, counselling\n\tand advice \n\t\n\t\n\t\t\n\nAdvice\n\t\t\n\nCounseling\n\t\t\n\nInformation\n\t\t\n\nAssessment\n\t\t\n\nReferral\n\t\t\n\nAdvocacy\n\t\t\n\nDiagnosis\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t2-Financing/Funding\n\t\n\t\t\n\n\n\t\tGrants\n\t\t\n\n\n\t\tTuition\n\t\t\n\n\n\t\tFees\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t3-Instruction\n\t\n\t\t\n\n\n\t\tPresentation\n\t\t\n\n\n\t\tDemonstration\n\t\t\n\n\n\t\tDiagnosis\n\t\t\n\n\n\t\tDeveloping instructional \n\t\tmaterials\n\t\t\n\n\n\t\tLiai",
  "theme": "06-speeches"
 },
 {
  "slug": "fund-development",
  "title": "Fund development",
  "summary": "This memo from Don to Tom Davies outlines strategic recommendations for CFPEI's development approach as Don transitions from the Development Committee chairmanship. The letter advocates for shifting focus from pursuing large donations from wealthy individuals to building broader donor bases through smaller contributions and community engagement. Don recommends targeting younger people (forties rather than seniors), organizing presentation-style information sessions in communities, and engaging entire board membership in development. He proposes establishing committees to scout trust fund opportunities (MacDonald, Carver, Cotton trusts), creating a Challenge Fund, developing a Charitable Legacy Account program, and leveraging special community projects like MacPhail Homestead. The memo reflects Don's evolving philosophy that \"dollars will follow\" from engagement rather than strategic asks.",
  "content_preview": "Date:\t\t\n\n\n\n\nTo:\t\tTom Davies\n\n\n\n\nFrom:\t\tDon\n\n\n\n\nSubject:\tDevelopment\n\n\n\n\nSome thoughts, in random order, for your consideration:\n\n\n\n\nThe following have been churning in my mind for some time and, even though I am leaving the Chairmanship of Development, I decided to pass them along to you.\n\nSome general comments:\n\nI have been concentrating on individuals who, in my mind, have the potential for large donations.  Instead, I would put more effort into seeking donations say to the Island Fund or to s",
  "theme": "06-speeches"
 },
 {
  "slug": "glendenning-cottage-addition",
  "title": "Glendenning cottage Addition",
  "summary": "(100-200 words):**\nDesign analysis document for exterior siding options for the Glendenning cottage addition/renovation project. Don methodically evaluates four siding options based on multiple criteria: colour, board width, surface finish, groove patterns, and cost. Options evaluated include cedar rough-sawn (Option One), Cape Cod style (Option Two), vinyl (Option Three), and spruce panels (Option Four). The document demonstrates systematic decision-making: comparing existing stained vertical siding characteristics with alternatives, noting aesthetic considerations like colour matching and paint/stain durability, and evaluating cost implications. The preferred option ultimately recommends using spruce 4x8 panels while painting the entire cottage to achieve uniform appearance and address matching concerns. Reflects Don's methodical, analytical approach to problem-solving.",
  "content_preview": "Glendenning cottage Addition\n\nExterior siding\n\nFactors:\n\n  \nColour\n  \nWidth of board\n  \nMatching colour, pattern, surface\n  \nGroove – width and depth\n  \nCost\n\n\n\n\n\nPresent siding\n\n  \n4x8\n  \nStained\n  \nVertical\n  \n5/8\n  \n6 inch panel\n  \nRough sawn\n\n\n\n\n\nOptions:\n\nOne:\n\n  \n1x6 cedar rough side out;  results in V groove\n  \nAvailable at Atlantic    -Wholesalers; Garfield Street\n  \nNatural colour; would have to be painted/stained\n  \nReadily available\n\n\n\n\n\nTwo:\n\n  \nCape Cod\n  \n1x6 with groove but less p",
  "theme": "06-speeches"
 },
 {
  "slug": "launch-ceremony",
  "title": "Launch-Ceremony",
  "summary": "Detailed program for the Living Memorial Trust official launch and inaugural planting ceremony at Trails PEI, Wood Islands. Lists speakers including Don Glendenning (DG) for welcome and Living Memorial Trusts explanation, Norman Carruthers (CFPEI President), remarks from Wood Island Development Corporation and Island Trails leadership, remembrances from Keuper family members, and the inaugural planting by Mrs. Keuper and Don. Includes refreshments hosted by Plough the Waves Centre volunteers.",
  "content_preview": "Community Foundation of Prince Edward Island\n\n\n\n\nLiving Memorial Trust\n\n\n\n\n\n\n\nEVENT:\tOfficial Launch and Inaugural Planting\n\n\n\n\nLOCATION:\tTrails PEI entrance, Plough the Waves, Wood Islands, PEI\n\n\n\n\nDATE: \t\tJuly 21, 2007\n\n\n\n\nTIME:\t\t3:00 pm\n\n\n\n\nPROGRAM:\n\n\n\n\n\tWelcome –  \tDG\n\n\n\n\nCFPEI – \tNorman Carruthers, President\n\n\n\n\nLiving Memorial Trusts – DG\n\n\n\n\n\n\n\nRemarks -\tWood Island Development Corporation ?\n\nJohn Rousseau/Sandy MacLean?\n\n\n\n\n\t\tIsland Trails – Dennis Dunne, President?\t\t\n\n\n\n\nRemembering Cha",
  "theme": "06-speeches"
 },
 {
  "slug": "milton-notes",
  "title": "Milton notes",
  "summary": "Speaking notes for dedication ceremony at Milton/North Yorke River Road on November 5, 2008. Structured as welcome remarks explaining CFPEI's mission, the Living Trust origin story honoring Dr. Keuper's conservation work, and recognition of donors and honorees. Names specific individuals being remembered (Martha Burka, Roddie and Avis Cummings) and Island Sandblasting employees. Concludes with thanks to organizers.",
  "content_preview": "Notes for Living Trust\n\nNorth Milton\n\nNovember 5, 2008\n\n\n\n\n1\tWelcome \n\nAll\n\nIntroduce CFPEI people present\n\nA special occasion as we \n\nremember family, friends and colleagues\n\nIn so doing, we\n\nenhance the natural beauty of this community\n\nprotect our environment\n\n2\tCFPEI \n\nA volunteer driven, non-profit and Island wide charitable organization\n\nA new breed of charitable organization\n\nMore than 150 sister institutions across the country.\n\nOur Mission: “To improve the quality of life in PEI \n\nby Li",
  "theme": "06-speeches"
 },
 {
  "slug": "minister-brown-and-notes2015-2015-11-23t14-16-15",
  "title": "Minister Brown and  notes2015@2015-11-23T14;16;15",
  "summary": "Notes from Don's November 23, 2015 meeting with PEI Minister of Workforce and Advanced Learning Richard Brown and Deputy Minister Sharon Cameron. Discusses Education 20/20's activities, identifies \"preparedness gaps\" in youth qualification levels, and proposes establishing a qualification authority. Demonstrates Don's direct engagement with government on education policy and his advocacy for systemic improvements to education-to-workforce transition.",
  "content_preview": "3-\n\nMeeting with the Minister\n\n Workforce and Advanced Learning\n\n\n\n\nDate:\t\tMonday, November 23\n\nTime:\t\t2:00 pm at the Minister’s office, 3rd floor Shaw North\n\nAttendees:\tHon. Richard Brown, Workforce and Advanced Learning\n\nSharon Cameron, Deputy Minister, Workforce and Advanced Learning\n\n \t\tDon Glendenning, President, Education 2020    \t\t?\n\n\n\n\nOUR NOTES\n\n  \n\n\n\n\n\n\nOPENING REMARKS\n\n  \nAppreciate opportunity\n  \nTell you about our activities\n  \nWillingness to help\n\n\n\n\n\nEDUCATION 2020\n\nAbout 20/20 \n\n",
  "theme": "06-speeches"
 },
 {
  "slug": "montague-planning-1",
  "title": "Montague planning -1",
  "summary": "Planning sheet for the Montague workshop scheduled for Tuesday, February 18, 2014 (storm date February 20) at the Montague Rural Action Centre. The workshop, titled \"Education and Preparedness,\" aimed to inform the public about youth issues in PEI and discuss preparedness gaps for further education and employment. The format included opening remarks, a presentation by Steve McQuaid (VP, CFPEI) and researcher Katherine MacDonald, roundtable discussions, and wrap-up. Logistics covered venue capacity (25 people), coffee service, door prizes, handouts, and media coverage. Facilitators and volunteer roles were left to be assigned.",
  "content_preview": "r\n\n\t                                PLANNING\n\tSHEET     \n\t\n\t\nDraft-1\n\t\nLocation:\tMontague\n\tRural Action Centre;   838-4030\n\t\nFacilities:\n\t    Capacity\n\t25 people, kitchenette - No, tables; \n\t\n\t\nDate:\tTuesday\n\tFeb 18\t\tStorm\n\tDate: Thursday,\n\tFeb 20\n\t\nTime:\t\t7-9:30\n\tpm\n\t\n______________________________________________________________________________\n\t\nTitle:\t\n\t     \tEducation and Preparedness\n\t\nPurpose:\n\t  \tInform the public about youth issues in PEI; engage the public in\n\tdiscussions \n\t\n\t\n\t\tabout\n",
  "theme": "06-speeches"
 },
 {
  "slug": "notes-for-chair-1-20",
  "title": "Notes for chair 1  20",
  "summary": "Personal notes prepared for Don Glendenning as chair of the first stakeholder meeting. These notes outline his opening remarks, establishing the meeting's scope (not a general education review), acknowledging student-reported gaps, and framing the discussion around youth and community benefit. Don's notes reference preparatory research gathered: outcomes/competencies from PEI, Quebec, and Alberta; OECD competencies; college/university entrance requirements; essential and employability skills; school course outlines. The chair's notes outline the discussion flow: hear diverse perspectives (students, employers, post-secondary, school boards, Department of Education), brainstorm possible causes (documentation, communication, unclear/unreasonable requirements, inadequate learning, social promotion, changed graduation criteria), and propose next steps including identifying a common master list of basic skills. These notes reveal Don's thorough preparation and strategic thinking.",
  "content_preview": "3-2\n\nEducation 20/20 Inc.\n\nPreparedness-2 Background notes\n\n\n\n\n  \nWelcome\n\n\n  \nThanks for coming\n  \nWidespread interest \n  \nLimited invitations to people with whom I’v had conversations or have an involvemen\n  \nI’m sure there are others\n\n\n  \nFramework for discussion\n\n\n  \nNot a general review of education\n  \nStudents reported a gap\n  \n We want to see if we can narrow it or eliminate it altogether\n  \nOwe it to students and our community to help\n  \nAlso in our own best interests\n  \nTo the extent po",
  "theme": "06-speeches"
 },
 {
  "slug": "notes-for-chair-2-20",
  "title": "Notes for chair 2  20",
  "summary": "Chair's notes for the January 6, 2016 second meeting, framing the discussion within a human-centered \"Islanders on the road of life\" metaphor. Don's notes establish the meeting's purpose: understanding what help people need and what kinds of support are available. The notes define basic skills categories: reading, writing, speaking, listening, mathematics, digital communication, and personal management. Don's preparatory research included outcomes/competencies from multiple jurisdictions (PEI, Quebec, Alberta), OECD frameworks, entrance requirements, and essential/employability skills standards. The notes outline inquiry into what employers and institutions seek, possible gaps causes, next steps, and the goal of identifying a common master list of basic skills. The notes acknowledge social promotion as a fundamental challenge and address employer capacity to differentiate between students with and without basic competencies.",
  "content_preview": "3-2\n\nEducation 20/20 Inc.\n\nPreparedness-2 Background notes\n\nJanuary 6, 2016\n\n  \nWelcome\n\n\n  \nThanks for coming\n  \nOthers present\n\n\n  \nNeed to establish a framework for discussion\n\n\n  \nIslanders\n  \nOn the road of life\n  \nWho may need or want help\n  \nWhat kind of help needed\n  \nWhat do we mean by basic skills: reading, writing, speaking, listening, math, digital communication and personal management \n\n\n  \nGathered some information:\n\n\n  \nOutcomes/competencies: PEI, Quebec and Alberta\n  \nOECD compet",
  "theme": "06-speeches"
 },
 {
  "slug": "pattern-paragraphs",
  "title": "Pattern paragraphs",
  "summary": "A comprehensive collection of reusable paragraph templates for CFPEI outreach correspondence, organized by topic: opening greetings, community foundation explanations, endowment benefits, granting principles, CFPEI activities, service offerings, reasons for choosing CFPEI, administration flexibility, and closing remarks. Demonstrates Don's systematic approach to consistent messaging and reflects his communication strategy refined through numerous donor conversations.",
  "content_preview": "Pattern paragraphs\n\n\n\n\nOpening\n\n\n\n\n1A\tAs a follow-up to earlier conversations, I wanted to provide you with some detailed information about the Community Foundation of Prince Edward Island and also let you know of a new initiative to build a charitable legacy over a period of years.  First, however, let me say a few things about community foundations.\n\n\n\n\n1B\tThis letter comes to introduce you to the Community Foundation of Prince Edward Island (CFPEI)\n\n\n\n\nCommunity Foundations\n\n\n\n\nCommunity foun",
  "theme": "06-speeches"
 },
 {
  "slug": "pei-10-interventions",
  "title": "PEI 10 Interventions",
  "summary": "A comprehensive 10-point intervention framework addressing systemic education reform in PEI. Key interventions include: (1) Shift terminology focus from schools to education; (2) Define purpose through learner life roles; (3) Identify and make education services universally accessible; (4) Restructure according to \"form follows function\" principle; (5) Grant autonomy to front-line teachers; (6) Apply accountability mechanisms with autonomy; (7) Implement in-service teacher training; (8) Address grading/credentialing through developed qualification bodies; (9) Establish a PEI Education Association. Supporting observations identify 36 systemic characteristics requiring change, from fragmentation and unclear purpose to inappropriate politicization and lack of trust. Glendenning emphasizes these changes must be \"dealt with soon, and should be dealt with in a very public manner.\"",
  "content_preview": "PEI Interventions - 10\n\n1.\tTerminology- change focus from schools to education\n\n2.\tPurpose – the literature refers to helping people find a place in society; that place is a role and should be named or described – a citizen, a producer, a consumer or?  Both content and assessment demand it.\n\n3.\tServices - Education is a service, typical education services include: information, counselling, instruction, products and technology, quality assurance. governance, funding and human resources. Learners ",
  "theme": "06-speeches"
 },
 {
  "slug": "planning-1",
  "title": "Planning-1",
  "summary": "This is an internal planning document for a workshop titled \"A Quality School\" designed to identify characteristics of quality schools using UNICEF criteria. The workshop was planned for the Southport Room at Stratford Town Hall with capacity for 20-30 participants organized into small facilitated groups. The document includes logistical details such as date/time to be announced, facilities requirements (flipcharts, recorders, water), and planning checklist items covering volunteers, promotion, door prizes, press releases, and photography. The format calls for a presentation followed by facilitated discussion at tables with handout materials distributed pre-, during, and post-conference. This represents Don's involvement in organizing educational quality improvement discussions in Prince Edward Island communities.",
  "content_preview": "r\n\n\t                                 PLANNING\n\tSHEET     \n\t\n\t\nTitle:\t\n\t     \tA\n\tquality school    \t\n\t\n\n\tObjective:\n\t \tIdentify the characteristics of a quality school \n\t\n\t\n\n\tFormat:\tUsing\n\tthe criteria for a quality school developed by UNICEF participants\n\twill develop a school quality checklist\n\t\n__________________________________________________________________________\n\t\nLocation:\tSouthport\n\tRoom, Stratford Town Hall (Repeat elsewhere if demand warrants\t\t\t\n\t  \n\t\n\t\nContact:\n\t  \t\t\t\tPhone Number:",
  "theme": "06-speeches"
 },
 {
  "slug": "presentation-1",
  "title": "Presentation-1",
  "summary": "A comprehensive presentation document (January 16, 2022) synthesizing Glendenning's education reform analysis for public communication. Structured around PEI context (160,000 residents needing continuous learning), Key Definitions (Education, Educated, Teacher, Student, School, Education System, Good Education), Typical Education Services (Governance, Instruction, Products/Technology, Information, Counselling, Professional Support, In-service Training), and Principles (learners learn at own pace, collaboration benefits learning). Major section addresses Structural Issues (school/education confusion, clarity gaps, unclear purpose, product-focused structure, autonomy constraints, unstated accountabilities, cultural barriers, absence of market-driven self-correction mechanisms). Education Issues include competency vs. outcome confusion, collaboration barriers, inadequate progress reporting, relevance gaps, passive development role, narrow field focus, and student ranking problems. Conclusion: \"System needs an overhaul.\" The document reflects his mature thinking on systemic reform synthesized for presentation to community and government audiences.",
  "content_preview": "About\nEducation\n\nGlendenning\nNotes\n\nPRESENTATION-1\n\n\nAbout\n4-11\n\n\n2022-01-16\n\n\n\n\n\n\nINTRODUCTION\n\nPEI\n\n\t\n\n160,000\n\tresidents\n\t\n\nAll\n\tneed to learn; change/develop  what they know, believe feel, can do,\n\tvalue\n\t\n\nThat\n\tchange process is education\n\t\n\nEducation\n\t– important for individuals and for the community\n\t\n\nAll\n\tshould be encouraged to learn.\n\t\n\nSome\n\tchanges can be made by selves; sometimes learners need help/support \n\t\n\t\n\nPeople/government\n\tthink it important that citizens be educated\n\t\n\nGo",
  "theme": "06-speeches"
 },
 {
  "slug": "presentation-3",
  "title": "PRESENTATION 3",
  "summary": "Speech delivered at UPEI detailing Glendenning's educational philosophy and Holland College founding approach. References his methodological innovations including STEP, DACUM, learning guides, and visits to institutions like MIT and CEGEP. Emphasizes transformative educational frameworks and his Tuesday coffee sessions with flip charts, showcasing his collaborative leadership style.",
  "content_preview": "About ducation\n\nPRESENTATION-3\n\nUPEI\n\nINTRO:\n\n  \nThanks\n  \nDelighted to be here\n\n\nABOUT ME:\n\nEDUCATION:\n\n\n\n\nHOLLAND COLLEGE\n\n  \nAlternative to going to university\n  \nDidn’t plan to start for another year\n  \nAgreed to start in 1969 with existing courses\n  \nSouth Africa – Cry the beloved Country - Next right thing\n  \nTuesday coffee with flip charts\n  \nHandout\n\n\nSTEP\n\n  \nMonday letters\n  \nDocumentation\n  \nVisits, Project POET, Minnesota,  School 4i6, CEGEP, MIT\n  \nDREE, DACUM\n  \nSTEP\n  \nMaking of c",
  "theme": "06-speeches"
 },
 {
  "slug": "presentation-h-s",
  "title": "Presentation-H&S",
  "summary": "Presentation slides delivered to Health and Social Services on education system reform, defining education broadly while addressing conceptual clarity gaps, structural issues, and systemic problems. Demonstrates Glendenning's continued advocacy for system overhaul emphasizing autonomy, accountability, and service-oriented education into his later years.",
  "content_preview": "About\nEducation\n\nGlendenning\nNotes\n\n\n\n\n\n\nPRESENTATION-2\n\n\n2023-09\n27\n\nINTRODUCTION\n\n\t\n\nThanks\n\t\n\nDelighted to\n\tbe here\n\t\n\nCommend you\n\tfor your efforts\n\t\n\nWB: Home,\n\tteacher and community are the most important factors in a child’s\n\teducation\n\n\n\n\n\n\n\nABOUT ME\n\n\t\n\n\n\n\nEDUCATION\n\n\t\n\n Education -\n\tAny experience that changes the way a person thinks, acts or feels\n\t\n\nEducation –\n\ta process of arranging experiences that help others learn \n\t\n\t\n\nEducated –\n\ta level of personal development \n\t\n\t\n\nGood\n\tedu",
  "theme": "06-speeches"
 },
 {
  "slug": "presentation-notes",
  "title": "Presentation notes",
  "summary": "Historical background information on Canadian apprenticeship and skills training policy. The document traces the First National Conference on Apprenticeship in Trades and Industries (Ottawa, 1952) where governments were encouraged to develop occupational analyses. This led to the federal sponsorship of National Occupational Analyses (NOA) overseen by the Canadian Council of Directors of Apprenticeship. The NOA aims to describe skilled worker tasks, identify provincial/territorial consistency, develop Red Seal Examination instruments, facilitate apprentice mobility, and support training institutions and employers. This contextual material demonstrates Don's desire to ground the DACUM event within broader Canadian policy history, positioning DACUM as part of a larger national commitment to competency documentation. His inclusion of this history shows intellectual rigor and pedagogical thoughtfulness.",
  "content_preview": "The first National Conference on Apprenticeship in Trades and Industries was held in Ottawa in 1952. At the conference, it was recommended that the provincial, territorial and federal governments work together to prepare analyses of a number of skilled occupations.\n\nTo this end, Employment and Social Development Canada sponsors a program to develop a series of National Occupational Analyses (NOA). The program is overseen by the Canadian Council of Directors of Apprenticeship (CCDA).\n\nThe NOA hav",
  "theme": "06-speeches"
 },
 {
  "slug": "proposal-7",
  "title": "Proposal 7",
  "summary": "This proposal adds seventh objective requesting recommendations to stakeholders. It includes an eight-item consultant deliverables list with interim reports and PowerPoint presentation of final report, suggesting professional-grade output expectations. The document adds a detailed project timeline table spanning March through June with specific checkpoints for consultant milestones (instrument development, data gathering, analysis, draft report, stakeholder presentation). Budget remains at $31,000. This version shows project maturation with clear deliverable expectations and stakeholder communication plan.",
  "content_preview": "Page1\n\t\n\n\n\t\n\n\n\n\nA\nProposal for funding to undertake an assessment of  \n\n\nContinuing\nEducation and Workforce Development Needs \n\n\nIn\nthe Souris area\n\n\nSouris/7\n\nGoal:\n\tTo complete an assessment of continuing education and workforce\ndevelopment needs of adults in the Souris Area of Prince Edward\nIsland\n\n\n\n\n\n\n\nSouris\n\nSouris\nis a year-round port in Eastern PEI with a population of 1,053\n(Statistics Canada, 2016 Census), a decline of 10% from the 2011\nCensus. Compared to PEI as a whole, Souris has a",
  "theme": "06-speeches"
 },
 {
  "slug": "reduce-silos",
  "title": "Reduce silos",
  "summary": "Brief outline for breaking down organizational silos through creating unified vision, working toward common goals, educating and learning together, frequent communication, evaluating compensation plans, and implementing collaborative software. Document is repetitive, appearing to be notes or draft thoughts rather than formal presentation.",
  "content_preview": "Silos\n\n\n\n\n\tBeak\n\tdown silos:\n\t\n\t\t\n\nCreate\n\t\tunified  vision\n\t\t\n\nWork\n\t\ttoward common gols\n\t\t\n\nEducate,\n\t\twork, learn togthr\n\t\t\n\nCommmunicate\n\t\toten\n\t\t\n\nEvaluate\n\t\tcompensation plan\n\t\t\n\nImplement\n\t\tcollaborative software",
  "theme": "06-speeches"
 },
 {
  "slug": "reimagining-the-classroom",
  "title": "Reimagining the classroom",
  "summary": "Visionary notes on contemporary classroom transformation through information/communication technology and collaborative approaches. Emphasizes reimagining students as creators and discoverers rather than instruction targets. Advocates project-based learning enabling autonomy and target-specific achievement. Notes classroom physical design relatively unchanged for decades despite pedagogical evolution (references Winnetka, Illinois L-shaped room example and University of Illinois Centre for Innovation in Teaching/Learning). Briefly conceptualizes connecting students with broader world through technology. Highly sketchy notes suggest early ideation stage or presentation outline. Contrasts \"classroom little to do with education process\" with learning evolution. Addresses \"[learning evolving] fast but environment haven't changed in 00 years\" (typo suggesting \"100\"). Represents Don's engagement with pedagogical innovation trends.",
  "content_preview": "EDU/PEI\n\n\n\n\nReimagining the classroom\n\nNinformation and communication echnology\n\nOn line and  collaborative study\n\nReimagine\n\nNot just content that mattrs\n\nStudents as creators\n\nReimagine our worls\n\nNot as targets of instruction\n\nNot targets of instruction but creatures on a jurney of discovery and surprise\n\nPathways\n\nAlternative visionclassroom learning is changing\n\nProject based learning allows autonomy and targets specific areas\n\nConnecting with the world\n\nClassroom ltttle to do with the proc",
  "theme": "06-speeches"
 },
 {
  "slug": "rev-douglas-smith-my-notes",
  "title": "Rev. Douglas Smith-my notes",
  "summary": "Don's personal speaking notes (January 16, 2013) for Charlottetown Women's Probus Club presentation on Rev. Harvey Douglas Smith's life and legacy. Chronicles Smith's birth in Saint John (January 10, 1912), education at King's College, ordinations (1936, 1938), teaching posts, and transformative work founding MRHS. Includes Don's reflections on lessons learned about individual impact, community involvement, and broad educational vision.",
  "content_preview": "Charlottetown Womens’ Probus Club\n\nJanuary 16, 2013\n\nRev. Harvey Douglas Smith\n\n1912 - \n\n\n\n\nMy first reaction was to talk about education\n\n\n\n\n\n\n\n  \nMost important issue of our time, more important than energy or global warming\n  \nKind of education we provide today will determine, to a large extent, our future both as individuals and as a country\n\n\n\n\n\nThen I thought about the early years of Holland College and prepared notes accordingly\n\n\n\n\nDecided against it\n\nOne should be careful about visiting",
  "theme": "06-speeches"
 },
 {
  "slug": "sara-don-2-notes",
  "title": "Sara -Don-2 Notes",
  "summary": "Don's presentation notes for \"Sara\" (likely a collaborator or educator) describing visual lesson design on learner differences. Uses panels to illustrate concepts of previous experience, conditions, and expectations that affect learning outcomes, showing Don's continued engagement with educational design and diversity in learning styles throughout his later years.",
  "content_preview": "Notes – Don-2\n\n Presentation One\n\n  \n\n\n\n\n\n\n\n\n\nPresentation Two\n\n  \nStart with definition of learner\n  \nSometimes people  learn on their own – show person with a question mark in a bubble; sometime they are in school – student and desk\n  \nAll different – show individuals, large, small, male, female, but scatter over page to emphasize differences rather than group – even doing different things or looking in different directions\n  \nDifferences\n\n\n  \nPanel one- Previous experience in centre with trav",
  "theme": "06-speeches"
 },
 {
  "slug": "scan0001",
  "title": "scan0001",
  "summary": "A keynote address delivered to school principals in Shediac, New Brunswick in May 1970, where Don presents provocative ideas about educational systems and alternatives to traditional schooling. He defends discussing controversial matters, critiques the supervisor role with humor, addresses automation and human capacity, and poses fundamental questions: Why do we need teachers? Why Departments of Education? Why administrators? Why schools? He proposes alternative models ranging from historical apprenticeship through contemporary professional models where teachers work independently, learners choose educators, and payment follows service delivery. Don envisions a future where instructional aids and programmed materials support home-based learning, specialists work in professional clinics, and state responsibility focuses on licensing and ensuring basic literacy. This visionary speech demonstrates Don's radical thinking about institutional change and futures thinking in education.",
  "content_preview": ":J\n\nv\n\n/\n\n,-1\n\nSCHOOL PRINCIPALS' WORKSHOP\n\nSHEDIAC, N.B. May 20, 1970\n\n~C!........\n-..\n\n\"IT SHALL COME TO PASS...\"\n\nIntroduction -\n\nTOpic -\n\nappreciate invitation see a number of familiar faces always nice to be back in New Brunswick\n\nEntry into education was7an accident:\n-hadn't intended to write matrics -considered going into business -here I am - in administration (sometimes think that is as far removed from education as one can~\n\ndifficult to know what to say should one be entertaining or s",
  "theme": "06-speeches"
 },
 {
  "slug": "sorting",
  "title": "Sorting",
  "summary": "(166 words):** Don challenges Canada's credential obsession, noting that displayed degrees tell little about actual competence. He critiques how institutions award credentials based on pre-set programs that may not reflect real occupational requirements. Don distinguishes between degrees, diplomas, and certificates, finding transcripts more useful than general credentials. He argues employers rarely request formal credentials during hiring and suggests current credentialing systems fail to address employer concerns about communication skills, math/science knowledge, Canadian history, and work habits. The piece questions three fundamental issues: what credentials society needs, who should award them, and on what basis. Don advocates for reform of credentialing practices to better serve both students and employers, moving beyond institutional convenience toward meaningful assessment of actual competencies needed in the workplace.",
  "content_preview": "EDUCATION \t\t\t\t\t\t\tIssue No.\n\n20/20  \t        WHO SHOULD SORT?       _______________________________________________________________________13 Who should sort? \n\n\n\n\n\n\n\nCanadians like credentials. Places of work, whether they be trade, technical or professional, often display credentials of people who work there. I am not sure if such displays are intended to impress or intimidate. Most credetiaals I enclounter are issued by universities although a few are issued by professional and technical assoc",
  "theme": "06-speeches"
 },
 {
  "slug": "souris-notes-2019-3",
  "title": "Souris Notes- 2019-3",
  "summary": "These summary notes to Sharon Cameron trace the evolution of the Souris project from initial garden course discussions to a comprehensive needs assessment. Don notes contact with various stakeholders (Margaret Ching, Anne Miller, Alice Taylor, Delbert Francis) and organizations (PEI Construction Association, Business Women). The MRSB study was funded through Labour Market programs, and a local coordinator position could potentially be funded through SkillsPEI. The notes indicate Don's presentation to DM Wilson and follow-up planned with the Minister of Education and Life Long Learning.",
  "content_preview": "Souris\nProject-\n\n\nNotes for Sharon Cameron\n\n\nJune 28, 2019\n\n3-Souris\n2019-2\n\nBrief History\n\n\t\n\nContact\n\twith… about garden course\n\t\n\nDiscussion\n\tin Souris with Margaret Ching, Anne Miller, Alice Taylor, Delbert\n\tFrancis; interest in local youth, technology awareness, and basic\n\twork skills\n\t\n\nContacted\n\tPEI Construction Association, IAPEI, Business Women; all would be\n\tinterested in offering courses in Souris\n\t\n\n\n\tConversed with variety of people including Skills PEI and other\n\tagencies in East ",
  "theme": "06-speeches"
 },
 {
  "slug": "speaking-notes",
  "title": "Speaking notes",
  "summary": "Preparation notes for the education quality discussion sessions at Summerside and Stratford, dated March 1 and March 7, 2018. Structure includes opening remarks, rationale for discussion (education's importance, need for public discourse), audience engagement prompts, and flip-chart discussion topics. Notes reference the \"Road of Life\" brochure exploring individual, family, learner, citizen, consumer, and producer roles. Includes logistics reminders for flip charts, felt pens, newsletter sign-up sheets, and camera.",
  "content_preview": "Quality Education\n\nSummerside: Inspire Centre,  March 1, 2018\n\nCharlottetown: Southport Room, Stratford Town Hall\n\n   March 7, 4:30 \n\nProg/Conv/Summer\n\nNOTES: Need flip chart\n\n\tFelt Pens\n\n\tTo distribute\n\nNewsletter sign up sheet\n\nCamera\n\n\n\n\n  \nOpening Remarks\n\n\n  \nWelcome\n  \nAppreciate interest\n  \nThanks for coming\n  \nHandouts on table by door\n\n\n\n\n\n  \nWhy am I here/\n\n\n  \nEducation is important\n  \nNot much public discussion\n  \nHave some alternative/broader views \n\n\n\n\n\n\n\n\n  \nWHY ARE YOU HERE?/INTE",
  "theme": "06-speeches"
 },
 {
  "slug": "summary-1",
  "title": "Summary-1",
  "summary": "Editor's letter summarizing five key arguments for education system restructuring: lack of clear vision beyond youth, confusion of schooling with education, organizational misalignment with function, insufficient autonomy at frontline, and inappropriate use of grading for assessment and ranking. Concludes structural overhaul is necessary to address systemic gaps.",
  "content_preview": "Dear Editor:\n\nRestructuring called for D-!2\n\nMy review of education literature and discussion with Islanders suggests a need for changes in the way that public education is structured.\n\n  \nLack of a clear and compelling vision. Islanders think that the Department of Education has a responsibility for education at all levels; Department of Education documents define Education’s role as serving youth.\n  \nEquating going to school with getting an education. In a 20i9 report, The World Bank, the worl",
  "theme": "06-speeches"
 },
 {
  "slug": "talking-points-doc-2016-03-26t15-58-16",
  "title": "Talking Points doc@2016-03-26T15;58;16",
  "summary": "A structured set of talking points for Education 20/20 Inc. addressing organizational issues (politicization, leadership, responsiveness), skill gaps in youth, system gaps (information, counselling, assessment), and planned activities including workshops, awards reviews, and public presentations. The document appears to be notes prepared for discussion or presentation related to the education advocacy organization Don founded.",
  "content_preview": "c\n\n\n    \n\n\n\n\nTalking\nPoints\n\n\n\n\n\n\n\n\nFlorida\n\n\nMarch,\n2016\n\n\n\n\n\n\n\n\t\n\n\n\tOrganization\n\n\n\t\n\n\n\tPoliticization\n\t\n\n\n\tFocus\n\ton schools\n\t\n\n\n\tFocus\n\ton delivery\n\t\n\n\n\tLeadership\n\t\n\n\n\tResponsiveness\n\t\n\n\n\tRelevance\n\n\n\n\n\n\n\n\n\t\n\n\n\tKey\n\tskills:\n\n\n\t\n\n\n\tLack\n\tPreparedness Gap –\n\tidentified in the youth survey conducted in late 2013 by the\n\tCommunity Foundation.  Focused on young people recently out of\n\tschool not having skills needed for entry into postsecondary\n\tinstitutions and employment; secondary Includes yo",
  "theme": "06-speeches"
 },
 {
  "slug": "us-notes-for-john",
  "title": "US Notes for John",
  "summary": "Handwritten-style notes prepared by Don Glendenning for John Robinson's US Citizens Day remarks. Includes historical context about Islanders migrating to US for work (lumbering in Maine, railway/port jobs in Portland, etc.), describes present-day connections, and outlines CFPEI's mission as volunteer-governed community foundation. Reflects Don's deep understanding of PEI-US historical ties and his role in conceptualizing the Foundation's American engagement strategy.",
  "content_preview": "Possible remarks\n\nUS citizens Day\n\nJuly 4, 2006\n\n\n\n\nWelcome\tWe are delighted to see so many here today\n\n\n\n\nHistoric ties\tA century or more ago, one could catch a train any day of the week from\n\n Charlottetown heading for Portland and Boston \n\nIslanders lumbered in Maine and New Hampshire, worked at the railroad\n\n and marine terminals in Portland\n\n\t\tServed as nannies and companions to gentry of Boston\n\n\t\tThey also worked in Minnesota, Wisconsin, on the west coast and through\n\n the south\n\n\t\tsome s",
  "theme": "06-speeches"
 },
 {
  "slug": "various",
  "title": "Various",
  "summary": "(100-200 words):**\nComprehensive educational philosophy document presenting Don's theoretical framework including the Road of Life metaphor, definitions of essential skills, descriptions of typical education system services, and beliefs about education's purpose. Extensive sections address learners and learning processes, articulating that learners bring \"three pieces of luggage\": innate conditions, prior learning, and imagined futures. The document outlines future educational directions emphasizing individualized service delivery, competency-based curricula, and independent qualification authorities. Also includes detailed rating scales for assessing student understanding across five-point spectrum. This represents Don's mature educational philosophy, developed through years of reflection on how education systems should evolve to serve diverse learners.",
  "content_preview": "2021 Binder\n\n\n\n\nLEARNING PATH\n\n\n\n\nROAD OF LIFE\n\n\n\n\nWe are all on the road of life.  The road of life is a metaphor for the experiences we encounter between birth and death. While on the road, each person fills a number of roles, that of an \n\n•\tindividual, \n\n•\tfamily member,\n\n•\t citizen, \n\n•\tstudent \n\n•\tproducer and \n\n•\tconsumer\n\n\n\n\nHURDLES\n\nThe road of life, like any road, presents its share of hills, hollows twists and rough spots including:\n\n•\tNeed for formal qualifications\n\n•\tLimits to our ow",
  "theme": "06-speeches"
 },
 {
  "slug": "whim-inn",
  "title": "Whim Inn",
  "summary": "Meeting notes from March 19, 2007 Whim Inn gathering with Tom Hall, Tony Glencross, Bud Ings, Henry Compton, and Martin MacLeod planning a province-wide agricultural equipment collectors' gathering. The proposed April 28, 2007 event at the Farm Centre featured presentations from county representatives, a keynote by PEI Museum & Heritage Foundation Director Keenleyside, a virtual museum presentation by Barry King, and open discussion. Don notes were responsible for confirming attendance; he suggests expanding the thin agenda to either shorten the day or add more programming content.",
  "content_preview": "AGRICULTURAL HERITAGE PROJECT\n\nNotes from Meeting at Whim Inn\n\nMarch 19, 2007\n\nIn attendance:\tTom Hall\n\nTony Glencross\n\nBud Ings\n\nHenry Compton\n\nMartin MacLeod\n\n\n\n\nProposal:\tProvince wide gathering of interested collectors – tentative list attached\n\n\n\n\nProposed Agenda\n\n\n\n\nDate:\t\tSaturday, April 28, 2007\n\n\n\n\nLocation:\tFarm Centre, University Avenue, Charlottetown\n\n\n\n\nRegistration Fee:\t?\n\n\n\n\nAttendees:\tInvite people on our list and let them bring guests – advance registration requested\n\n\n\n\nProgram",
  "theme": "06-speeches"
 },
 {
  "slug": "x21-should-schools-sort",
  "title": "x21 Should schools sort",
  "summary": "A revised and refined version of the \"Sort.doc\" essay, presenting Don's arguments about credentialing with improved structure and clarity. The document addresses the same themes: questioning credential usefulness in determining actual competence, criticizing how institutions pre-determine curricula limiting student choice, highlighting the disconnect between institutional criteria and occupational standards, and emphasizing schools' dual role as teaching institutions and sorting mechanisms. The revision demonstrates Don's iterative approach to developing his ideas for publication or presentation, suggesting this was an important argument he wanted to communicate effectively to education stakeholders.",
  "content_preview": "21 Should schools sort? \n\n\n\n\n\n\n\nCanadians like credentials. Places of work, whether they be trade, technical or professional, often display credentials of people who work there. I am not sure if such displays are intended to impress or intimidate. Many of credentials I encounter are issued by universities although some a few are issued by professional and technical associations.  Such displays tell about some life choices that bearers have made such as where they went to school, the level of sch",
  "theme": "06-speeches"
 }
]