[
 {
  "slug": "01-cover",
  "title": "01-Cover",
  "summary": "Cover page for \"View From Jessie's Corner: Neighbours in Black River, New Brunswick in 1939\" by Donald E. M. Glendenning. Title reflects a literal location (likely Jessie's Corner was a place in the community from which Don observed neighbors) and temporal specificity (1939—Don's early childhood year, age 9-10). Signals beginning of major personal/family history project documenting his birthplace community.",
  "content_preview": "View From Jessie’s Corner:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNEIGHBOURS \n\nIN \n\nBLACK RIVER, \n\nNEW BRUNSWICK\n\nIN 1939\n\n\n\n\n\n\n\n\n\n\nBy\n\n\n\n\nDonald E. M. Glendenning",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "02-front-page",
  "title": "02-Front Page",
  "summary": "Front matter for \"View From Jessie's Corner: Neighbours in Black River, New Brunswick in 1939\" by Donald E. M. Glendenning, Charlottetown PEI, January 2005. ISBN field left blank (book not formally published or not yet assigned ISBN). This project documents Don's childhood community from the vantage point of his later years, bringing together genealogy, personal memory, and local history in a structured publication format.",
  "content_preview": "View From Jessie’s Corner:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNEIGHBOURS \n\nIN \n\nBLACK RIVER, \n\nNEW BRUNSWICK\n\nIN 1939\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald E. M. Glendenning\n\nCharlottetown PEI\n\nJanuary 2005\n\nISBN ??",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "1-cemetery-lots",
  "title": "1 Cemetery lots",
  "summary": "Don's 2012 letter to cemetery administrator regarding cemetery lot arrangements in Black River, discussing family burial plans and urn capacity. Personal correspondence documenting his connection to his birthplace.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown, PE\n\nC1A 3A9\n\n\n\n\nAugust 10. 2012\n\n\n\n\nLee Burnham\n\n30 North Black River Road\n\nBlack River Bridge \n\nN.B.\t E1N 5S4\n\n\n\n\nDear Lee:\n\nBlack River Cemetery Lots\n\n\n\n\nMany years ago, 1977 to be precise, while visiting my sister, Grace, in Boston, she expressed an interest in being buried in Black River.  Shortly thereafter, I “purchased” two 10’x 10’ lots, #143 for Grace and #142 for myself.  \n\n\n\n\nMy wife and I plan to be cremated with the ashes buried in urns in ou",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "1-credit-union-2007",
  "title": "1 Credit Union 2007",
  "summary": "Presentation notes from March 12, 2007, to a Credit Union detailing the Foundation's governance, investment portfolio ($866,866 in 31-Dec-2006 assets), and fund allocations. Lists Don Glendenning among Directors. The Glendenning Family Fund is noted with $23,617.08 in assets. Shows the Foundation's professional management structure and financial transparency.",
  "content_preview": "Credit Union\n\n\n\nPresentation Notes\n\n\n1\t           \t\t\t\t\t            \n    March 12, 2007\n\n\n\t\n\n\n\t\n\t\nOur\n\tMission\n\t\n.\n\t\nTo\n\timprove the quality of life in Prince Edward Island by providing a\n\tvehicle for donors to meet their charitable interests in perpetuity\n\tat a minimum cost and maximum convenience\n\t\n\n\n\n\t\n\t\nDirectors\n\t\nNorman\n\tCarruthers, President\n\t\nJohn\n\tIves, Vice President\n\t\nJohn\n\tRobinson, Past President\n\t\nBruce\n\tLewis, Secretary\n\t\nDavid\n\tCampbell, Treasurer\n\t\nHeather\n\tMacDonald\n\t\nAnne\n\tNich",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "1-death-don",
  "title": "1 Death - Don",
  "summary": "Comprehensive personal record containing Don's biographical details, family genealogy including parents Elmer and Jane, children Brian and Janet, siblings, funeral preferences, favourite hymns, and burial arrangements. Core biographical document for eulogies.",
  "content_preview": "January 17, 2013\n\n\t\t\t\t\n\n\tDON\n\n\n\n\nDON\n\nDonald Ernest Malcolm Glendenning, 62 Queen Elizabeth Drive, Charlottetown, P.E.I.  C1A 3A9\n\nSIN: 415 514 978\n\nBorn:\tLittle Branch, Northumberland County, New Brunswick on September 8, 1929\n\nFATHER:\tElmer Alton Glendenning\n\nMOTHER:\tJane Elizabeth (Watling) GlendenningCHILDREN: \tBrian Ernest Glendenning married Marie Carota\n\nJanet Esther Glendenning married Mike Spollen\n\nGRANDCHILDREN\n\nLisa Glendenning married Kevin Tegtmeier\n\nLaura Glendenning\n\nSIBLINGS: \tGr",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "1-history",
  "title": "1- History  -",
  "summary": "Comprehensive historical document authored by Don (March 2021, Draft 2) on Black River, New Brunswick, his birthplace (born 1929, Black River Bridge NB per user context). Chronicles settlement from United Empire Loyalists post-1776, Scottish immigration patterns, geographic features (8 miles south of Chatham, tributaries), early economy (logging, fishing, farming), transportation evolution, school/church development. Covers approximately 120 households by 1939, details prominent families (MacDonald, MacNaughton, Godfrey, McGraw, Cameron), includes living costs from 1930s-1940s, sawmill operations, road infrastructure, educational evolution through MRHS establishment (1939), and community institutions. Demonstrates Don's deep genealogical research, personal knowledge, and commitment to preserving local history.",
  "content_preview": "Along the Black River\n\nMarch 30, 2021\n\nDraft 2\n\n\n\n\nThis is not a history of Black River but rather random notes that I have gathered as part of my genealogical research.  While I include some notes on the early years, the focus is really on the period just before WW2.\n\n\n\n\nThe Black River\n\nThe Black River is about 8 miles south of Chatham, New Brunswick and originates in the forests between Barnaby River and Rogersville.  Like most rivers in the eastern part of the Province, the Black River flows",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "1-spare-cemetery-lot",
  "title": "1 Spare Cemetery lot",
  "summary": "Don's 2013 letter regarding Black River Cemetery lot arrangements with family member Barbara, discussing lot ownership and potential redistribution. Documents his family connections and commitment to Black River as burial place.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown\n\nPEI  C1A 3A9, \tCanada\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\tMay 21, 2013\n\n\n\n\nDear Barbara: \n\n\n\n\nGood to talk with you last Thursday but sorry to be the bearer of bad news; this seems to happen all too often as we get older. \n\n\n\n\nWe spoke about the lot 143, where your mother is buried, in the Black River Cemetery.  As you know, I bought my lots in 1973. I kept lot 142 for myself, and gave lot 143 to your mother; Norman owns lot144 and 145 on the other side of where your mother",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "100-1-appendices",
  "title": "100-1 Appendices",
  "summary": "Don's autobiographical reflection on formative educational literature including A.S. Neill's \"The Free Child\" (Summerhill school philosophy); \"The Eight Year Study\" (high school-college longitudinal research 1933-1941 showing innovative schools matched traditional schools academically while exceeding in non-academic life); Werner Z. Hirsch's \"Inventing Education for the Future\"; S.R. Laycock's \"Teaching and Learning\"; John Dewey's \"Education and Democracy\"; Neal Postman's \"Education as a Subversive Activity\"; and Mager's \"Setting Instructional Objectives.\" Biographical notes establish Don's birth (Sept 8, 1929, youngest of 10 children, Black River Bridge, NB), childhood on mixed farm, participation in church and youth organizations, marriage to Carol Chesney (1958), two children (Brian and Janet). Chronicles early career: Teachers' College (1947), one-room school teaching (age 17), Miramichi Rural High School principal by age 24, technical teacher education (1949-1951), Lord Beaverbrook Scholarship to University of London (1955-1956), Bradley University B.A. (1957), Indiana University Ph.D. (1962). Federal service with Canada Employment and Immigration included teacher training specialist role. Holland College presidency 1969-1987 established competency-based education, Atlantic Police Academy, Culinary Institute of Canada, Centre for Creativity. Founded Glendenning Associates consulting firm (1987). International development work included CIDA missions to Southeast Asia, Pakistan, Swaziland, China, Kenya, and UNESCO/OECD meetings. Awarded Order of Canada (1986), UPEI Honorary Degree (1988).",
  "content_preview": "Books that Made a Difference \n\n\n\n\n\n\n\nAs a youngster, I was an avid reader.  One Christmas, that of 1938 I believe, I received 8 books as Christmas gifts.  I’ve continued to be an active reader although in later years I read more newspapers and periodicals than books.  I consider a book to be of value even if it only reveals one new idea.  The names and authors quoted in the following paragraphs may not be entirely correct since, at time of writing, I am in the process of disposing of my memorabi",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "10b-parksville",
  "title": "10B- Parksville",
  "summary": "Photo plate caption document (PLATE 10B) continuing Parksville, Tennessee visual documentation (1911-1912). Images identified: Jane Glendenning with daughter Grace (portrait photo), Ocoee Lake above dam (landscape photo). Family portrait photographic evidence from Tennessee period. Grace identified as elder daughter born during Parksville residence. Third-party visual documentation component of larger genealogical/biographical project.",
  "content_preview": "PLATE 10B:\tParksville, Tennessee, 1911 & 1912\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJane Glendenning and Grace\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOcoee\nLake above dam",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "11-jane-watling",
  "title": "11-Jane Watling-",
  "summary": "Don's detailed biography of his mother Jane Elizabeth Jardine Watling (b. Feb 28, 1890; d. 1964). Chronicles her birth at the Meadows (Upper Black River), family of eight, move to the Branch, arrival in Portland Maine (Jan 24, 1908), domestic work for families like the Jennisons. Documents her friendships, extensive correspondence and autograph album entries from Maine and Tennessee, and original poetry (\"Mothers,\" Oct 1934) written after her mother's death. Includes genealogy of Watling siblings and detailed reconstruction of her pre-marriage life in the Boston States. Valuable personal and poetic insight into Don's mother's youth.",
  "content_preview": "Glendenning\n\tFamily Memories\n\nJANE ELIZABETH JARDINE WATLING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJane Watling was born, presumably at \nhome, at the Meadows, Upper Black River, New Brunswick on February\n28, 1890. Although her name was Jane, Dad always called her Jean;\nthis may account for the fact that the Watling side of the family\ncontinued to call her Jane (or Janie as Uncle Ern called her) while\nthe Glendenning side of the family referred to her as Jean.  I\nremember Mum saying that Dad referred to her as",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "13-a-brief-return",
  "title": "13-A Brief Return",
  "summary": "Don's chronological summary of parents' return to New Brunswick (1912-1913). Reconstructs timeline: Grace born Parksville (Sept 23, 1911), Jessie MacDonald dies (April 1912), parents still in Parksville (Nov 1912), Parksville dam completed (Dec 1912), work on Goforth Creek dam (1913), mother returns to Little Branch (summer 1913), father follows (fall/winter 1913), purchase of Jessie MacDonald property (July 21, 1914), Don's father postmaster role (Nov 1914-Aug 1916). Chronicles family's gradual reestablishment in Black River with brief detour to North Hampton Connecticut (1916) where sister Lillian born. Demonstrates Don's meticulous genealogical reconstruction methodology.",
  "content_preview": "REESTABLISHING ROOTS IN NEW BRUNSW3ICK\n\n\n\n\n\n\n\nBack to New Brunswick\n\n\n\n\n\n\n\nWe do not know exactly when Mum and Dad returned to New Brunswick but here are a few facts: \n\n\n\n\nElmer and Jane set up housekeeping in Parksville, Tennessee on February 11, 1911.\n\nTheir first child, Grace, was born in Parksville, Tennessee on September 23, 1911.\n\nJessie MacDonald died in April, 1912.\n\nA number of entries in Mum’s autograph album, the last on November 13, 1912, show they were still in Parksville at that ti",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "15-life-at-little-branch",
  "title": "15-Life at Little Branch",
  "summary": "Comprehensive account by Don of family's permanent settlement and farming operation at Little Branch (1919-1938). Details property acquisition (Jessie MacDonald property, $800, 1914), house renovation and barn expansion, acquisition of five properties for his sons, mixed farm operations (animals, crops, products), sheep shearing practices, Model T and Model A Ford automobiles, agricultural society involvement (Secretary-Treasurer 14 years), community roles (church trustee, hall construction, pulp business partnership with John W. MacNaughton). Includes his father's final illness (pernicious anemia/leukemia, diagnosed 1933) and death (1938). Rich detail of rural life, farm management, and family structure. Essential for understanding Don's formative years and his father's legacy.",
  "content_preview": "Glendenning\n\tFamily Memories\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLIFE\nAT LITTLE BRANCH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI\nbelieve that Elmer and Jane Glendenning returned to New Brunswick in\n1919 although I do not know the exact date nor even if they travelled\ntogether.  Named and dated photos in Mum’s collection, show that\nthe family was in Mussel Shoals, Alabama in the earlier part of 1919.\n John was born on December 14, 1919 in Black River; the younger\nchildren would have been there as well.  So the move must have\noccurred ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "16-jane-glendenning",
  "title": "16-Jane Glendenning",
  "summary": "Don's intimate portrait of his mother Jane Elizabeth (Jardine) Glendenning as widow (1938-1964), post-father's death. Describes wartime changes to Black River (Miramichi Rural High School, airbase, radar station), her church activism (Women's Missionary Society, Presbyterian League, Women's Institute), educational advocacy, knitting practices, bread-making, wool processing at Brown's Woolen Mills (Nelson), hospitality, oil lamp maintenance, food preservation/canning techniques, and community nursing. Recounts her announcement of war's end to Little Branch School (VE Day 1945), continued residence with son Norman and wife Jean, death from pancreatic cancer (March 24, 1964, Miramichi Hospital). Poetry and vignettes illuminate her character, values, and domestic expertise. Final portrait shows her impact on family and community.",
  "content_preview": "Glendenning\n\tFamily Memories\n\n\n\n\n\n\nJANE ELIZABETH (JARDINE) GLENDENNING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter\n28 years of marriage, Jane Elizabeth Jardine (Watling) became a widow\nin 1939; she was 48 at the time.  The two oldest daughters, Grace and\nVenetia, were married and living elsewhere; her daughter, Lillian,\nwas living and working in the Boston area.  Elinor and the five boys,\nthe youngest being nine years old, were living at home.\n\n\n\n\n\n\n\n\nThe\nnext decade, the wartime years, brought a number of significant",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "1b-cover",
  "title": "1B-Cover",
  "summary": "Alternate cover page for \"Glendenning Family Memories\" volume showing four portrait photographs: Elmer Alton Glendenning (top left), Jane Elizabeth Jardine Watling (top right), Walter and Elizabeth (Peters) Glendenning (bottom left), and Jubal and Grace (MacDonald) Watling (bottom right). Credited as \"From the Collection of Jane Elizabeth Jardine (Watling) Glendenning.\" Dated June 28, 2005 by Donald E. M. Glendenning. Serves as visual frontispiece for the genealogical project, presenting the two main ancestral couples.",
  "content_preview": "Glendenning\n\tFamily Memories\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\t\t\t\t\n\n\t\n\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nTop left:\tElmer Alton\n\tGlendenning\n\t\nTop right:\tJane\n\tElizabeth Jardine Watling\n\t\nBottom left:\tWalter and\n\tElizabeth (Peters) Glendenning\n\t\nBottom Right:\tJubal and\n\tGrace (MacDonald) Watling\n\t\n\n\n\n\t\n\t\nFrom the Collection of\n\tJane Elizabeth Jardine (Watling) Glendenning\n\n\n\nDonald\n\t.E. M. Glendenning        \t\t                                  February 18, 2026",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2-a-contents",
  "title": "2-A Contents",
  "summary": "Complete table of contents for \"Glendenning Family Memories\" compiled by Don Glendenning. Lists major sections: Introduction, Background, Glendenning Roots, Watling Roots, individual biographies (Elmer, Jane), narrative sections (Together in USA, Brief Return, Lured Back to USA, Life at Little Branch, Widowhood), Offspring, and Appendices with family dates, ancestor charts (Elmer and Jane), and descendants. Demonstrates the comprehensive scope and scholarly organization of Don's genealogical project. Dated June 28, 2005.",
  "content_preview": "CONTENTS\n\n\n\n\n\n\n\n\n\n\nIntroduction\n\n\n\n\nBackground\n\n\n\n\nGlendenning Roots\n\n\n\n\nWatling Roots\n\n\n\n\nElmer Glendenning\n\n\n\n\nJane Watling\n\n\n\n\nTogether in the USA\n\n\n\n\nBrief Return to New Brunswick\n\n\n\n\nLured Back to the USA\n\n\n\n\nLife at Little Branch\n\n\n\n\nWidowhood\n\n\n\n\n11\tOffspring\n\n\n\n\n12\tAppendices\n\n\n\n\n\tA\tSome Family Dates\n\n\tB\tAncestors of Elmer\n\n\tE\tAncestors of Jane\n\n\t\tF\tDescendants of Elmer and Jane\n\nGlendenning Family Memories\n\n\n\n\nDon Glendenning\t\t TIME \\@ \"MMMM d, yyyy\" June 28, 2005",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2-b-plates",
  "title": "2-B Plates",
  "summary": "List of photographic plates and illustrations included in \"Glendenning Family Memories.\" Numbers 19 plates covering locations (Muscle Shoals Alabama, maps of Scotland, land grant documents) and family coat of arms (Glendenning and Watling). References Canobie, Meadows, and Little Branch land grants. Acts as visual index to the documented research. Demonstrates Don's use of historical maps, heraldic materials, and property records to support genealogical narrative.",
  "content_preview": "PLATES\n\n\n\n\n1\tMap of Scotland, England and Ireland\n\n\n\n\n2A\tElmer Glendenning\n\n\n\n\n2B\tElmer Glendenning\n\n\n\n\n3\tElmer Glendenning’s Siblings\n\n\n\n\n4\tElmer Glendenning in Portland\n\n\n\n\n5\tNew Hampshire\n\n\n\n\n6\tWausau, Wiswconsin\n\n\n\n\n7A\tJane Watling\n\n\n\n\n7B\t\n\n\n\n\n7C\n\n\n\n\n8\tJane Watling in Portland\n\n\n\n\n9\tWatling Siblings\n\n\n\n\n10\tParksville, Tennessee\n\n\n\n\n11\tNorth Haven, Connecticut\n\n\n\n\n12\tHampton, Virginia\n\n\n\n\n13\tMussell Shoals, Alabama\n\n\n\n\n14\t\n\n\n\n\n15\n\n\n\n\n15\n\n\n\n\n16\n\n\n\n\n17\n\n\n\n\n18\n\n\n\n\n19\n\n\n\n\n\n\n\n\n\n\nA\tMap of Scotland\n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2-dedication",
  "title": "2-Dedication",
  "summary": "Dedication page for \"Glendenning Family Memories\" volume book by Don, dated April 3, 2005. Dedicates the work to the memory of his parents: Elmer Alton Glendenning (June 29, 1875 – May 18, 1938) and Jane Elizabeth Jardine (Watling) Glendenning (February 28, 1890 – March 24, 1964). Simple, reverent dedication expressing the purpose of the genealogical research as honoring parental memory. NOTE: Discrepancy in Elmer's birth date (shown as \"1975\" in transcription, clearly should be 1875 based on all other documents). Reflects Don's deep filial devotion and the emotional motivation behind his substantial research project.",
  "content_preview": "Dedicated to the Memory of\n\n\n\n\nMy Father and Mother\n\n\n\n\n\n\n\n\n\n\nElmer Alton Glendenning\n\nJune 29, 1975 – May 18, 1938\n\n\n\n\nand\n\n\n\n\nJane Elizabeth Jardine (Watling) Glendenning\n\nFebruary 28, 1890 – March 24, 1964\n\nGlendenning Family Memories\n\n\n\n\nPAGE  \n\n\n\n\n\n\n\nPAGE  1\n\nDon Glendenning\t\t TIME \\@ \"MMMM d, yyyy\" April 3, 2005",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2-general",
  "title": "2-General",
  "summary": "A draft history of Miramichi Rural High School from which Don was a student. Documents early education in Black River beginning with home-schools in barns and homes (from 1817), then the 1825 petitioned school near Black River, and the district divisions around 1845. This is Don's personal research into his own school's history and the broader Miramichi educational heritage, reflecting his lifelong connection to the region.",
  "content_preview": "Miramichi\nRural High School:\n\nFirst\nin its Class\n\n\n\n\n\n\nNOTE:\n A\nfirst draft of a brief history of the Miramichi Rural High School.  \n\n\n\n\t\n\n\n\t\n\t\nEarly\n\tEducation\n\t\n\n\n\n\t\n\t\nSoon\n\tafter getting settled in their new community, settler’s thoughts\n\tturned to education. The first home-school in Black River was held\n\tin a barn belonging to Archibald Cameron, Sr.; the first school in\n\tBay du Vin was operated at the home of James Graham near Buckley’s\n\tBridge in Bay du Vin.  The task of teaching usually fe",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2-history",
  "title": "2 History",
  "summary": "Substantial historical narrative documenting the origins and development of Presbyterian communities in Black River from the 1700s through the 1800s. Traces early settlers including United Empire Loyalists and Highland Scots, describes the first churches (Tucker's Point and St. Stephen's), and details the community's religious and social development. Demonstrates Don's scholarly research into family and local history.",
  "content_preview": "THE\nCOMMUNITY \n\n\n\n\n\n\n\n\n\n\n\n\nThe\nname, Black River, is thought to have come from the MicMac word\nMatquantigook that probably meant “black river”; the Black River,\nwith its tributaries principally the Little Black River but better\nknown as the Little Branch River, flows into Bay due Vin and the\ninner Miramichi Bay.  At one time, the community of Black River\nappears to have extended as far east as Bayside (Miramichi) and\nperhaps as far as the Bay due Vin River.  The mouth of the Black\nRiver, around ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2-publications",
  "title": "2 Publications",
  "summary": "Don's comprehensive 2010 publication list documenting his major genealogical and local history works including Glendenning Roots, Family Chronicles (200 newsletters on relatives and ancestors), The Neighbourhood (WW2-era households), and Presbyterians in Black River. Demonstrates his scholarly contributions to family and community history.",
  "content_preview": "March 30, 2010\n\nGENEALOGY\n\n\n\n\n\n\n\nThis is the most up-to-date list (prepared in Nov 2011 for my visit to South Miramichi Historical Society. \n\n\t \tLOCAL HISTORY PUBLICATIONS\n\nby \n\nDon Glendenning\n\nPublications:\n\n1\tGlendenning Roots - Background and photos on the life and times of Elmer and Jane (Watling) Glendenning with a focus on their years in the USA.  It also lists ancestors for each as well as their descendants.  (Approximately 200 pages bound.)\n\nCarol Louise (Chesney) Glendenning - Backgrou",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2003-history",
  "title": "2003 History",
  "summary": "Don's comprehensive 2003 history of Presbyterians in Black River, tracing 200+ years of church history including St. Paul's Presbyterian Church (opened 1930). Demonstrates his scholarly commitment to documenting local religious and community heritage with extensive source citations.",
  "content_preview": "A\nBRIEF HISTORY\n\n\n\n\n\n\nOF\n\n\n\n\n\n\nPRESBYTERIANS\nIN BLACK RIVER \n\n\n\n\n\n\n\nNEW BRUNSWICK\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald\nE. M. Glendenning, C.M.\n\nCharlottetown,\nP.E.I.\n\nDecember\n2003\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nACKNOWLEDGEMENTS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe\nauthor grew up in the community of Black River and in St. Paul’s\nPresbyterian Church.  St. Paul’s was an integral part of our family\nlife; my mother and father were among the founders. ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2004-addresses",
  "title": "2004-Addresses",
  "summary": "Comprehensive mailing list of 40+ addresses spanning North America, UK, and New Zealand including family members (Glendennings, Russells), close friends, and professional contacts. Includes extended family like Ada Glendenning (Florida), Eileen Glendenning (Black River Bridge, NB), Eric & Jeanie Glendenning (NB). Lists international contacts: Leslie & Jean Ingham (New Zealand), Rob & Margaret Ironmonger (Singapore), Stephen Chase (Australia). Includes \"Carol's Christmas List\" with first names and a separate \"Electronic List\" of professional contacts (Holland College directors, past directors, colleagues). Reflects Don and Carol's wide social and professional network. Purely administrative; useful for genealogical mapping of relationships.",
  "content_preview": "ADDRESSES\n\n\n\n\n\n\n\n Mr. & Mrs. Mario Carota\n\n    132 Lennox St.\n\n    Santa Cruz, CA.\n\n    95060   USA\n\n  \n\n   Barbara Coppla\n\n   30 Claremont St.\n\n   Malden, Mass.  02148-4604\n\n   USA\n\n   \n\n  Robin & Joy Farrell \n\n   229 Cloverland Drive\n\n   Rochester\n\n   New York\t\t14610\n\n    \n\n   Dave and Clare Garland\n\n   5323 36th. Ave\n\n   Wetaskiwin, Alberta    T9A 2Z7\n\n  \n\n    Mrs. Ada Glendenning\n\n    8427 Truman St\n\n    Englewood, Florida     34224\n\n  \n\n    Miss Eileen Glendenning\n\n    450 Little Branch Roa",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2004-card",
  "title": "2004- card",
  "summary": "Christmas card featuring a New Brunswick winter scene photograph from 1934 showing Don's parents Walter and Venetia Glendenning in front of the Glendenning residence at Little Branch, N.B. Photo sourced from collection of Venetia (Glendenning) Russell. Card expresses traditional seasonal wishes: \"a joyful heart, a loving home, a peaceful world.\" Reflects Don's connection to family history and his childhood home in New Brunswick. Touching choice to feature his parents in yuletide greeting.",
  "content_preview": "A New Brunswick Winter Scene - 1934\n\n\n\n\n\n\n\n\n\n\n\nSeason’s\nGreetings\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    A New\nBrunswick Winter Scene - 1934\n\n\n\n\n\n\n\n\n\nSeason’s\nGreetings\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPhoto shows Walter and\nVenetia Glendenning in front of  \n\n\n\nThe Glendenning residence\nat Little Branch, N.B.\n\n\n\t- from the collection of\nVenetia (Glendenning) Russ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2005-front",
  "title": "2005-Front",
  "summary": "Front page of 2005 Christmas card featuring title \"Little Branch School Register – 1933-1934\" and \"Merry Christmas\" greeting. This was Don's childhood school in his birthplace of Black River Bridge, NB. The card's central design element is the historical school register, emphasizing Don's personal and genealogical connection to his origins. Choice of this historical artifact for Christmas card design shows thoughtful reflection on family history and educational heritage.",
  "content_preview": "Little Branch School Register – 1933-1934\n\n\n\n\n\n\n\n\n\n\n\n\nMerry\nChristmas\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLittle Branch School Register – 1933-1934\n\n\n\n\n\n\n\n\n\n\nMerry Christmas",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2005-letter",
  "title": "2005-letter",
  "summary": "Christmas letter from Don and Carol dated 2005 providing family updates. Carol \"manages household, paints, plays bridge and tends flower gardens.\" Don \"pretends to be busy with genealogy, writing and volunteering.\" Brian works with ALMA project at NRAO with extensive travel; Marie is IT specialist at NRAO; Lisa graduated and works at Los Alamos; Laura in third year at UNM, Albuquerque. Janet in Ottawa with Canadian Transportation Agency. Reports visits from Brian and Janet during year, Laura's summer visit. Notes two-month Florida winter stay, participation in home exchange program (exchanged with Toronto and Florida couples; planned exchange with Karlsruhe, Germany couple for summer). References summer cottage at shore. Warm, active retirement portrait showing continued family engagement and travel interests.",
  "content_preview": "‘tis\na month before Christmas!\n\n\n\t\n\n\n\t\n\t\n\n\n\t\nChristmas\n\t2004\n\t\n\n\n\n\t\n\t\n\n\n\t\nCarol and Don at Cavendish Beach, November 2005\n\t\n\n\n\t\nJanet and\n\tDon with leaves, November 2005\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nGreetings:\n\t\n\n\n\n\t\n\t\nAll are\n\twell.\n\t\n\n\n\n\t\n\t\nCarol\n\tmanages the household, paints, plays bridge and tends her flower\n\tgardens in the summer.\n\t\n\n\n\n\t\n\t\nDon still\n\tpretends to be busy with genealogy, writing and volunteering.\n\t\n\n\n\n\t\n\t\nBrian is\n\twith the Alma project of NRAO and has had a very busy travel\n\tschedule th",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2005-st-pauls",
  "title": "2005-St. Pauls",
  "summary": "Don's speaking notes for St. Paul's Presbyterian Church 75th anniversary (2005), featuring historical context from 1930 and personal recollections of Black River during the Depression era. Personal reflections on community and church significance.",
  "content_preview": "ST PAUL’S PRESBYTERIAN CHURCH\n\nBLACK RIVER BRIDGE, NB\n\n\n\n\nSpeaking Notes on the occasion of the75th Anniversary\n\nJuly 24, 2005\n\n\n\n\n\n\n\nCongratulations - \tmembers and adherents of this congregation for seventy-five years of dedication and service\n\nThanks for the invitation to take part - Seventh-five years ago\n\nfirst regular church service.  \n\nI was here and let me see  \n\nEdith, Marjorie, Ken, Norm, George, Marion, Blanche, others ?\n\n\n\n\nThe Chatham Gazette on July 15, 1930 called this church build",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2006-addresses",
  "title": "2006 Addresses",
  "summary": "Updated 2006 version of Christmas mailing list with 40+ addresses. Similar to 2004 version but with some updates: includes Sandra Shea (Miramichi, NB) as new addition, removes some previous entries, updates some addresses. Maintains international contacts (UK, Australia, New Zealand, Singapore) and extended family network. Documents Don and Carol's continued wide social and family network maintained through regular Christmas correspondence. Includes reference to \"Don & Geneva King\" in Holland Landing, Ontario (possible connection to Holland College connection). Purely administrative mailing list document.",
  "content_preview": "ADDRESSES - 2006\n\n\n\n\n\n\n    Mr. & Mrs. Mario Carota\n\n    132 Lennox St.\n\n    Santa Cruz, CA.\n\n    95060   USA\n\n  \n\n   Barbara Coppla\n\n   30 Claremont St.\n\n   Malden, Mass.  02148-4604\n\n   USA\n\n   \n\n  Robin & Joy Farrell \n\n   229 Cloverland Drive\n\n   Rochester\n\n   New York\t\t14610\n\n    \n\n   Dave and Clare Garland\n\n   5323 36th. Ave\n\n   Wetaskiwin, Alberta    T9A 2Z7\n\n  \n\n    Mrs. Ada Glendenning\n\n    8427 Truman St\n\n    Englewood, Florida     34224\n\n  \n\n    Miss Eileen Glendenning\n\n    450 Little B",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-barry-loperman",
  "title": "2008-Barry-Loperman",
  "summary": "Email exchange (January 30-31, 2008) between Don Glendenning and Barry MacKenzie regarding Alexander Watling and Mary Ann Lopemen. Don inquires about Alexander Watling of Chatham (born September 10, 1889), while Barry provides census analysis from 1851-1881 identifying this Alexander as likely the son of William Watling and Mary MacNaughton. Demonstrates Don's systematic genealogical research methods and collaborative correspondence with specialists.",
  "content_preview": "From: \"Barry MacKenzie\" <barrymack4@hotmail.com>\n\nTo: \"Don Glendenning\" <dglende@pei.sympatico.ca>\n\nSubject: RE: Lopeman\n\nDate: January 31, 2008 12:22 AM\n\n\n\n\n\n\n\n\n\n\nHello Don!\n\n \n\nI am afraid that you are overestimating my level of Watling expertise! However, in this case, I believe that I may have figured out who the Alexander who married Mary Ann Lopeman was. The Census of 1881 shows Alex Sr.(26), Mary Ann (23), and two children: Mary M. (3) and William (2m). Alex Jr. was born later, as we know",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-bsrry-watling",
  "title": "2008-Bsrry-Watling",
  "summary": "Email from Barry R. MacKenzie (Sept 12-15, 2006) to Don's genealogy group providing newspaper death records for William Watling (died Oct 11, 1895, age 75, Miramichi resident 65 years, arrived 1830) and Mary McNaughton Watling (died Nov 6, 1871, age 47, of consumption). Includes census data and discussion of John Watling's marriage to Jessie Carruthers (1849), their children, and their movements between New Brunswick and Massachusetts. Demonstrates Don's role organizing collaborative genealogical research.",
  "content_preview": "Hello\nall,\n\n \n\nSome answers (at least I think they are) to\nDon's good questions.\n\n \n\nFirstly,\nas per the deaths of William and Mary:\n\n \n\nDate\n:\nOctober 11, 1895\n\nCounty\n:\nSaint John\n\nPlace\n:\nSaint John\n\nNewspaper\n:\nThe Daily Sun\n\nChatham (North. Co.) Oct. 10 - For 65 years\nWilliam\nWATLING was\na resident of Miramichi. He came to this country from England with\nhis parents in 1830 and\nwas 75 years of age at the time of his death. He was laid away in the\nBlack\nRiver burial ground.\nFour years ago he ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-erin-comeau",
  "title": "2008-Erin-Comeau",
  "summary": "Extended email correspondence (January 2008) between Don Glendenning and Erin Knighton establishing distant cousinship through Elizabeth J Glendenning (b. 1843, m. Amos Comeau in New Bandon, NB). Erin provides detailed family tree spanning five generations from her great-great-grandparents through herself, including ancestry through Comeau, Faulkner, Knighton, and Cook families. Don shares information about John Glendinning (b. Jan 29, 1772) and confirms Scottish Ancestry Research Society's findings. Demonstrates Don's active engagement in helping descendants understand connections to the broader Glendenning family network.",
  "content_preview": "From: \"Erin Knighton\" <eknighton@yahoo.ca>\n\nTo: \"Don Glendenning\" <dglende@pei.sympatico.ca>\n\nSubject: Re: Elizabeth J Glendenning\n\nDate: January 27, 2008 12:15 PM\n\n\n\n\nWell, I am not sure about Edward Comeau either, he is\n\nlisted the youngest child in a 1881 census (born march\n\n1880)but my grandmother doesn't remember him. I\n\nsuppose maybe he could have died in infancy, so far I\n\nhaven't been able to find any other reference to him.\n\n\n\n\nGood news though, you can add William Burton Comeau\n\nback o",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-hamilton",
  "title": "2008-Hamilton -",
  "summary": "Email (January 4, 2008) from Bonnie Hamilton to Don's genealogy group responding to his update on Harley family research. Hamilton discusses Mary Anne Harley Henry's 99th birthday interview, missing family members, the William Harley who moved to Upper Canada, and her own research in Ireland (Courtmacsherry, Rathclarin parishes) connecting Knowles and Harley families. Mentions meetings with William Harley (author of family history) and discoveries about marriage arrangements across Courtmacsherry Bay. Shows Don's role orchestrating multi-person genealogical investigations.",
  "content_preview": "From: \"B J Hamilton\" <hamilton3049@rogers.com>\n\nTo: \"Don Glendenning\" <dglende@pei.sympatico.ca>; \"Kim Nielsen\" <chriskim@telusplanet.net>; \"Heather Wilson\" <callixiuh@yahoo.ca>; \"Irma Downing\" <dondown@nbnet.nb.ca>; \"Kelsie Erskine\" <erskinekd@yahoo.co.uk>\n\nSubject: Re: Update\n\nDate: January 4, 2008 10:44 PM\n\n\n\n\nHello Everyone,\n\n\n\n\nJust a few observations off the top of my head as my notes have been packed away while I have been occupied with other pursuits over the last few months. However, no",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-harley-notes-1",
  "title": "2008-Harley notes -1",
  "summary": "Don Glendenning's personal notes (January 1, 2008) on his Harley family connections through his Great Grandmother Margaret Harley who married John Glendinning. Notes his lack of direct proof of paternity while acknowledging Margaret's siblings (William, John, Elizabeth, Mary Anne). References his Family Chronicle issues #1, #4, #125, #134, #136, and mentions he is the youngest of nine siblings, with specific issues devoted to each. Notes Burton Glendenning's archival work on Burchills, and speculates on Hurley/Harley surname interchangeability. Reveals Don's systematic approach to publishing family history.",
  "content_preview": "HARLEY NOTES\n\nJanuary 1, 2008\n\n\n\n\nI had a number of queries recently about my Harley connections and information about the Harley Family.  I used the queries as an excuse to review my notes and files.  Here are a few notes that do not seem to fit into the actual family tree but may be of interest:\n\n\n\n\nMy connection to the Harleys is through my Great Grandmother, Margaret Harley who married John Glendinning\n\nWhile all evidence points to my Great Grandmother being a daughter of William and Ann (Bi",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-heather-2",
  "title": "2008-Heather 2",
  "summary": "Email exchange (January 5, 2008) between Heather Wilson and Bonnie Hamilton discussing genealogy research coordination via MSN Messenger. Discussion of Irish records (Coshe Mang volumes), visits to Courtmacsherry and Cork, William Harley family research (mentions author William Harley and his artist descendant Nancy Newton), and plans for collaborative research. Demonstrates the social networks Don helped facilitate among distant cousins discovering shared ancestry.",
  "content_preview": "Morning!  It is very special that we're all connected\n\nonline - Robert mentioned it would be great if we \n\ncould all get together and share our info - I\n\nsuggested that we all meet at a specific time on MSN\n\n-does everyone belong to MSN Messenger Chat?\n\n\n\nOnce we all join up to MSN we could meet - I would\n\nsuggest around 12 noon PST which is around 8:00 p.m.\n\nin the UK.\n\n\n\nHave a great day!\n\n\n\nHeather\n\n\n\n\n\n\n\n--- B J Hamilton < HYPERLINK \"mailto:hamilton3049@rogers.com\" hamilton3049@rogers.com> w",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-irma-family",
  "title": "2008-Irma-Family",
  "summary": "Email (January 5, 2008) from Irma Downing to Don seeking information about a Glendenning family in Chatham (1911 census: William, Ethel, Kenneth, Wyona, Marjorie, Lorne, Jean) and mentioning Glendennings in Big River, Bathurst. Irma is a former teacher (1969-1986, Salmon Beach to Caraquet, taught ESL) and discovers connection: her mother Alda Jane Knowles was named after \"Alda Jane 'Maud' Glendenning\" (Don's aunt), confirming Glendenning-Knowles family connections in the region. Demonstrates Don's role as central researcher fielding inquiries about interconnected New Brunswick families.",
  "content_preview": "From: \"Irma Downing\" <dondown@nbnet.nb.ca>\n\nTo: \"Don Glendenning\" <dglende@pei.sympatico.ca>\n\nSubject: Family\n\nDate: January 5, 2008 1:21 PM\n\n\n\n\n       207 Glendinning William   M Head M Apr 1884 27 1901   \n\n      4    207 Glendinning Ethel   F Wife M Feb 1881 30 1901   \n\n      5    207 Glendinning Kennieth   M Son S Apr 1904 7 1901   \n\n      6    207 Glendinning Wyona   F Daughter S Aug 1905 5 1901   \n\n      7    207 Glendinning Marjorie   F Daughter S Sep 1906 4 1901   \n\n      8    207 Glendin",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-kim-1",
  "title": "2008-Kim-1",
  "summary": "Email from Kim Nielsen forwarding Michael Harley's (Australia) response regarding Harley family genealogy. Michael indicates possession of approximately 14 pages of documentation on William Harley, Ann Bidders (his wife), and John Harley, taken from a book by Elaine Wright (Brantford, Ontario). Shows Don's international genealogical network with Australian cousins and his efforts to access comprehensive family documentation. Demonstrates coordination with multiple researchers and the existence of published Harley family materials that informed his research.",
  "content_preview": "Hi\nDon, this the e-mail I received from Michael Harley in Australia. \nI hope his e-mail address is still active.\n\n \n\nKim\n\n-----\nOriginal Message ----- \n\n\n\nFrom:\nMichael\nHarley\n\n\n\nTo:\nKim\nNielsen\n\n\n\nSent:\nTuesday, September 12, 2006 1:45 AM\n\nSubject:\nRe: Harley family\n\n\n\n\n\n\nHi\nKim,\n\nMany\nthanks for your email,\n\nYes I\nhave quite a bit ( around 14 pages I think) on William Harley, his\nwife Ann Bidders and John Harley, much to much to type out by hand. I\nwill see if I can photo copy it and run it th",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-leblanc",
  "title": "2008-LeBlanc",
  "summary": "Email from Jerry LeBlanc (undated, received Feb 2008) requesting information about William Jubal Watling (b. 1902 Newcastle, m. 1919 Bertha Maud Armstrong in Saint John, d. 1974 Ottawa, Bertha d. 1980 Capital Memorial Gardens, Nepean). Queries whether William and Bertha had children, seeks Malcolm Watling contact (possibly deceased Sept 2006). Indicates Don's genealogical database was referenced for Watling family information and his willingness to share details with researchers. Shows continued inquiries about the Watling line into 2008.",
  "content_preview": "Hi Donald,\n\n\n\nI am currently researching the Little line (William Bell Little came to\n\nQueens County, NB in 1820) and I have a question concerning the Watlings\n\n(not sure if this is part of your line or not).\n\n\n\nWilliam Jubal Watling married Bertha Maud Armstrong in 1919 in Saint John.\n\nWilliam would have been born in 1902 in Newcastle. I believe William and\n\nBertha moved to Ottawa. William died in 1974, Bertha in 1980 (interment -\n\nCapital Memorial Gardens, Nepean, Carleton County, Ontario). I ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-stevens-1",
  "title": "2008 -Stevens-1",
  "summary": "Correspondence from Robert Stevens correcting genealogical information about Christina Nicolina Henry who married William John Stevens (not John Stevens). Includes vital records: Nicoliena Henry born Aug 26, 1839 in Stonehaven, NB, died April 1, 1896 in Portland, Maine from cancer; married William John Stevens August 28, 1856 in New Bandon, NB. Don's note indicates he was updating his genealogical database. Third-party document (from Stevens) providing corrections to Don's records.",
  "content_preview": "You have my family all messed up.\n\n\n\nii. CHRISTINA NICOLINA HENRY1, m. JOHN STEVENS1.\n\n\n\nAs far as I remember, Christina was her nickname. You also spelled her name wrong. Plus, she married William Stevens, not John Stevens. There were two  Nicoliena Henry's from the same parents. The first died as a baby:\n\n\n\n Nicoliena Henry \n\nBirth:      24 May 1824\n\n        New Brunswick     \n\nDeath:      25 Aug 1824\n\n        New Brunswick     \n\n\n\n\n\n\n\n\n\nNicoliena Henry    Compact Disc #19     Pin #343297     ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-twila-1",
  "title": "2008-Twila-1",
  "summary": "Email exchange between Don Glendenning and Twila Buttimer regarding genealogical research about the Harley and Glendenning families. Buttimer assists Don in locating geographic place names and historical references in New Brunswick, particularly regarding Vernon, NB, and the Mary Ann Harley burial site. References a Master of Arts thesis on the Burchill mill (1850-1906) by Burt Glendenning at Concordia University. Shows Don's methodical genealogical research methods and collaboration with other family historians.",
  "content_preview": "Hi\nDon,\n\n \n\nI'm\nstumped, too.\n\n \n\nOur\nNB Gazetteer shows only a Vernon Island in the Parish of Saint George\nin Charlotte County and a Vernons Mountain in the Parish of Simonds\nin Saint John County.  I have also checked Alan Rayburn's work\n\"Geographical Place Names in New Brunswick\" (1975) -\nbecause he often includes place names that are no longer used - but\nno luck.  There is a Mount Venning near the Miramichi River -\nbut that is not Vernon.   Sorry!\n\n \n\nFor\nBurt Glendenning's thesis (it is a Ma",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2008-watling",
  "title": "2008 - watling",
  "summary": "Email correspondence (January 27, 2008) between Don Glendenning and members of the Watling Genealogy Yahoo group. Don inquires about Jubal Watling and Sysan Leach who married November 14, 1814 in Suffolk, England, and their five children who immigrated to New Brunswick. Response from group members (Anne, Elaine) offers baptism records from Brockdish, Norfolk (1790) and marriage information. Demonstrates Don's active participation in genealogical research networks and his efforts to extend family history documentation backward in time.",
  "content_preview": ": watlinggenealogy@yahoogroups.com\n\nSent: Sunday, January 27,\n2008 1:36:42 PM\n\nSubject: Re: [Watling Genealogy Only] Jubal\nWatling\n\n\n\n\n\n\n\n\nHi\nDon, welcome to the Group.\n\nWe\nrecently looked into this and I found a baptism, in Brockdish,\nNorfolk, that might\nbe Jubal. Or not.\n\nBaptism\n6th Jul 1790 J. Watling, son of Samuel Harper Watling & Susanna\n\n   \nAs\nyou can see there is only an initial, but the date seems to fit and\nso far it's the nearest I've come across. A visit to the Record\nOffice might ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2009-01-starter-fund-2",
  "title": "2009-01 Starter Fund -2",
  "summary": "Comprehensive presentation document on Community Builders Fund (January 2009). Lists 40+ existing CFPEI funds including Glendenning Family Fund (suggesting Don's family established a fund). Describes fund characteristics, contribution options, and operational details. Includes CFPEI contact information, board members (including Dr. Don Glendenning), fund management (Phillips, Hager & North), legal advisors (James Travers, Q.C.), and auditors (Arsenault, Best, Cameron, Ellis).",
  "content_preview": "THE\nFOUNDATION\n\nCFPEI\nwas incorporated in 1993 and gathers and administers endowments for\nIslanders and Island organizations.    It is one of 160 such\nfoundations across the country  a focus on the needs of their local\ncommunities.  CFPEI is one of the smaller community foundations with\n40 funds and assets of $1m.  In retrospect, our focus has been\ngenerally people who are now seniors and who may have an interest in\nestablishing a charitable legacy now or in a will..  Arising out of a\nrecent pla",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2009-notes-mum-and-dad",
  "title": "2009-Notes Mum and Dad",
  "summary": "Detailed biographical essay by Don about his father Elmer Alton Glendenning (1875-1938) and mother Jane Elizabeth Jardine Watling (1890-1964). Covers Elmer's early years in Canobie, family values regarding education, Portland cartage and lumber business, dam construction work across North America (Tennessee, Virginia, Connecticut, Texas, Alabama), return to Little Branch farming, pulp business, community involvement (church, Agricultural Society, Masonic Lodge), and final illness. Documents Jane's early life in Portland, her devotion to church and community, hospitality to visitors, food preservation, yarn trading, bread-making, and care of oil lamps. Captures wartime community changes and parents' influence on Don's life.",
  "content_preview": "ELMER ALTON GLENDENNING\n\n\n\n\nElmer was the second child and first son, to Walter and Elizabeth (Peters) Glendenning, was born in Canobie on land that is now a grove of trees directly across the road from the Canobie School, now the Women’s Institute Hall.   \n\n\n\n\nIt is likely that he went to the one room school on a corner of his Uncle’s farm next door since the family seems to have valued education; this is not surprising in that his grandmother was a teacher and lived in the home until Elmer was",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2009-notes-on-siblings",
  "title": "2009 notes on siblings",
  "summary": "Comprehensive family memoir written by Don documenting his parents' siblings: Grace (worked in Boston, married Roy Morrison Smith), Roy, Walter (farmed, worked in Modern Construction, moved to Moncton), Agnes (trained as RNA), Venetia (teacher, Church treasurer, married Cameron Russell), Cameron, Lillian (lived in Boston then married Kenneth Brydone Weeks, recorded early memories), and Brydone (Presbyterian minister, dairy farmer). Contains rich personal anecdotes: Grace's extraordinary eyesight, Walter's hospitality and keen memory, Lillian's 144-page typed memories, family travels to Florida and Europe. Essential autobiographical documentation showing Don's deep engagement with recording family history.",
  "content_preview": "Grace Elizabeth (Glendenning) Smith\n\n\n\n\nGrace was the oldest in the family and was born in Parksville, Tennessee.  Dad and Mum had set up housekeeping there in February 1911 where Dad worked on Ocoee #1, the first of three dams build on the Ocoee River.  Aunt Janet had journeyed to Parksville to be with Mum when Grace was born.  \n\n\n\n\n When Grace was young, Dad and Mum moved from construction site to construction site in the US and, presumably, Grace attended school wherever she was; one school w",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-1a-glendinning-all",
  "title": "2010-1A Glendinning-All",
  "summary": "Comprehensive genealogical compilation authored by Donald E. M. Glendenning (copyright 2010) documenting descendants of John Glendinning. Includes introduction explaining Don's 60+ years of family information gathering, retirement genealogy work, and a database of 6,000 names. Dedicated to Carol, Brian, Janet, and granddaughters Marie, Lisa, Laura. Contains extensive Scottish ancestry research from Dumfriesshire, details on John Glendinning's immigration (1830) from Annan, marriage to Margaret Harley (1833), and explains Don's identity as member of multiple families (Rae, Harley, Bidders, Peters, Sealey, Watling, MacNaughton, MacDonald, Jardine, MacAskill, Jack, Stewart). This document represents the culmination of Don's life work in genealogy and is essential for understanding his values, family connections, and intellectual contributions.",
  "content_preview": "F\namily\nSeries – 1\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nJOHN\nGLENDINNING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nJOHN\n\tGLENDINNING\n\t\n1807-1877\n\t\n\n\n\n\t\n\t\nJohn\n\tGlendinning, 1807-1877, the author’s Great Grandfather, was born\n\tin Callister Hall, Dumfriesshire, Scotland; Callister Hall is still\n\toccupied but not by Glendinnings.  .\n\t\n\n\n\n\t\n\t\nHe\n\tcame to Canada in 1830, ma",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-1b-elmer-jane",
  "title": "2010-1B Elmer&Jane",
  "summary": "Published genealogical volume \"Descendants of Elmer Glendenning & Jane (Watling) Glendenning\" (Family Series 7) by Don, copyright 2010. Mirrors the introduction from File 9 but focuses on his parents' direct descendants. Provides extensive biographical notes on Elmer Alton (1875-1938): Canobie birth, family values on education, Portland business ventures (cartage, lumber, horses), dam construction projects across USA, farming, agricultural society leadership, church activities, pulp business. Detailed account of Jane Elizabeth Jardine Watling (1890-1964): Meadows/Little Branch origins, Portland employment, marriage 1910, community involvement, widowhood 1939, wartime era influence. Emphasizes their nine children and multi-generational family impact.",
  "content_preview": "F\namily\nSeries - 7\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nELMER\nGLENDENNING\n\n&\n\n JANE\n(WATLING) GLENDENNING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nELMER\n\tAND JANE GLENDENNING\n\t\n\n\n\n\t\n\t\nElmer\n\tGlendenning was born in Canobie, New Brunswick, and moved to\n\tPortland, Maine about 1900.  Jane Watling was born in Black River,\n\tNew Brunswick and moved to Portland in January, 1908.  Obvi",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-1c-glendenning-early-generations",
  "title": "2010-1C Glendenning-Early Generations",
  "summary": "Published genealogical volume \"Descendants of John Glendinning\" (Family Series 1B) by Don, copyright 2010, dedicated to Carol, Brian, Janet, Marie, Lisa, and Laura. Comprehensive genealogical reference focusing on Scottish origins and early generations (circa 1755-1877). Includes introduction reiterating genealogical research methodology, Family Bible documentation of John Glendinning's Scottish ancestry, Scots Ancestry Research Society findings (1957), information on siblings Mary Glendinning (Blacklock) and William Glendinning, and detailed genealogical tables spanning generations 1-4 from Scotland through early Canadian settlement.",
  "content_preview": "F\namily\nSeries – 1B\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nJOHN\nGLENDINNING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nJOHN\n\tGLENDINNING\n\t\n1807-1877\n\t\n\n\n\n\t\n\t\nJohn\n\tGlendinning, 1807-1877, the author’s Great Grandfather, was born\n\tin Callister Hall, Dumfriesshire, Scotland; Callister Hall is still\n\toccupied but not by Glendinnings.  .\n\t\n\n\n\n\t\n\t\nHe\n\tcame to Canada in 1830, m",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-1d-glendenning-outline-all",
  "title": "2010-1D Glendenning-Outline-All",
  "summary": "Outline/reference version of Glendinning/Glendenning genealogy spanning generations 1-4 (1755-1890s). Presents simplified genealogical tables showing descendants of John Glendinning (1755-1830) through his children including John, Walter, and William. Lists spouses, birth dates, death dates, and locations. Serves as quick-reference genealogical chart complementing more detailed versions. Reference document for family research rather than biographical content.",
  "content_preview": "Descendants of Glendinning/Glendenning Family\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  GLENDINNING/GLENDENNING1 FAMILY\n\n\t\n\nChild of GLENDINNING/GLENDENNING FAMILY is:\n\n2.\ti.\tJOHN2 GLENDINNING, b. 1755; d. April 14, 1830, Calester Hall, Parish of Middlebie, Dumfriesshire, Scotland.\n\n\n\n\n\n\n\nGeneration No. 2\n\n\n\n\n2.  JOHN2 GLENDINNING (GLENDINNING/GLENDENNING1 FAMILY) was born 1755, and died April 14, 1830 in Calester Hall, Parish of Middlebie, Dumfriesshire, Scotland.\n\n\t\n\nChild of JOHN GLENDINNING is:\n\n3.\ti.",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-2-watling-all",
  "title": "2010-2 Watling-All",
  "summary": "Published genealogical volume \"Descendants of Jubal Watling\" (Family Series 2) by Don Glendenning, copyright 2010, dedicated to Carol, Brian, Janet, Marie, Lisa, and Laura. Focuses on maternal family line through Jane Elizabeth Jardine Watling (Don's mother). Comprehensive genealogical documentation of the Watling family ancestry and descendants, representing the maternal side of Don's genealogical research and family identity as stated in his introduction about carrying genes from multiple families.",
  "content_preview": "F\namily\nSeries - 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nJUBAL\nWATLING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nJUBAL\n\tWATLING\n\t\nAbt\n\t1790-1845\n\t\n\n\n\n\t\n\t\nThe\n\tfirst Jubal Watling encountered was  the author’s Great Great\n\tGrandfather.  There were three Watling ancestors named Jubal; the\n\tfirst, at least the first in my records was born in Brockdish,\n\tNorfolk, Engla",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-2-watling-outline-all",
  "title": "2010-2-Watling-Outline-All",
  "summary": "Simplified outline genealogical reference for the Watling family ancestors and descendants. Serves as quick-reference chart complementing the comprehensive Watling genealogy in File 14. Provides tabular format for navigating family connections through generations. Reference document for genealogical research without extensive biographical narrative.",
  "content_preview": "Descendants of Watling Family\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  WATLING1 FAMILY\n\n\t\n\nChild of WATLING FAMILY is:\n\n2.\ti.\tJUBAL2 WATLING, b. Abt. 1790, Brockdish, Norfolk, England; d. Bet. 1841 - 1848, Probably in Prince Edward Island.\n\n\n\n\n\n\n\nGeneration No. 2\n\n\n\n\n2.  JUBAL2 WATLING (WATLING1 FAMILY) was born Abt. 1790 in Brockdish, Norfolk, England, and died Bet. 1841 - 1848 in Probably in Prince Edward Island.  He married (1) SUSAN SUSANNA LEACH November 10, 1814 in Metfield, Suffolk County, England",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-3-ftm-macdonald-8-gen",
  "title": "2010-3 FTM Macdonald -8 gen",
  "summary": "Genealogical reference document \"Descendants of MacDonald Family\" (Family Series 3) documenting 8 generations of the MacDonald family relevant to Don's ancestry through his maternal grandmother. Traces MacDonald origins to Parish of Assynt, Rosshire, Scotland; documents Alexander MacDonald (who may have emigrated via Cape Breton) and his marriage to Grace MacAskill. Lists MacDonald children including Kenneth, Hugh MacAskill, Anne, Isabella, Margaret, John, Mary, and Jessie, with birth/death dates and marriage information. Alexander died October 31, 1843, in Little Branch, NB, establishing the family's New Brunswick settlement tied to Don's genealogical heritage.",
  "content_preview": "Descendants of MacDonald Family\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  MACDONALD1 FAMILY\n\n\n\n\nNotes for MACDONALD FAMILY:\n\nThe Gaelic spelling of MacDonald, meaning the son of Donald, is Mac Dhomhnuill.  - but there were many Donalds.  The MacDonalds were a very large clan having taken many septs under their wing.  Alexander MacDonald, the first one for which I have a record,  was a native of the Parish of Assynt in Rosshire, Scotland.  That area of northwest Scotland is hilly and rocky with many inlets",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-3-intro-app-macdonald",
  "title": "2010-3 Intro-App  MacDonald",
  "summary": "Introduction and appendices for \"Descendants of Alexander MacDonald\" (Family Series 3) by Don Glendenning, copyright 2010, dedicated to Carol, Brian, Janet, Marie, Lisa, and Laura. Presents full genealogical introduction mirroring methodology described in other family series, with emphasis on Scottish MacDonald family origins and genealogical research approach. This volume documents Don's paternal ancestry through his grandmother's family line, continuing his systematic documentation of all family branches from Scotland through New Brunswick settlement.",
  "content_preview": "Family\nSeries - 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nALEXANDER\nMACDONALD\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tALEXANDER MACDONALD\n\t\n1775-1843\n\t\n\n\n\n\t\n\t\nAlexander\n\tMacDonald was the author’s Great Great Grandfather and was a\n\tnative of the Parish of Assynt in Rosshire, Scotland.  That area of\n\tnorthwest Scotland is hilly and rocky with many inlets and streams\n\twith ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-4-ftm-macnaughton-11-gen",
  "title": "2010-4 FTM MacNaughton-11 gen",
  "summary": "Genealogical reference document \"Descendants of MacNaughton Family\" (Family Series 4) spanning 11 generations, part of Don's comprehensive family documentation. MacNaughton family appears to be significant in Don's family history, likely through maternal connections. The 11-generation scope suggests deep genealogical research spanning from early Scotland through multiple New Brunswick family lines. Continues Don's systematic approach to documenting all family branches contributing to his identity and heritage.",
  "content_preview": "Descendants of MacNaughton Family\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  MACNAUGHTON1 FAMILY\n\n\n\n\nNotes for MACNAUGHTON FAMILY:\n\n\n\n\n\n\n\nThe first in line is John MacNauchtan, thought to have been born at Dunderave Castle, Scotland and died (before 1750) at Glenlyon, Perthshire, Scotland.  His son, Malcolm was also thought to have been born at Dunderave Castle and died at Glenlyon, Perthshire, Scotland. Following the publication of this information in Family Chronicle No. 28, however, I received the follo",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-4-intro-app-macnaughton",
  "title": "2010-4 Intro-App  MacNaughton",
  "summary": "Introduction and appendices for \"Descendants of John Macnaughtan\" (Family Series 4) by Don Glendenning, copyright 2010, dedicated to Carol, Brian, Janet, Marie, Lisa, and Laura. Represents the final major family genealogy series in Don's comprehensive documentation project. MacNaughton family line represents another significant ancestral branch within Don's complex family heritage, as mentioned in his introduction about carrying genes from multiple families including MacNaughton on the maternal side.",
  "content_preview": "Family\nSeries - 4\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nJOHN\nMACNAUGHTAN\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nJOHN\n\t MACNAUGHTAN\n\t\n1\n\t\n\n\n\n\t\n\t\nThe\n\tfirst of the line was John MacNauchtan who died before 1750 at\n\tGlenlyon, Perthshire, Scotland.  The next two generations, son,\n\tMalcolm and Grandson, John also lived and died in Glenlyon,\n\tPerthshire,\n\t\n\n\n\n\t\n\t\nMalc",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-5-intro-app-harley",
  "title": "2010-5 Intro-App Harley",
  "summary": "Don's 2010 genealogy monograph introducing descendants of William Harley with 60+ years of family research. Explains his motivation for compiling and sharing family records from multiple ancestral lines including Harley, Peters, and Watling families.",
  "content_preview": "Family\nSeries - 5\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nWILLIAM\nHARLEY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nWILLIAM\n\tHARLEY\n\t\n1750-1830\n\t\n\n\n\n\t\n\t\nWilliam\n\tHarley, the authors Great Great Grandfather  was a school master in\n\tCourtmacsherry near Cork, County Cork, Ireland.  The Harleys were\n\tPresbyterian and apparently quite active in their church.  William\n\tmarr",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-6-ftm-peters-7-gen",
  "title": "2010-6 FTM Peters 7 Gen",
  "summary": "Don's comprehensive genealogical report on Peters family descendants spanning seven generations, documenting his Scottish and Irish ancestral connections. Technical genealogical work reflecting decades of family research.",
  "content_preview": "Descendants of Peters Family\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  PETERS1 FAMILY\n\n\n\n\nNotes for PETERS FAMILY:\n\nMy grandmother, Elizabeth Peters, married Walter Glendenning.  Settlers of the Bay of Chaleur says that the Peters came from Ireland, however, my search shows also shows Peters meaning \"Peter- a rock\", is not uncommon in the  Angus, Kincardine and Aberdeen areas of Scotland.   The name John Peter is found in 1636, Andro Peter in Kirkcaldie in 1840, David Peter in Peebles, southern Scotland, ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-6-intro-app-peters",
  "title": "2010-6-Intro-App Peters",
  "summary": "Don's 2010 introduction to Peters family genealogy, explaining his comprehensive 60+ year approach to family history research and database compilation. Reflects his commitment to documenting ancestors across multiple family lines.",
  "content_preview": "Family\nSeries - 6\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nJOHN\nPETERS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nJOHN\n\tPETERS\n\t\n1817-1904\n\t\n\n\n\n\t\n\t\n\n\tJohn Peters, the author’s\n\tGreat Grandfather, is thought to have come to Canobie, New Brunswick\n\tfrom County Cork in Ireland, but Peters is also a Scottish name as\n\twell as the Anglicized name of Petrie.  The Peters lived",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-7-elmer-and-jane",
  "title": "2010-7 Elmer and Jane",
  "summary": "Don's 2010 genealogy documenting descendants of his parents Elmer Glendenning and Jane Watling. Includes family dedication and introduction explaining his life-long genealogical research methodology and family value systems.",
  "content_preview": "Family\nSeries - 7\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nELMER\nGLENDENNING\n\n&\n\n JANE\n(WATLING) GLENDENNING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nELMER\n\tAND JANE GLENDENNING\n\t\n\n\n\n\t\n\t\nElmer\n\tGlendenning was born in Canobie, New Brunswick, and moved to\n\tPortland, Maine about 1900.  Jane Watling was born in Black River,\n\tNew Brunswick and moved to Portland in Januar",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-7-ftm-elmer-jane",
  "title": "2010-7 FTM Elmer&Jane",
  "summary": "Don's comprehensive genealogical report on Elmer Alton Glendenning and Jane Elizabeth Watling descendants with biographical details and family history. Technical genealogy documenting his direct family line from Scottish origins through New Brunswick settlement.",
  "content_preview": "Descendants of Elmer Alton Glendenning\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  ELMER ALTON6 GLENDENNING  (WALTER5, JOHN4 GLENDINNING, JOHN3, JOHN2, GLENDINNING/GLENDENNING1 FAMILY)1 was born June 29, 1875 in Canobie, NB1, and died May 18, 1938 in Black River Bridge, NB1.  He married JANE ELIZABETH JARDINE WATLING1 October 18, 1910 in Bride's home, Little Branch, Black River, New Brunswick1, daughter of JUBAL WATLING and GRACE MACDONALD.  She was born February 28, 1890 in Upper Black River, NB1, and died",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-author",
  "title": "2010 Author",
  "summary": "Professional biographical profile of Don Glendenning, authored by Don himself. Summarizes his career: born and raised in Little Branch; education at Teachers' College, New Brunswick Institute of Technology; teaching at Kouchibouguac and Miramichi Rural High School; principal role; training specialist with Federal government; President of Holland College (1969-1987, though not explicitly stated in this excerpt); education: Bradley University (BSc, MSc), University of London, Indiana University (PhD). Notes involvement with Community Foundation of PEI, genealogy research, gardening, and publishing \"Family Chronicle\" newsletter. Mentions wife Carol Chesney (from Peoria, Illinois) and two children (Brian and Janet) with two grandchildren.",
  "content_preview": "ABOUT THE AUTHOR\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon Glendenning was born and raised in Little Branch, Black River, New Brunswick..  He attended the Little Branch School, a one-room school serving the district, and is a graduate of the Miramichi Rural High School, the first of a series of rural high schools established in New Brunswick prior to WW2.  \n\n\n\n\nAfter his studies at Teachers’ College and the New Brunswick Institute of Technology (now the New Brunswick Community College) he taught first in a one-room scho",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2010-introductory-pages",
  "title": "2010-Introductory pages",
  "summary": "Don's genealogical introduction spanning Scottish ancestors John Glendinning (1807-1877) through his own generation, documenting ancestral lineage from Dumfriesshire Scotland to Black River New Brunswick. Foundation document for family history research.",
  "content_preview": "JOHN\n\tGLENDINNING\n\t\n1807-1877\n\t\n\n\n\n\t\n\t\nJohn\n\tGlendinning, 1807-1877, the author’s Great Grandfather, was born\n\tin Callister Hall, Dumfriesshire, Scotland; Callister Hall is still\n\toccupied but not by Glendinnings.  .\n\t\n\n\n\n\t\n\t\nHe\n\tcame to Canada in 1830, married Margaret Harley, who came to New\n\tBrunswick for Ireland,  in 1833 and settled on a piece of property\n\tat Salmon Beach on the Baie de Chaleur.  John farmed and Margaret\n\ttaught school.  The family later relocated to Canobie.  John and\n\tMar",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2011-letter",
  "title": "2011 Letter",
  "summary": "Personal Christmas letter written by Don in 2011 recounting the year's highlights. Mentions Christmas cruise (end of 2010), Carol's hip replacement (April), family visits from Brian, Janet, and granddaughters Laura and Lisa. Describes Don's 78-acre woodland property with brook as his \"hide-away.\" Notes completion of Holland College Recollections (unpublished but available on Glendenning website). Family scattered across US and Canada: Janet and Mike in Ottawa, Laura in Maryland, Lisa in Seattle with Kevin, Brian and Marie improving knowledge of the universe at NRAO. Don continues gardening and volunteer work.",
  "content_preview": "Christmas\nGreetings from the Island\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tA Winter Road on PEI \n\t\n\t\n\n\tCirca 2008\n\t\n\n\t\n\n\n\t\n\t\n\n\tGreetings\n\tfrom PEI:\n\t\n\n\t\n\n\n\t\n\t\n\n\tAs I write, I am looking into\n\tour back yard and thinking “What a beautiful morning”. The sun\n\tis shining, temperature about five degrees and hardly a cloud in the\n\tsky.  Shortly, I will head to the country for a walk in the woods.\n\t\n\n\t\n\n\n\t\n\t\n\n\tJust prior to taking my seat\n\tin front of the computer, however, I sat by the fire and re-lived\n\tmemories while rea",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2011-nov-list-of-publications",
  "title": "2011-Nov list of Publications",
  "summary": "Don's 2011 complete list of local history and genealogy publications including Glendenning Roots, Carol Louise Chesney Glendenning background, Family Chronicles volumes, The Neighbourhood, Presbyterians in Black River, and family genealogy reports. Comprehensive publishing record.",
  "content_preview": "LOCAL HISTORY PUBLICATIONS\n\nby \n\nDon Glendenning\n\nPublications:\n\n\n\n\n1\tGlendenning Roots - Background and photos on the life and times of Elmer and Jane (Watling) Glendenning with a focus on their years in the USA.  It also lists ancestors for each as well as their descendants.  (Approximately 200 pages bound.)\n\n\n\n\nCarol Louise (Chesney) Glendenning - Background information and photos of Carol Chesney, her family and friends in Illinois.  (Approximately 100 pp bound)\n\n\n\n\nFamily Chronicles; Volume",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2011",
  "title": "2011",
  "summary": "A 2011 Foundation brochure covering governance, achievements, and complete portfolio fund listings including the Glendenning Family Fund. Reiterates the organization's commitment to perpetuity-based charitable giving and transparent stewardship of community resources.",
  "content_preview": "THE FOUNDATION\n\n\n\n\n\n\n\nThe Community Foundation of PEI is a volunteer driven, registered, non-profit, charitable organization. Our mission is to improve quality of life on PEI through the creation and building of endowment funds that will help ensure vital futures for Island communities.\n\n\n\n\nThe Community Foundation of PEI provides an established means for individuals, families, community groups, corporations, and private foundations to support philanthropic activities which invest in sustainable",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2012-black-river-anniversary-2",
  "title": "2012-Black River Anniversary-2",
  "summary": "Speaking notes by Don Glendenning for 200th anniversary of Black River lot grants (June 2, 2012). Traces early settlement patterns from First Nations through Scottish immigration, American Revolution Loyalists, and clan disruptions—demonstrates his deep knowledge of regional history and family roots.",
  "content_preview": "Notes\n\n\n\n\n200th\nAnniversary\n\n\nGranting\nof Lots along the Black River\n\n\nJune\n2, 2012\n\n\n\n\n\n\nA\nOpening comments\n\n\t\n\n\n\tDelighted\n\tto be here\n\t\n\n\n\tCommend\n\tthe planners\n\t\n\n\n\tProud\n\tof my roots\n\t\n\n\n\tImportant\n\tto be aware of our roots\n\t\n\n\n\tHonour\n\tour forebears\n\t\n\n\n\tNot\n\tan historian but have an interest\n\t\n\n\n\tBelieve\n\twhat I tell you to be true, but always open to new information\n\t\n\n\n\tA\n\tW MacDougall\n\t\n\n\n\tErnie\n\tMacLean, \n\t\n\t\n\n\n\tPassport-Little\n\tBranch\n\n\n\n\n\n\n\nB\nWho were our early settlers?\n\n\n\n\n\n\n\t\n\n\n\t",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2012-reunion-elmer-and-jane-minor-edit-2018",
  "title": "2012-Reunion-Elmer and Jane (Minor edit 2018}",
  "summary": "Comprehensive biography of Don's parents Elmer Alton Glendenning (1875-1938) and Jane Elizabeth Jardine Watling (1890-1964), tracing their families from New Brunswick/England origins through their careers in hydroelectric dam construction and domestic life. Extensively documents family migrations to Portland Maine, Tennessee, and other locations, providing essential genealogical and family history context.",
  "content_preview": "Elmer\nand Jane \n\n\nGlendenning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrepared\nby\n\n\nDon\nGlendenning\n\n\nfor\n\n\nGlendenning\nFamily Reunion\n\n\nJuly\n27-29, 2012\n\n\nMinor\nedit 2018\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nELMER\nALTON GLENDENNING\n\n\n1875-1938\n\n\n\n\n\n\n\n\nElmer\nwas the second child and first son of Walter and Elizabeth (Peters)\nGlendenning.  He was born in Canobie on land\nthat is now a grove of trees directly across the road from the\nCanobie School, now the Women’s Institute Hall.   \n\n\n\n\n\n\n\n\n\nI",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2013-addresses-2",
  "title": "2013 Addresses-2",
  "summary": "A comprehensive contact list dated June 17, 2013, documenting descendants of Elmer and Jane (Watling) Glendenning organized by generation. Lists first, second, and third generation family members across Atlantic Canada and the USA with addresses. Don appears as a primary maintainer of this genealogical data, reflecting his role as family historian and keeper of records for his extended Glendenning clan.",
  "content_preview": "June 17, 2013\n\nDescendants of Elmer and Jane (Watling) Glendenning\n\n\n\n\n FIREST GENERATION\n\n\n\n\n Ken Glendenning\n\n 475 North Napan Road\n\n Napan, NB       E1N 4W9\n\n\n\n\n\n\n\n Norman & Jean Glendenning\n\nBlack River Bridge, \n\nNB\tEiN 5N3\n\n\n\n\nDon and Carol Glendenning\n\n62 Queen Elizabeth Drive\n\nCharlottetown, PE C1A 3A9\n\n\n\n\nSECOND GENERATION\n\n   \n\n Barbara Coppla\n\n 30 Claremont St.\n\n Malden, \n\n Mass.  02148-4604 USA\n\n\n\n\nStephen & Carolyn Glendenning\n\n8021 Rte. 117\n\nBlack River Bridge\n\nNB\tE1N 5K7\n\n\n\n\nLillia",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2014-advisory-committee-2014-12-03t13-56-57",
  "title": "2014 Advisory committee@2014-12-03T13;56;57",
  "summary": "Documentation of the Glendenning Fund Advisory Committee established to oversee an endowment created by the Glendenning family with the Community Foundation of PEI for supporting community development projects in Black River Bridge, New Brunswick. This reflects Don's dedication to giving back to his ancestral community through charitable giving.",
  "content_preview": "GLENDENNING FUND \n\nAdvisory Committee\n\n\n\n\nIn the year 2000, the Glendenning Family established an endowment with the Community Foundation of Prince Edward Island for the purpose of providing financial support for projects that contribute to the quality of life of residents of Black River Bridge, Northumberland County, New Brunswick. \n\nAn Advisory committee has been struck to implement the wishes of the family as to the nature of activities and projects to be supported.  Advisory Committee member",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2014-amended-2-agreement-2014-12-03t14-00-14",
  "title": "2014 Amended 2  Agreement@2014-12-03T14;00;14",
  "summary": "Amendment to the Glendenning Family Fund agreement establishing a permanent endowment for Black River Bridge, Northumberland County, New Brunswick. Documents the fund's origins in a 2000 family reunion discussion and honors Don's parents, Elmer and Jane (Watling) Glendenning, who purchased the Little Branch property in 1914. Establishes advisory committee with Lois Anne Gregan as chair and reflects Don's commitment to supporting his community of origin.",
  "content_preview": "COMMUNITY\nFOUNDATION OF PRINCE EDWARD ISLAND\n\n\n119-121\nQueen St., Charlottetown,\n\n\nPrince\nEdward Island, C1A 4B3\n\n\n\n\n\n\n\n\nPhone:\n902-892-3440   Fax: 902-892-0880   Email: cfpei@pei.aibn.com\n\n\nCharitable\nRegistration: Canada-890011190 RR0001; USA- 30-0050801\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAgreement to Amend the Glendenning\nFamily Fund Agreement\n\n\n\n\n\n\n\n\nThis\nAmendment Agreement made this      day of August, 2014.\n\n\n\n\n\n\n\n\nBETWEEN:\n\n\nThe\nCommunity Foundation of Prince Edward Island (referred to as “The\nFoundation”); ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2014-letter",
  "title": "2014-Letter-",
  "summary": "2014 Christmas letter detailing year of health, mobility, and independence. Don describes annual foray into PEI wilds to cut spindly balsam fir Christmas tree. Notes Charlottetown received record 20-25 cm snow. Don and Carol grateful for good health, Carol with bridge and book club, Don with vegetable garden and letters to editor/coffee group meetings. Mentions they didn't leave PEI over winter (Carol had medicine change, insurance concerns). May trip to Pennsylvania. Cottage summer highlighted by family visits. Family photo from 2012 at cottage flagpole: Don, Carol, Brian, Mike, Janet (Marie photographer). Granddaughters Lisa/Kevin in Seattle, Laura in Columbia Maryland. Brian and Marie home August, Janet early September (first visit since seeing granddaughters). Home renovations: painted house, added room, stained cottage, replaced fridge, wall oven repair. Brian and Janet recently returned from 3-week India sojourn. Note: file shows text corruption with embedded formatting.",
  "content_preview": "Christmas\nGreetings\n\n\n from\nthe Glendennings\n\n\nChristmas\n2014\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tHome\n\t\n\n\t\n\n\n\t\n\t\n\n\tDear  \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tAs is our custom, we start\n\teach Christmas season with a review of last year’s cards and,\n\twhile doing so, reminisce about good friends and good times of\n\tyesteryear.  Each year brings changes to the list but the new\n\tabsences, and there are  several, do not dull the memory of our\n\tfriendships. \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe Christmas season was\n\tofficially marked a few days ago ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2014-notes-to-committee-2014",
  "title": "2014 Notes to Committee 2014",
  "summary": "Dated December 3, 2014, from Don to Amanda, Donna, and LoisAnne. Fund market value reached $20,200 (original contributions $14,000+; remainder from investment returns). Provides copies of original agreement and amendment. Explains committee's role and Community Foundation's investment track record. Notes annual payout is typically 4% ($800 in 2014), but practice has been to spend less to promote growth (now committee's decision). Requests signed amendment returns to Foundation. Demonstrates Don's personal mentorship of committee members and his satisfaction with results.",
  "content_preview": "December 3, 2014\n\n\n\n\nTo:\tAmanda\n\n\tDonna\n\n\tLoisAnne\n\nGlendenning Fund\n\n\n\n\nTrust all is well and that the recent storm was not too unkind.\n\n\n\n\nWe spoke some time ago about the Glendenning Fund; it was established shortly after our 2000 Family reunion; our original target was $5,000 and, if we were lucky, perhaps $10,000.  I phoned a few minutes ago and was told that the market value of the fund today is $20.200; the actual contributions were a bit over 14,000 – the remainder resulted from returns ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2015-christmas-letter-2015-12-08t18-23-18",
  "title": "2015-Christmas Letter-@2015-12-08T18;23;18",
  "summary": "A heartfelt Christmas letter from Don and Carol reflecting on their year at age 86, including travel to Cuba and Victoria BC, summer cottage life, family visits including grandchildren, and continued good health and community involvement. The letter reveals Don's appreciation for family, travel, gardening, and maintaining deep connections across a lifetime.",
  "content_preview": "Christmas\nGreetings\n\n\n from\nthe Glendennings\n\n\nChristmas\n2015\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tCuba 2015\n\t\n\n\t\n\n\n\t\n\t\n\n\tDear  \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tTime to reminisce and write a\n\tChristmas note to family and friends.  \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tWe’ve had another good\n\tyear.  We are still together, able to live in our own home, have\n\treasonably good health and drive ourselves to most places – except\n\tafter dark. Yes, we have our share of aches and pains, newspaper\n\tprint is smaller than it once was, messages travel a bit",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2018-family-publications",
  "title": "2018-Family Publications",
  "summary": "Inventory by Don Glendenning of his genealogical publications: Glendenning Roots, Family Chronicles (200 newsletters), The Neighbourhood, and biographies of ancestors including John Glendinning and Jubal Watling. Demonstrates lifetime commitment to documenting family history and local heritage.",
  "content_preview": "GENEALOGY AND LOCAL HISTORY\n\nBy \n\nDon Glendenning\n\n\n\n\n1\tGlendenning Roots - Background and photos on the life and times of Elmer and Jane (Watling) Glendenning with a focus on their years in the USA.  It also lists ancestors for each as well as their descendants.  (Approximately 200 pages bound.)\n\n\n\n\nCarol Louise (Chesney) Glendenning - Background information and photos of Carol Chesney, her family and friends in Illinois.  (Approximately 100 pp)\n\n\n\n\nFamily Chronicles; Volumes 1 and 2 - An infor",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "2022-christmas-letter",
  "title": "2022 Christmas letter",
  "summary": "Don's 2022 Christmas letter reflecting on nostalgia for his mother and the importance of Christmas in his family's history. He recalls his parents' moves through Wisconsin, Texas, Alabama, Tennessee, New Hampshire, Connecticut, Maine during their early married years. Don reports having a light case of COVID while Carol remained unaffected. He recounts Brian's retirement and new travels (including Egypt and Jordan), Janet's visits to Washington and Middle East, and family time at the Orwell Bay cottage. Don mentions PEI's September hurricane, which left them without electricity for seven days and damaged trees on their property. He remains engaged with retired friends' coffees, education work, and family tree projects. Handwritten by Don.",
  "content_preview": "Christmas Greetings\n\n from Carol and Don\n\nChristmas 2022\n\n_____________________________________________________________________________________________\n\n.GREETINGS ACROSS THE MILES:\n\n\n\n\n‘Tis that time of year again. \n\n\n\n\nWe are looking forward to Christmas 2022. Beautiful fall weather, long evenings, occasionally a lighted fireplace and great memories of family and friends. What a great time of year.\n\n\n\n\n I also think of my Mother and how she treasured this time of year and the Christmas cards a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "26",
  "title": "26",
  "summary": "\"The Family Chronicle\" No. 26, July 9, 2002, written by Don Glendenning. Focuses on Watling family roots with sections on: the origin of the Watling name (from Sussex, England; possible Viking/Norman connections); three generations of Jubal Watlings (the first born in Suffolk, married Susan Leach in 1814; Jubal II born 1823, came to Black River ca. 1850, married Christina MacNaughton, died 1900; Jubal III born 1846, married Grace MacDonald); the Leech/Leitch family; Captain George Watling the \"pious pirate\" of the Bahamas; and James Fowlie (1829-1923), a Presbyterian minister and science professor. Contains genealogical detail on Don's direct ancestors and their migrations from England to Canada.",
  "content_preview": "The Family Chronicle\n\nNo.26\t\t\t\t\t\t\t\t\t\t    July 9, 2002\n\n                                                                                                                                  __________\n\nMy search for Watling roots has been less extensive than that on the Glendenning side, nevertheless, I will record what I have and add as time and energy permit.  Some time ago, Edith (MacKenzie) Schickle gave me a copy of information given to her by Ernie Watling.  Much of the information which follow",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "29",
  "title": "29",
  "summary": "\"The Family Chronicle\" No. 29, October 17, 2002, written by Don Glendenning. Opens with a touching poem titled \"Mothers\" signed \"JWG Oct. 1934\" (Don's mother, Jane Watling Glendenning), which was rediscovered at a family reunion through Ruth Lewis. Includes genealogical corrections about Watling roots using census and land petition records, documenting Jubal Watling Sr.'s 1814 marriage and migration to Black River via Cape Breton; mentions visits to Wausau, Wisconsin (where Don's father worked in 1910) and a book called \"Glendinning\" by Pamela Ferguson about a rum runner. Showcases Don's role preserving family poetry and documenting family movements.",
  "content_preview": "The Family Chronicle\n\nNo.29\t\t\t\t\t\t\t\t\t\t    October 17, 2002\n\n                                                                                                                                  __________\n\n\n\n\n\n\nMOTHERS\n\n\n\n\nThe lamp is lit in the window\n\nAnd back of it is her chair\n\nAnd as I look across, it seems\n\nShe surely must be there.\n\n\n\n\nI picture too her little room\n\nSo very neat and snug\n\nHer very fingers made it so\n\nOh yes, the braided rug.\n\n\n\n\nThe cushion on her rocking chair,\n\nThe quilt upo",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "3-introduction",
  "title": "3-Introduction",
  "summary": "Don's introduction to \"Glendenning Family Memories\" (June 16, 2005) explaining the genesis and scope of his genealogical research. Describes early fascination with Black River family relationships (late 1940s), expansion from Glendenning roots to include Peters, Sealey, Harley, Bidders, Beattie, Rae, MacDonald, Watling, MacAskill, MacNaughton, Leach, and Jardine ancestry. Details research methods: family Bible, surveys, census data, newspapers, church/cemetery records, internet searches, family interviews. References ~4,000 names in database, extensive photo collections from mother Jane and sister Venetia. Acknowledges siblings' contributions and thanks family/friends. Emphasizes incompleteness of genealogical work and invites reader participation. Reveals Don's scholarly approach and collaborative philosophy. Crucial for understanding his intellectual motivation and methodology.",
  "content_preview": "INTRODUCTION\n\n\n\n\n\n\n\nMy father and mother came from large and close families; visits and visitors were frequent and family ties were emphasized and strong.  At an early age, I became intrigued by the number of neighbours along the length of the Black River to whom I was related.  By the late 1940’s I began gathering information about my ancestors.  \n\n\n\n\nInformation was drawn from many sources with the Glendenning Family Bible in my Mother’s possession being my entry point into the field.  Shortly",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "35",
  "title": "35",
  "summary": "Family Chronicle (No. 35, February 28, 2003) featuring reader follow-ups and nostalgic recollections. Confirms the family card game \"Flinch\" originated with his sister Grace. Clarifies \"Ken's Hill\" geography near Little Branch School—identifies Ken MacDonald property and Weldon MacDonald's bungalow. Includes an anecdote about classmate Ken's comment on \"slipgut\" porridge in health class, and stories about John's 1939-42 Ford truck service transporting community members to town, including a skunk strike and a recovered set of false teeth. Recounts Don's first dance (summer 1946) with Norma Williston at Black River Hall, followed by frequent dances 2-3 times weekly. Includes portrait of Jim Finno (a blind neighbor with prized transparent apples) and a failed theft attempt that resulted in Don's sprained ankle. Captures small-town social life and youthful adventures.",
  "content_preview": "The Family Chronicle\n\nNo.35\t\t\t\t\t\t\t\t\t\t   February 28, 2003\n\n                                                                                                                                 ________________Follow-up\n\n\n\n\nDonna (Russell) Goodfellow confirms that their flinch Game came from my sister, Grace.  I must now conclude that Flinch was a game unique to our family.  Parker Brothers still sells the game; I bought two games yesterday.\n\n\n\n\nDorothy (MacKay) Lind wondered about Ken’s Hill.  As one",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "39",
  "title": "39",
  "summary": "Family Chronicle (No. 39, April 26, 2003) including undated photo of Don's father Elmer and his lumber crew (assumed USA-based). Features reader follow-ups: Donald Edge's memory of grandfather's sawmill and pitch-covered hands; Earl Taylor's similar experience at Fowlie's mill; Shirley MacKay's story of being flipped off a load of logs under a clothesline into a snowbank; and corrections about Uncle George's locations (Tennessee, Virginia/Hampton, New Hampshire). Introduces \"The Woodcutter\" section describing family wood-cutting operations—seasonal harvesting of furnace and firewood, use of horse-drawn bobsleds, specialized equipment (circular saw, engine-driven), and community labor exchanges. Illustrates the interconnected rural economy and Don's deep knowledge of traditional farm operations.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.39\t\t\t\t\t\t\t\t\t\t\n        April 26, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nHere\n\tis another photo of men heading for, of in the woods, in the USA.  I\n\tdo not have a date or location but assume it is my father and his\n\tcrew.\n\n\n\n\tFollow-up\n\t\n\n\n\n\t\n\t\nThe woods\n\tstory brought back remem- brances to Donald Edge and Shirley MacKay.\n\t Donald remembered worki",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "4-a-chronology",
  "title": "4-A Chronology",
  "summary": "A master chronology spanning 1772–1964 documenting births, deaths, and marriages of Don's ancestors across five generations. Lists key family events including arrival of Great Grandfather John Glendinning from Scotland in 1830, settlement at Canobie and Salmon Beach, emigration to USA (Portland, Maine; Tennessee; Wisconsin), and return to Little Branch, New Brunswick. Notable: Don's birth September 8, 1929 at Little Branch; parents' deaths in 1938 (father) and 1964 (mother). Compiled by Don Glendenning in June 2005.",
  "content_preview": "A FAMILY CHRONOLOGY\n\n\n\n\n\n\n\nDate\t\t\tEvent\n\n\n\n\nJanuary 29,\t1772\tBirth of John Glendinning, Great Great Grandfather, in Scotland\n\nOctober 20,\t1803\tBirth of Margaret Harley, Great Grandmother  \n\nApril 2,\t1907\tBirth of John Glendinning, Great Grandfather, at Callister Hall, Scotland\n\n\n\n\nJanuary 21   1821\tBirth of Jubal Watling, Great Grandfather in Syleham, Suffolk, England\n\nOctober 23, \t1821\tBirth of John Peters, Great Grandfather,in Ireland\n\nDecember 241821\tBirth of Jane Sealey, Great Grandmother, i",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "40",
  "title": "40",
  "summary": "Family Chronicle (No. 40, May 10, 2003) providing research resources for Crown Land history in New Brunswick (Crown Land Grant Index, maps, Geographical Names reference). Includes genealogical follow-up correcting a photo identifier (Norman Ferguson, grandson of Cynthia Finno and Hector Ferguson—Don's second cousin). Supplies revised list of 13 teachers at Little Branch School (1920s-1950s), noting lapses in documentation. Recalls coasting accident with Fraser MacKay (sled riding over birch tree, tumbling to shore ice), trout fishing techniques using alder rods and worms from the wharf and bridge, anecdote about Major Ramsay (tetchy NB Tel employee), and Billy Harper as skilled fisherman mentor. Mentions white string fishing line soaked in strong tea to reduce visibility, and an experimental fish net strung across the river (catching one gasperaux). Demonstrates Don's capacity for both archival scholarship and vivid sensory memoir.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.40\t\t\t\t\t\t\t\t\t\t\n             May 10, 2003\n\n                                               \n                                                                     \n           ________________\n\n\n\tFollow-up\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nUndated\n\tphoto of a woodcutter and typical woodpile at my home.  Sometimes we\n\thad a larger pile and more large logs.  \n\t\n\t\n\n\n\n\t\n\t\nSome\n\tsources of information:\n\t\n\n\n\n\t\n\t\n\t\t\n\nCrown\n\t\tLand Grant Index published by the Minister of Natural Resources and\n\t\tEner",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "4a-a-chronology",
  "title": "4A-A Chronology",
  "summary": "Don's Family Chronicle Issue #7 documenting chronology of parents' lives from 1875–1916, including courtship, marriage, employment in US construction (dam work in Tennessee), and return to Little Branch. Rich detail on early 20th-century family life and work migrations.",
  "content_preview": "The Family Chronicle\n\nNo.7\t\t\t\t\t\t\t\t\t           1999 08 08\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIssue Number\n\n\n\n\nThe last issue, No. 8 was mis-numbered; The next one, whenever that is, will be No. 9.\n\n\n\n\nMum and Dad\n\n\n\n\nAs reported in the last Newsletter, Mum and Dad operated the Post Office at Little Branch from 1914 to 1916.  Because of this new information, I decided to review some of their early dates. \n\n\n\n\nJune 29 1875\tDad was born presumably in Canobie, NB\n\nFeb. 28 1890\tMum was born presumably in Upper Black Rive",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "5-little-branch",
  "title": "5 Little Branch",
  "summary": "A 1929 account of Little Branch School, where Don was born that same year (September 8, 1929). The school was erected around 1850 in District 71/2, Parish of Glenelg, serving students from the Branch Road area with 50 students during 1933-34. This document directly connects to Don's birthplace and childhood community, representing both personal and regional history research.",
  "content_preview": "Little Branch – 1929\n\n\n\n\n\n\n\nLittle\nBranch School\n\n\n\n\n\n\nThe\nLittle Branch School sits at the junction of Route 117 and the Little\nBranch Road (formerly the MacKenzie Road).  A. W. MacDougall in his\nbook, Black River and\nits First Settlers,\ntells us that the first school was erected about 1850; it burned\nshortly thereafter but was soon replaced.   The Little Branch School\nwas in District 71/2 in the Parish of Glenelg Parish in\nNorthumberland County.  An out door toilet, with separate doors for\nboy",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "59",
  "title": "59",
  "summary": "\"The Family Chronicle\" No. 59, January 23, 2004, written by Don Glendenning. Contains photographs of his great-great-grandparents Alexander MacDonald (b. 1775, Assynt, Scotland; d. 1843 at Little Branch) and Grace MacAskill (b. 1781, d. 1874); their son John D. MacDonald (1817–1900) and his wife Elspeth Jardine (1821–1907); and John's daughter Grace (Don's grandmother, 1848–1934) who married Jubal Watling. Includes memories of his small, wiry grandmother and anecdotes: George Dutcher's sloven, a WWII fruit truck accident on Johnny Dick's hill, Jack MacMaster's apple truck breaking through a bridge, correspondence with Robert Stevens about the Peters/Harley connection, and childhood stories from Marjorie (Watling) Young about crossing the Little Branch Bridge. References his new website at www.glendenning.net.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.59\t\t\t\t\t\t\t\t\n                        January 23,2004\n\n                                               \n                                                           \n________________\n\n\n\n\n\n\n\n\t     \n\t\n\n\t\n\n\n\n\t\n\t\n    \n\t\n\n\t\t\n\t\n\n\n\n\t\n\t\n    \n\t\n\n\t\nPhotos\n\t\n\n\n\n\t\n\t\nI\n\tam grateful to Cameron MacDonald for copies of the photos appearing\n\ton the left.  We are not certain, but they may be my GGGrandparents,\n\tAlexander and Grace (McAskill) MacDonald, their son, John and his\n\twife, Elspeth Jar",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "6-glendenning-roots",
  "title": "6-Glendenning Roots",
  "summary": "Comprehensive genealogical research by Don tracing Glendenning family origins to Dumfriesshire, Scotland (first documented 1286) and settlement in Canobie, New Brunswick. Includes extensive research on ancestral surnames (Beattie, Rae, Harley, Peters, Jardine, MacNaughton), with detailed histories and Scottish place origins. Features a remarkable first-person account by his great-great-grandmother Mary Ann Harley (born 1799 in Ireland) describing her 1822 passage to Canada and 75-mile trek through wilderness to Newcastle. Includes Don's 1989 visit to Callister Hall (Scotland, birthplace of John Glendinning, 1807) and detailed land grant documentation. Major genealogical work authored by Don showing meticulous scholarship and personal research travels.",
  "content_preview": "Glendenning\n\tFamily Memories\n\n\tGLENDENNING\nROOTS   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Canadian roots of my paternal ancestors are in\nan area north east of Bathurst, more precisely, the inland community\nof Canobie.  Travelling east from Bathurst along the coast towards\nCaraquet, one finds a number of communities familiar to the\nGlendenning family.  Most relevant are the following as described in\nthe Geographical Names of New Brunswick, 1875:\n\n\n\n\n\n\n\t\n\nBathurst,\n\toriginally named St. Peters in 1671, was named f",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "7-watling-roots",
  "title": "7-Watling Roots",
  "summary": "Comprehensive genealogical research by Don on Watling family ancestry and settlements in Black River, New Brunswick. Covers European origins, American Revolution context, and integration into Maritime communities—extensive foundational family history work.",
  "content_preview": "25\n\tGlendenning Family Memories\n\t\n\nWATLING\nROOTS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo the extent\nknown, this section deals with actual ancestral families and their\nlocations.  The nature and extent of information for each family or\nlocation varies, reflecting the extent of my search rather that\navailable information.  In no way should this section be considered a\ncomplete family history.\n\n\n\n\n\n\nWhile we usually\ncarry the name of the male side of our ancestral family, in fact,\neach person is an equal desc",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "a-close-calll",
  "title": "A CLOSE CALLl",
  "summary": "Vivid recollection of near-fatal automobile/train collision near Chatham, NB just before Christmas 1938 (year father Elmer died). Don's brother Walter was driving Model A Ford with mother, Don, siblings Grace, Lillian (home from Boston), Kenneth, Norman. Cardboard window blocked view; train approaching from blind side. **Walter accelerated through crossing narrowly avoiding impact.** Captures moment of family danger during vulnerable period and demonstrates Don's narrative storytelling ability.",
  "content_preview": "A CLOSE CALL\n\n\n\n\nIt was a day or two before Christmas of 1938, the year Dad died.  Grace and Venetia were married and living away; Lillian had come home from Boston where she was working.  It was a crisp but clear morning; there was snow on the ground but it was well packed and not considered slippery.\n\n\n\n\nWalter slid behind the wheel, Mum got in the front seat with me in the middle.  Lillian, Ken, and Norm sat in the back.   We were off to Chatham for some last minute shopping.  John and Elinor",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "according-to-my-sister-lillian",
  "title": "According to my sister Lillian",
  "summary": "Don records anecdotal recollections from his sister Lillian about Black River life in early 1900s—cars, school, weather, medical practices, hunting, and family stories. Preserves oral history of regional life and Don's childhood era.",
  "content_preview": "According to my sister Lillian:\n\n\n\n\nAn earthquake was felt in Black River in 1925\n\nThe person who put on the fire in the Little Branch school received $8.00 for the year\n\nSleds often carried a lantern hanging on the side so that they could be spotted by other drivers, especially during stormy weather.\n\nFred Fowlie was the first person to have a car in Black River and Harrison Smith was the first in Bayside.  Malcolm MacNaughton also had a car about the same time.\n\nDr. MacKenzie was the first one",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "agricultural-society",
  "title": "AGRICULTURAL SOCIETY",
  "summary": "Don documents Agricultural Society No. 103 serving Black River and area farmers. **Father Elmer was Secretary-Treasurer for 18 years; oldest brother Walter succeeded him for another 18 years; two other brothers served as Directors.** Society functioned as bulk-purchasing cooperative handling lime, fertilizer, grass seed, pesticides, binder twine. Father maintained society shed (14x22 feet). Don recalls winter canvassing farmers, rail delivery logistics, unloading crews. **Documents his father's death spring 1938 and Walter's succession.** Reflects on Agricultural Societies' gradual replacement by cooperatives.",
  "content_preview": "AGRICULTURAL SOCIETY\n\n\n\n\n\n\n\nAgricultural Society No. 103 provided an important service to the farmers of Black River and points east.  The society, as well as sister organizations throughout the Province gradually were absorbed in or replaced by agricultural cooperatives.  Their story deserves to be told but, unfortunately, still remains hidden.  Perhaps it has particular significance for me because my father was Secretary Treasurer for 18 years, my oldest brother followed in his footsteps for a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "alexander-macdonald-property",
  "title": "Alexander MacDonald Property",
  "summary": "A short document based on A. W. MacDougall's \"Black River and Its First Settlers\" (1935), documenting Alexander MacDonald's land acquisition at Little Branch (Lot #3, Third Division) in 1803. Includes a vivid anecdote of MacDonald wading across a creek to extend his land grant while surveyors followed by canoe. Speculates on property locations relative to current residents (Norman Glendenning, Neil Watling, Uncle Jim) and discusses the division of property between his son John and daughter Jessie, with dates of property transfers and Don's father's 1912 purchase of Jessie's property. Shows Don's detailed local knowledge and family connections to the land.",
  "content_preview": "Alexander MacDonald Property\n\n\n\n\nThe following was taken from the book by A. W. MacDougall.\n\n\n\n\nAAlexander MacDonald came from the Highlands with the 1803 immigration.  He settled on Lot #3 of the Third Division, on the west side of the southwest branch of Black River...\n\n\n\n\nIt has been told of the elder Mr MacDonald , that when the Government Surveyors were allotting the land to the prospective settlers, he was told to proceed along the shore till he had secured a sufficient frontage for his lo",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "alexander-watling",
  "title": "Alexander Watling",
  "summary": "Genealogical background document on Alexander Watling. File listed among Family Tree Maker files suggests this may be ancestral research on the Watling family. Given that Don's cemetery contact at Black River was \"Neil Watling,\" this indicates research into local Black River/New Brunswick family connections, possibly ancestral to Don's own heritage or related to his community roots.",
  "content_preview": "From: \"Judy Watling\" <watlingj@nbnet.nb.ca>\nTo: <don@glendenning.net>\nSubject: Genealogy\nDate: April 30, 2008 5:27 PM\n\nHi Don :\n\nThanks for sending me your chart - I've attached my descendant file for Alexander Watling - it should add to your names and dates. I picked up on a couple of differences that I'll mention :\n\n- You named 11 children for Alex and Catherine - actually ,there were 12 . The 12th child was Jane Mclean Watling (1879-1881) .She died in 1881 along with 2 of her siblings, Albert",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "app-6-baptisms",
  "title": "App. 6 Baptisms",
  "summary": "Spreadsheet of baptismal records for St. Paul's Church, providing genealogical data. Lists names and dates of persons baptized within the parish.",
  "content_preview": "APPENDIX 6\n\nPRESBYTERIANS IN BLACK RIVER\n\n\n\n\nBAPTISMS AT ST. PAULS\n\n\n\n\nChild’s Name\t\t\t    Father’s Name\t   \tMother’s Name\tDate of Birth\t   Date of Baptism\tMinister\n\n\n\n\nKenneth Elmer Glendenning\t    Elmer Glendenning\t   \tJean E. Watling\tJuly 25, 1924\t   June 14  1926\tRev. F. G. MacIntosh\n\nNorman Peters Glendenning\t    Elmer Glendenning\t   \tJean E. Watling\tDec. 31, 1925\t   June 14, 1926\tRev. F. G. MacIntosh\n\nRoy Mills Watling\t\t    James A. Watling\t   \tKatherine C. Mills\tFeb. 6,   1926\t   June 14, ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "app-7-burials",
  "title": "App. 7 Burials",
  "summary": "An appendix listing Presbyterian burials from St. Paul's Church in Black River from 1969 to 2003, including multiple Glendenning family members (John Franklin Glendenning, Walter Jubal Glendenning, Agnes Elspeth Gibson Glendenning) and other extended family connections. This genealogical record reflects Don's documentation of family history and his connection to the Black River Presbyterian community.",
  "content_preview": "APPENDIX 7\n\nPRESBYTERIANS IN BLACK RIVER\n\n\n\n\nFUNERALS FROM ST. PAUL’SCHURCH\n\n\n\n\n\n\n\n\n\n\n\n\n\n1969, December 26\t\tEarle A. Taylor\t\t\t\t\t\n\n1973, February 23\t\tElinor Jean (Glendenning) Taylor\n\n\n\n\n1976, September 19\t\tMrs. James R. Cameron\n\n          November 17\t\tJack Hamilton\n\n          \n\n1979, August 25\t\tDonald Cameron Russell\n\n\n\n\n1983, November 25, \t\tJames A. Watling\n\n\n\n\n1985, June\t\t\tMrs. George Adams\n\n\n\n\n1986, June 26\t\t\tJohn Franklin Glendenning\n\n\n\n\n1988, March 9\t\t\tBert Gibson\n\n          July 22\t\t\tAlex ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "app-8-gifts-and-memorials",
  "title": "App. 8 Gifts and Memorials",
  "summary": "Detailed list of memorial gifts given to St. Paul's Presbyterian Church, documenting donors and recipients honored through donations. Includes multiple Glendenning family memorials and contributions from Walter Glendenning, illustrating family generosity and community standing.",
  "content_preview": "APPENDIX 8\n\nPRESBYTERIANS IN BLACK RIVER\n\n\n\n\nMEMORIALS AND GIFTS TO ST. PAUL’S\n\n\n\n\n\n\n\n\n\n\nPulpit Bible presented by Mrs. Atkinson, Kouchibouguac, NB\n\nOrgan donated by Robert Anderson\n\nCommunion Set in memory of Mr. And Mrs. Kenneth MacDonald\n\nCommunion Table given by Mrs. Allan MacKay\n\nStained glass window depicting The Good Shepherd given in memory of Mr. and Mrs. Robert MacDougall, by their niece, Mrs. Emma Trevors\n\nStained glass memorial window given in memory of the Allan Family by Mrs. James",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "appendices",
  "title": "Appendices",
  "summary": "Table of contents/organizational document for supporting materials in a larger family history project. Lists four appendices: A) Autograph Album (entries 1910-1915 with addresses from Portland, ME and various locations); B) Household Record Book (first year after marriage, Portland, ME to Parksville, TN); C) Clippings and copies (newspaper articles featuring Elmer and Jane); D) Photos (integrated throughout text). Technical organizational note rather than biographical content. Third-party reference/research framework.",
  "content_preview": "APPENDIX\n\n\n\n\n\n\n\n\n\n\n\n\n\nA\tAutograph Album\n\n\n\n\nAmong Mother’s mementoes, was a hard-covered, maroon-coloured autograph album.  The first entry was by E. A. Glendenning on September 18, 1910 in which he gave his address as Wausau, Wisconsin.  I wonder if it was a memento brought to her when he returned from Wausau but prior to their wedding. \n\n\n\n\nThe next entry is on December 1, 1910, after their marriage, in which she gave her address as Bonny Eagle, Maine; then there are a number of entries in Dec",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "archibald-cameron-sr",
  "title": "Archibald Cameron Sr.",
  "summary": "Comprehensive genealogical chart documenting descendants of Archibald Cameron (b. 1769, Scotland; d. 1861, Black River NB) and Mary McKeller Cameron. Covers nine generations of family lines in Black River, Northumberland County NB area, with detailed birth/death dates, marriage records, occupations, and burial locations. Archibald and Mary emigrated August 1802 to Miramichi with eight sons and three daughters. Includes extensive notes on children (Hugh Ewen, John, Donald, Alexander, Marjorie, James, Murdoch, Christina, Dougald) and their descendants. This genealogy provides family context for understanding Don's heritage and deep roots in the Black River/Miramichi region spanning 200+ years. Third-party genealogical research document.",
  "content_preview": "Descendants of Archibald Cameron\n\n\n\n\n\n\n\nGeneration No. 1\n\n\n\n\n1.  ARCHIBALD1 CAMERON was born 1769 in Lochobar, Scotland, and died March 15, 1861 in Black River, N. B..  He married MARY (NEE MCKELLER?) CAMERON 1796 in Glenelg Parish, North'ld Co., N. B..  She was born 1769 in Argyleshire, Scotland, and died October 27, 1854 in Black River, N .B..\n\n\n\n\nNotes for ARCHIBALD CAMERON:\n\n\tArchibald and Mary Cameron came to the Miramichi in 1802.  It is said they had 8 sons. \tA son named Archibald is ment",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "back-to-nb",
  "title": "Back to NB",
  "summary": "Comprehensive family record documenting Elmer Glendenning's return to Canada (1919) and settlement in Little Branch. Details property acquisitions (1914-1931): Jessie MacDonald property ($800), James Finno land (1924), Dan MacLean property, Bob MacLean property with life tenancy, James Watling property (1926). Describes house renovations using timber from property, barn expansions, and farming operations. Records his postal service role (Nov 1914-Aug 1916). Extensively details his multi-faceted work career: construction (dam at John Godfrey's, Tinker Dam near Woodstock), pulp operations in Middle Black River, lumber camps, bridge building. Captures his personal work ethic (shoe resoling, harness repair, axe handle making), community involvement (founding member St. Paul's Presbyterian Church 1926, Agricultural Society Secretary-Treasurer, Orange Lodge, Oddfellows, Masons). Notes pernicious anaemia diagnosis (~1933), death in 1938. Describes wife Jane's community roles and death from pancreatic cancer (1964). Final anecdote about Uncle Allie MacDonald's recollection working with Elmer, noting his strength and humility. Contains family recollections (not first-person from Elmer, but compiled by Don).",
  "content_preview": "BACK TO NEW BEUNSWICK\n\n\n\n\nNote:\tThe following random notes were gathered primarily from family and are in random order; hopefully I can both add to them and put them in order at some future date.\n\n\n\n\n\n\n\nDad purchased the property at Little Branch, where Norman now lives, from Alexander and Ethyl MacDonald on July 21, 1914 for the sum of $800.00.  It was known as the Jessie MacDonald property.  \"Miss Jessie\" who was a schoolteacher, died in 1912.  This property was directly across the road from w",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "background",
  "title": "Background",
  "summary": "Comprehensive background essay (dated January 19, 2005) by Don Glendenning on Scottish and Irish immigration to Canada in the late 1700s–early 1800s. Explains causes: aftermath of the Scottish Rebellion and outlawing of the clan system (1745), wool price increases displacing tenant farmers, religious persecution, and poverty. Details the harsh immigration experience and Grosse Île mortality. Features an extended first-person account from 1897 newspaper interview with Mary Ann Harley (b. 1799, Courtmasherry, Ireland), Don's great-great-grandmother, recounting her 1822 emigration, the Battle of Waterloo celebration, the first steamship in Cork Harbor, her brother William (a government surveyor), her 75-mile walk through forests to Newcastle, and marriage to John Henry. Includes sections on coats of arms, clans, and tartans. Demonstrates Don's scholarly approach to understanding his family's historical context.",
  "content_preview": "BACKGROUND\n\n\n\n\n\n\n\nIntroduction\n\n\n\n\nThe surge of Scottish settlers in the late 1700’s may be attributed to a number of events.  First was the Scottish Rebellion followed by an outlawing of the clan system by an Act of Parliament in 1745.  Scots were required to take an oath not to carry weapons and never use Highland garb.  Also in the late 1700’s there was a great increase in the price of wool and mutton.  This resulted in tenant farmers being turfed from the land and replaced by large sheep far",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "beautification-miramichi",
  "title": "Beautification  Miramichi",
  "summary": "Planning document for \"Black River Beautification Awards\" program to promote roadside beautification in the Black River community (Northumberland County, NB). Describes community boundaries, volunteer committee structure, beautification criteria (landscaping, painting, etc.), and annual $500 grant from the foundation. Lists issues for consideration including cash prizes, promotion timing, and eligible use of funds. Shows Don's involvement in community beautification initiatives related to his Black River heritage.",
  "content_preview": "Black River Beautification Awards\n\n\t___________________________________________________________\n\n\n\n\n\n\n\n  \nThe community of Black River wishes to promote the beautification of roadside properties within its boundaries. \n\n\n \n\n  \nFor the purpose of the Award, Black River is described as the community in Northumberland county, New Brunswick situated on both sides of the of Black River and its tributaries between the former Victoria Bridge and the headwaters of the River.\n\n\n\n\n\n  \nTo oversee the makin",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "black-river-community-hall",
  "title": "Black River Community Hall",
  "summary": "Extensively researched document by Don on Black River Community Hall's history 1930-1973, based on the original account book. Details first hall construction (October 1930-summer 1931, cost ~$1,500), donations by Robertson Orange Lodge and Dorcas Club, volunteer labor, and funding through dances. Horrifyingly documents the August 24, 1932 fire consuming the completed hall. Chronicles second hall construction (1932-1934), 1967 centennial renovations, and February 1973 fire that again destroyed the building. Includes complete financial ledger transcriptions, donor names, builder compensation, and detailed work schedules with family members' participation (Elmer Glendenning, E.A. Glendenning). Shows Don's genealogical connection to community institution-building and archival preservation methods.",
  "content_preview": "Black River Community Hall\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWanted\n\t\n\n\n\n\t\n\t\nA\n\tphoto of the first and second Black River Community Halls\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLike most communities\nof the day, the church and the local school served as centers for\ncommunity gatherings.  My sister, Lillian, recalled many dances in\nthe Little Branch School at which my father volunteered to sell candy\nand pop, take tickets, and help with setting up and cleaning up\nafterwards.  Many other",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "black-river-connections",
  "title": "Black River Connections",
  "summary": "Extensive historical documentation (partially shown; ~5,767 words) by Don Glendenning on Black River settlement and local institutions. Covers: the Mi'kmaq origin of \"Black River\" (Mat-quan-ti-gook); settlement timeline from UE Loyalists (1785–95) through Scottish immigration; Miramichi place names and their origins; transportation via river routes; land grants documentation with specific lot numbers and grantee names (MacNaughton, Watling, Glendenning, MacDonald families); schools established 1825 onward; mills including George Fowlie's gristmill (1833); churches—St. Stephen's Presbyterian (1836, rebuilt 1906), St. Paul's Presbyterian (1930), and the United Church of Canada merger (1925); post offices and postmasters (1871–1928) including Don's father as Postmaster at Little Branch (1914–1928) and Elmer Glendenning (1914–1916); detailed genealogies of MacDonald, MacNaughton, and Watling families with marriage and children records. Rich with anecdotes about local figures and infrastructure development.",
  "content_preview": "BLACK RIVER CONNECTIONS\n\n\n\n\n\n\n\nA. W. MacDougall says that the name Black River, in the MicMac language is AMat-quan-ti-gook - a term intended to describe its waters.  In the early days, Black River was a large area including Bay du Vin and point Aux Carr but now embraces only the communities along both the north and south sides of the river - a distance of 10 to 15 miles.  McDougall describes at least one lot, at McDougall's Point near the mouth of the river, which was granted to Delesderniere a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "blacksmiths",
  "title": "Blacksmiths",
  "summary": "Brief note, likely from a correspondent, providing information about blacksmith shops in Black River. The writer mentions Jack Dick's blacksmith shop and a building beside John W's house that was formerly a store. This appears to be a response to research inquiry sent to Don, showing his collaborative research methods with community members.",
  "content_preview": "Sorry for the tardiness in replying. I can't remember any other establishments other than the\n\nones you mentioned, but of course my recollections date from our arrival in Black River in 1945.\n\nI remember Jack Dick's blacksmith shop. I should mention , and perhaps you recall, there was\n\na small building right beside the road in front of John W's house. They always referred to it\n\nas the \"shop\", and I understand it was a store at one time. I don't know what years it operated,\n\nbut certainly pre- 1",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "bruce-3",
  "title": "Bruce-3",
  "summary": "Extended letter from Don to Bruce Caughill dated May 22, 2005 providing family context for Bruce's genealogical research project. Detailed background on: Christina Catherine Watling (1876-1956), first daughter of Jubal/Grace Watling, married Robert Thomas Adams; Janet Watling (1883-1977), lived in Waltham MA; Jane Watling (Don's mother) married Elmer Glendenning, lived in Portland/Connecticut/USA before returning NB 1919; Ernest (Ern) Watling's military service; various Watling family neighbors (Archie MacNaughton, Jim Palmer, Walter MacDonald). Explains relationships, residences, church attendance at St. Stephen's. Critical document for understanding Don's immediate family, his mother Jane Watling Glendenning, and his childhood community. References accompanying photographs and archival materials (postcards, letters from Uncle Ern and Uncle Guy).",
  "content_preview": "Date:\t\t TIME \\@ \"MMMM d, yyyy\" May 22, 2005\n\n\n\n\nTo:\t\tBruce\n\n\n\n\nFrom:\t\tDon\n\n\n\n\nGreetings from PEI.\n\n\n\n\nAs discussed, here are a few notes as background to your project:\n\n\n\n\nChristina Catherine Watling (1876-1956) was the first born of Jubal and Grace (MacDonald) Watling.  On August 17, 1895, she married Robert Thomas Adams.  They had three children of which James Irenus was the oldest.  Robert Thomas Adams died in 1902.  I am not sure where they lived originally, but family lore says that “Uncle ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "cameron-bridge",
  "title": "Cameron Bridge",
  "summary": "Don documents the Cameron Bridge at Middle Black River, the shortest of three covered bridges spanning the river, named for the preponderance of Cameron families in the area. He notes that in winter, a designated resident was responsible for snowing the bridge for sled travel. The bridge was badly damaged by fire in 1970, followed by a temporary Bailey bridge, and a new pre-cast concrete bridge in 1976. Don also notes it was \"a great trout fishing location,\" adding personal knowledge of community recreation.",
  "content_preview": "Cameron Bridge\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAn undated photo of the\nCameron Bridge looking south provided by Francis J. MacNaughton\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Cameron Bridge provided a crossing for the main road at Middle\nBlack River; the bridge and the adjacent school are so named because\nof the preponderance of settlers named Cameron in the immediate area.\n Like other covered bridges, each winter a nearby resident was\ndesignated to snow the bridge to ease the travel of sleds.\n\n\n\n\n\n\n\n\nThe bridge, th",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "canobie-connection",
  "title": "Canobie Connection",
  "summary": "Genealogical and historical documentation of Glendenning family connection to Canobie, NB area. Opens with statement: John Glendinning (Elmer's father) settled Bathurst area ~1830, later moved to Canobie where Elmer was born. Documents place names along coastal route east from Bathurst: Salmon Beach (1820 Irish settlers), Janeville (named Jane Dawson), Stonehaven (possibly Scottish origin), New Bandon (1819 Irish settlers), Canobie (named after Canonbie, Dumfriesshire, Scotland). Provides historical context on settlement patterns (1700s Acadian settlement, organized land granting from 1800s). Details John Glendinning Sr. (Elmer's grandfather): born April 2, 1807 at Callister Hall, Dumfriesshire, Scotland; sailed from Annan 1830; purchased Lot 7 Salmon Beach with Margaret Harley (married August 23, 1833); Margaret taught first school in Salmon Beach (home-based 1838, purpose-built 1842; 27 students, 12x12x6 feet schoolhouse). Describes property movements: John and Margaret moved inland to Canobie 1855, sold Salmon Beach property. Lists early Canobie land grants (100-acre lots) with names and dates (1868-1939). Census records from 1861/1871 showing household composition. Children: Mary Anne, John, Margaret, Elizabeth Jane, Walter. John Sr. died May 15, 1877 in Canobie; Margaret died October 21, 1895. Extensive section on John Jr. (married Ellen Dickey; children practically raised by brother Walter's family), burial New Bandon Cemetery. Details Walter Glendenning (grandfather): born November 26, 1845; married Elizabeth Peters (daughter of John Peters, October 23, 1821-June 31, 1904, and Jane Sealy, December 24, 1821-September 12, 1892). Walter active in church (Sunday School teacher), Trinity Union Church trustee (1899), cut first lumber for building. Successful farmer with documented property holdings (Lot 30 Canobie homestead, 100-acre Lot 28, Stevens Farm 100 acres, Taylor Farm 50 acres). Will inventory lists extensive livestock and equipment (horses, cows, sheep, bull, farm machinery). Walter died of pneumonia while visiting daughter Venetia in Falmouth Foreside, Maine (will January 6, 1908, death February 1908); Elizabeth relocated to Maine, died May 14, 1915. Burial in Presbyterian cemetery New Bandon. References FWH manuscript \"Boyhood Memories of New Brunswick\" (~1940) with anecdotes about Canobie neighbors and family connections. Establishes genealogical continuity from John Sr. through Elmer's generation.",
  "content_preview": "9\n\tGlendenning\n\tRoots\n\t\n\nCANOBIE\nCONNECTION\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJohn\nGlendinning, my Great Grandfather settled in the Bathurst area about\n1830; later he moved to Canobie where my father, Elmer Glendenning\nwas born.  This chapter deals with the Canobie connection to the\nGlendenning family.\n\n\n\n\n\n\n\n\n\n\n\nEarly\nNames\n\n\n\n\n\n\nTravelling\neast from Bathurst along the coast towards Caraquet, one finds a\nnumber of communities familiar to the Glendenning family.  The\nfollowing information was taken from Geographi",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "cemetery",
  "title": "Cemetery",
  "summary": "Don describes the Black River/St. Stephen's Cemetery located on Gunn's Point, originally part of a lot granted to Enoch Gunn in 1812. The property was purchased by Enoch Godfrey in 1820, with the first burial believed to be Robert MacBeath in 1823. A Presbyterian church (St. Stephen's) was built in 1836 in the current cemetery area. Following Church Union in 1925, the cemetery served full burial rights to former Presbyterians continuing in the tradition. The document includes reference to a Glendenning family collection and mentions a Veterans' Memorial for soldiers who died in service. This reflects Don's attention to family burial traditions and community genealogy.",
  "content_preview": "Black River/St. Stephen’s Cemetery\n\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tGlendenning Collection\n\t\n\n\t\n\n\n\t\n\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nVeterans’\n\tMemorial erected in memory of soldiers who died in the service of\n\ttheir country.  Names include:\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\tThe Black River Cemetery is situated on a point\n\tof land known as Gunn’s Point, and later Church Point; it was part\n\tof Lot No. 4 originally granted to Enoch Gunn on June 3, 1812.  The\n\tproperty was purchased by En",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "challenged",
  "title": "challenged",
  "summary": "Brief note by Don comparing Suffolk county England (described in 1812) with the homesteading experience at the Meadows in New Brunswick in the mid-1800s. Emphasizes the dramatic transition his ancestors made from rural English county life to wilderness clearing in colonial North America. Reflects on ancestral resilience and adaptability.",
  "content_preview": "challenged.\n\n\n\n\nSuffolk, England\n\n\n\n\nMy great grandfather, Jubal Watling was born in Suffolk county England in 1823.  Suffolk County was described in 1812 as follows:\n\n\"Suffolk, an English  HYPERLINK \"http://www.genuki.org.uk/big/eng/SFK/map.html\" COUNTY 47 miles in length and 30 miles in breadth, bounded on the West by Cambridgeshire, on the North by Norfolk, on the South by Essex and on the East by the German Ocean. It contains 575 parishes, 28 market towns and sends 16 members to Parliament. ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "chesney-final-2007",
  "title": "Chesney final-2007",
  "summary": "Written by Don Glendenning in February 2007, this is a comprehensive genealogical and biographical history of Carol Louise (Chesney) Glendenning, Don's wife. The document traces Carol's family roots in Illinois (German and Scottish heritage), describes her childhood in Henry, Tiskilwa, and Peoria, her nursing education and career, and their meeting in 1957. It includes extensive details of their life together—marriage in 1958, Don's graduate studies in Bloomington, the births of Brian (1962) and Janet (1967), moves to Ottawa and Charlottetown, Carol's entrepreneurial ventures (The Accenter craft business), her artistic pursuits, and family travels. The narrative captures Don's affection and admiration for his wife, includes many photographs, and demonstrates his commitment to preserving family history for future generations.",
  "content_preview": "Carol Louise (Chesney)\nGlendenning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDedicated \n\n\n\nto \n\n\n\nCarol Louise (Chesney)\nGlendenning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nINTRODUCTION\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI am\nof the view that it",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "church-picnic-at-bayside",
  "title": "Church picnic at Bayside",
  "summary": "Brief photo caption documenting a St. Paul's Presbyterian Church picnic event at Bayside that included Edgar Fowlie, from the Glendenning collection. A minimal document providing context for a historical church photograph.",
  "content_preview": "ST. PAUL’S PRESBYTERIAN CHURCH\n\n\n\n\n\n\n\n\n\n\n\n\nChurch picnic at Bayside,\nincluding: Edgar Fowlie,\n\n\n\n\n\n\n\n\nEdgar Fowlie, \n\n\nGlendenning\ncollection",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "church-school",
  "title": "Church School",
  "summary": "A photograph of a Summer Bible School class from St. Paul's Church, with identified students including Kate Watling and Janie Cameron. The image documents religious education activities and the Watling/Glendenning family connections in the Black River church community.",
  "content_preview": "ST. PAUL’S PRESBYTERIAN CHURCH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSummer Bible School\n\n\n\n\n\n\n\nBack\nrow:\tKate Watling, Janie Cameron, Mrs. Burnham, Ruby ?\n\nRow\nfour:\t\n\nRow\nthree\n\nRow\ntwo;\t\n\nFront\nrow\n\n\n\n\n\n\n\n\n\n\n\nGlendenning\nCollection",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "communion-roll-3",
  "title": "Communion Roll-3",
  "summary": "Historical communion roll for St. Paul's Presbyterian Church listing congregants' names including multiple Glendenning family members (Donald, Norman, Walter, Venetia, Lillian), Watling relatives, and other Black River community members. This genealogical document provides evidence of family involvement and standing in the church community across multiple generations.",
  "content_preview": "ST. PAUL’S PRESBYTERIAN CHURCH\n\nCommunion Roll\n\n\n\n\n\n\n  \n    \n      \n        \nMrs. Richard Godfrey\n      \n    \n    \n      \n        \nMrs. Kenneth MacDonald\n      \n    \n    \n      \n        \nMrs. Allan MacKay\n      \n    \n    \n      \n        \nMrs. Jubal Watling\n      \n    \n    \n      \n        \nMr. James R. Cameron\n      \n    \n    \n      \n        \nMrs. James R. Cameron \n      \n    \n    \n      \n        \nMr. Alex. E. MacDonald\n      \n    \n    \n      \n        \nMrs. Alex. E. MacDonald\n      \n    \n    \n   ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "cormier-maude-glendenning",
  "title": "Cormier,Maude Glendenning",
  "summary": "This obituary documents Alda Maude Glendenning Cormier (1883-1956), wife of James Cormier, who died at Saint John Hospital. Maude was daughter of Walter and Elizabeth Glendenning, making her one of Don Glendenning's siblings or close relatives. The obituary lists her surviving children and siblings, including connections to Florida, New York, Ontario, and Maine. The document shows the widespread geographic dispersal of the Glendenning family across North America.",
  "content_preview": "Obituary provided by Grandson, Walter Berry; paper and date not known\n\n\n\n\n(Transcription for Mrs. James Cormier)\n\n“Mrs. James Cormier died April 19, 1956 at Saint John Hospital.  She was the former Alda Maude Glendenning born in Canobie May 2, 1883.  She was the daughter of Walter and Elizabeth Glendenning.  She is survived by her husband and four daughters Mrs. George Hood (Edna) in Lewiston, Maine;  Mrs. Fred Bierley (Doris) in Long Island, NY;   Mrs. Clayton Scott (Lillian) in Bathurst Mines;",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "cost-of-living-1",
  "title": "Cost of living 1",
  "summary": "Don presents historical context on New Brunswick's early currency (beaver pelts and equivalencies) and detailed records from his brother Walter's 1948 account books. Documents wood-cutting and grain-threshing crew compositions and wages (e.g., James A. Watling paid $5.50 for 3 hours, Theodore Fowlie $4.50 for a day). Records shared equipment ownership (thresher, engine) and community labor exchange practices typical of farm life, noting George Adams' possession of the only sloven (low-platform farm wagon) in Black River.",
  "content_preview": "New Brunswick Currency\n\n\n\n\nAccording to the October 2004 issue of the Miramichi Branch, NBGS, Newsletter, the early “coin” of New Brunswick was “one pound of spring beaver pelts”; this was equal to 1 otter, 3 sable or marten skins, 6 mink skins, 10 muskrat, 10 ermine, 5 pounds of deerskin, and 6 pounds of feathers.  I beaver skin would buy 14 pounds of pork, 30 pounds of flour, 21/2 gallons of molasses, 2 gallons of rum or 2/3 yard of cloth.\n\n \n\nWalter’s record book\n\n \n\nOn April 5, 1948, Walter ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "ctf-2005-dec-31-in-word",
  "title": "CTF 2005 Dec 31 in word",
  "summary": "Financial consolidation statement for the Community Foundation of PEI's Consolidated Trust Fund as of December 31, 2005. Shows asset allocation ($626,376.02 total FMV) across 33 named funds including memorial funds, scholarship funds (Carver, Bonnell, Phillips), and special-purpose funds (Hospice Association, Architects Association, Visual Arts). Includes Glendenning Family Fund valued at $10,540.53. Reflects Don's stewardship of charitable giving infrastructure at CFPEI.",
  "content_preview": "Date\n      \n      \n        \nDate\n      \n      \n        \nValue Date\n      \n    \n    \n      \n        \n\n\n      \n      \n        \n\n\n      \n      \n        \n31-Dec-05\n      \n      \n        \n31-Dec-05\n      \n      \n        \n31-Dec-05\n      \n    \n    \n      \n        \n\n\n      \n      \n        \nCommunity Foundation of PEI Consolidated Trust Fund Allocation and Valuation\n      \n      \n        \n Adjusted Book Value (ABV) \n      \n      \n        \nTotal CTF Units Held \n      \n      \n        \nPortfolio           ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "dad-purchased-a-model-t",
  "title": "Dad purchased a Model T",
  "summary": "Documents Elmer's automotive acquisitions with specific details: Model T Ford (purchased from MacLennan's Garage in Chatham; salesman took Grace for test drive before purchase); 1929 Model A 2-door Sedan (purchased from Babineau sisters who operated Chatham cinema). Includes vehicle registration reproductions (1928 Model T, 1938 Model A). Narrative anecdotes: Elmer and Walter cutting wood at Bay du Vin River to earn car money; Model T upset at Gilberts Corner near Shediac (Grace broke wrist when Elmer was bringing her home from business college); Model A stored in wagon shed (possibly due to recession); allowance of $2.00 weekly gas; technical detail about gravity-fed fuel systems and backward driving on steep hills like Tabisintac. Portrays Elmer as not a very good driver (Aunt Venetia's skepticism), with occasional mishaps but practical problem-solving. Contains reproductions and sourced from Lillian.",
  "content_preview": "Dad purchased a Model T. Ford, year unknown, but Lillian (Weeks)\nGlendenning thought that he had purchased it from MacLennan’s\nGarage in Chatham (At the corner of the Park).  Lillian remembered\nthat the salesman let Grace tryout the car before Dad bought it. \nSometime after 1931 he purchased a 1929  Model A 2-door Sedan –\npurchased, I believe, from the Babineau sisters (The Babineau's\noperated the movie theatre in Chatham.)  According to both Walter and\nLillian, the car was purchased on the day ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "dances",
  "title": "Dances",
  "summary": "Don's first dance in June 1946 at age 16—a \"Lancer\" with Norma Williston (classmate from Branch School and Miramichi Rural High School). That summer he attended dances two to three times weekly at various halls (Black River Hall, Mel Adams' hall, Napan School, Sunny Corner) with friends including Francis MacNaughton. Describes a brawl that emptied the Black River Hall. Includes story of Jim Finno, a blind neighbor with an apple orchard, and the incident where Don's group attempted to steal \"transparent\" apples but fled when Finno appeared, resulting in Don's sprained ankle.",
  "content_preview": "My first Dance\n\n\n\n\nOne late afternoon about the second week of June 1946, Elinor and I were in the front yard, perhaps even raking the yard, when Harry MacLean walked by on the way home (from work?).  We spoke as he walked by and he asked me if I was going to the dance in the Black River Hall that night.  I went for the first time and had my first dance, a “Lancer”, with Norma Williston.  Norma and I were in the same Grade at the Branch School and later at the Miramichi Rural High School.\n\n\n\n\nTh",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "dick-royal-canadian-legion-chatham-branch",
  "title": "Dick, Royal Canadian Legion Chatham Branch",
  "summary": "Don's correspondence offering paintings of Black River WWI soldiers to Royal Canadian Legion, including Gnr. Stephen Dick who died in action. Demonstrates Don's community involvement and effort to preserve local military history and honor fallen soldiers.",
  "content_preview": "Royal Canadian Legion Chatham Branch #3, \n\nPO Box 86, \n\nMiramichi, NB\n\n E1N 3A5. \n\n\n\n\nAttn: Rene Smith, Treasurer\n\n\n\n\nThanks for your Email; I am delighted to hear from you and of your interest in receiving the painting from Carolyn Haggard.\n\n \n\nActually there are two paintings:  \n\n\n\n\nThe first is of Gnr. Stephen Dick of Black River who was killed in action overseas during WW1.  I am enclosing a brief note about both Stephen and the artist on a separate page.  The painting is being offered to th",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "dick-stephen-2015-03-15t23-54-00",
  "title": "Dick,Stephen@2015-03-15T23;54;00",
  "summary": "A biographical account of Stephen John Dick, born 1895 in Black River Bridge, NB, who died as a soldier in World War I at age 23 in France. The document describes his sister Barbara Victoria's oil portrait of him and the painting's eventual donation to the Irvine Museum in Alberta. This genealogical record connects to Don's family history and his interest in documenting family narratives.",
  "content_preview": "Stephen John Dick\n\n\nJanuary 18, 1895-October 1, 1918\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStephen\nJohn Dick, was born in Black River Bridge, Northumberland County,\nNew Brunswick.  He was the youngest child of Alexander and Selina\n(Weaver) Dick .His siblings were Elizabeth Agnes, Barbara Victoria\nand John William\n\n\n\n\n\n\nGnr.\nStephen John Dick, #522059, 1st Brigade, Canadian\nField Artillery, buried in Haynecourt British Cemetery, about 6 miles\nnorthwest of Cambrai, France, age 23.\n\n\n\n\n\n\nThe\nPainting\n\n\n\n\n\n\nBar",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "edge-outhouse",
  "title": "Edge-Outhouse",
  "summary": "Written by Donald Edge (NOT Don Glendenning; received as email correspondence Feb 2003), this witty and detailed essay describes life in Black River using outdoor privies and chamber pots, drawing from childhood memories and observations. References Don's Watling cousins and their remarkably modern indoor privy within their barn complex. A valuable resource for understanding the material conditions of early 20th-century Black River life and provides context for Don's own childhood experiences in that community. Edge's piece reflects on outhouses as \"hallmarks of democracy\" and symbols of self-reliance.",
  "content_preview": "canada.com | Help | Read Mail in InboxFrom:  Djedge007@aol.com\n\n      Date:  Thu Feb 6 18:41:58 2003 (PST)\n\n      To:  gjgarner@telusplanet.net, dglende@attglobal.net, \n\n      jhwilson@nbnet.nb.ca, jewatling@yahoo.com\n\n      Subject:  The Outhouse: Final version\n\n       \n\n\n\n\n\n\n\n \n\nThe Outhouse\n\n\n\n\n\n\n\n\n\n\n\"And it shall come to pass, that instead of sweet smell there shall be stink…\"\n\n[Isaiah 3:24]\n\n\n\n\n\n\n\n\n\n\nMy grandparents' house saw many firsts.  It was the first house in Black River \n\nto have a ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "electric-power",
  "title": "Electric Power",
  "summary": "Don documents the arrival of electricity to Black River in fall 1948. His mother had the house wired in advance by Harry Simmonds; Don recalls coming home from his teaching position at Miramichi Rural High School to see the house lit for the first time. His brother Norman installed an electric water pump at Christmas 1948 and a hot water heater Christmas 1949, with Don assisting and later helping install a water line to the barn (dug 5 feet deep, 1950-1951) using a float-chamber system. Includes memory of his mother's electric iron, kept in storage during prior years when his father worked at hydroelectric dam projects with electricity access.",
  "content_preview": "Electric Power\n\n\n\n\nElectric power came, as I recall, to Black River in the fall of 1948.  The hydro poles had been put in and wires strung the year before.  Mum had the house wired, I think, by Harry Simmonds, months before power was turned on.  I was teaching at the Miramichi at the time and remember coming home from school, probably in September or October, and looking up the hill to see the house lighted for the first time.\n\n\n\n\nSeems to me that Norm put in an electric water pump that Christma",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "elmer-1-2015-10-10t20-21-20",
  "title": "Elmer (1)@2015-10-10T20;21;20",
  "summary": "Comprehensive genealogical research documenting Elmer Alton Glendenning (1875-1938) and wife Jane Elizabeth Jardine Watling (1890-1964), Don's parents. Details Elmer's ancestors, properties in Canobie NB, nine children (including Don), and community roles (Agricultural Society secretary-treasurer, Masonic member, Oddfellow, Orange Lodge member 43 years). Includes newspaper clippings, property records, and extensive family documentation, essential for understanding Don's family background and values.",
  "content_preview": "Ancestors of Elmer Alton Glendenning \n\n\n\n\n\n\n\nGeneration 1 \n\n\n\n\n1. \n\nElmer Alton Glendenning, son of Walter Glendenning and Elizabeth Peters was born on 29 Jun \n\n1875 in Canobie, NB. He died on 18 May 1938 in Black River Bridge, NB. He married Jane \n\nElizabeth Jardine Watling on 18 Oct 1910 in Little Branch, Black River, New Brunswick, daughter \n\nof Jubal Watling and Grace MacAskill MacDonald. She was born on 28 Feb 1890 in Upper Black \n\nRiver, NB. She died on 25 Mar 1964 in Newcastle Hospital, N",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "ernie-maclean-black-river",
  "title": "Ernie MacLean - Black River",
  "summary": "Comprehensive historical record of St. Stephens United Church of Canada at Black River, New Brunswick, from 1812 onwards. Documents land transfers, church construction (1835-1836), financial difficulties, and organizational changes through 1940s. Includes details on trustees, properties, ministers (Rev. Simon Fraser, Rev. Angus MacMaster, Rev. Myers, Rev. G. A. Grant), and community figures. Given Don's birth at Black River Bridge in 1929, this detailed local history directly contextualizes his family's community and religious life. Shows deep historical documentation of the area central to Don's family heritage and early life.",
  "content_preview": "From: \"SHIRLEY MAC KAY\" <kildonan@verizon.net>\nTo: \"Don Glendenning\" <dglende@pei.sympatico.ca>\nSubject: ERNIE MACLEAN LAND - some good reading - will dig out the MacKay stuff tomorrow - in the closet\nDate: November 23, 2008 7:02 PM\n\nSAINT STEPHENS UNITED CHURCH OF CANADA, BLACK RIVER\nLAND PURCHASES AND CHURCH BUILDING INFORMATION\n\nLot # 4 - all that certain parcel of land on the southerly side of the main branch of Black River was granted to Alexander Gunn by letters protect under the great sea",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "family-educator",
  "title": "Family Educator",
  "summary": "Collection of Don's educational commentary and proposals written for public discourse. Includes multiple essays/letters: \"Family Educator\" proposing independent education advisory service separate from school system; \"Cookie Cutter Schools\" offering recommendations for educational reform; \"When a School Can't Help\" discussing reading instruction gaps; and \"Advisor, Advocate, or Ombudsman?\" exploring educational support roles. Signed \"Don Glendenning, A long-time student of education\" with contact email standards2020@gmail.com. Reflects Don's passion for education reform, his belief that education extends beyond schooling, and his advocacy for comprehensive educational support systems. Written for letters-to-editor publication.",
  "content_preview": "My notes\n\nEducational Advisor\n\n\n\n\n\n\n\nThere is a major gap in our educational system, a gap that results, I believe, from the fact that we fail to differentiate between education and schooling.  Just think of the question “Where did you get your education?  What the person wants to know is where did you go to school or what university did you go to.  As a result, we fail to provide independent advice to learners of all ages as to their educational concerns.  The system expects you to go to an ins",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "first-radios",
  "title": "First Radios",
  "summary": "Don relates his sister Lillian's recollection that Malcolm MacNaughton owned the first radio in Black River (early listeners shared earphones), followed by Herb Fowlie and Uncle Jim Watling. Walter and Venetia (wife) purchased the first radio at Don's home, placed in the dining room and powered by a 6-volt car battery, two B-batteries (cylindrical, 3 inches diameter), and a C-battery (soda-box sized). An aerial wire ran from the house eave to a tall pole at the gatepost near the henhouse.",
  "content_preview": "First Radios\n\n\n\n\nMy sister, Lillian, recalled that Malcolm MacNaughton from the north side of Black River was the first one in the community to have a radio.  People used to visit to listen and had to take turns listening through earphones.  The next two radios were Herb Fowlie and Uncle Jim Watling.\n\n\n\n\nWalter and Venetia bought the first radio at my home.  It sat in the dining room near the back wall.  A copper wire was run as an aerial from the eave of the house to a tall, slender pole at the",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "flyer",
  "title": "Flyer",
  "summary": "A 2010 annual report flyer for the Community Foundation of PEI listing 30+ endowment funds under management, including the \"Glendenning Family Fund.\" Confirms Don's leadership role as a board director and his commitment to youth philanthropy initiatives. Shows the Foundation's expansion to $1.3 million portfolio with annual grants exceeding $60,000 to Island charities.",
  "content_preview": "‘A\n\t CAUSES THAT MATTERS”\n\t\n\n\n\n\t\n\n\n\n\n\n\tFUNDS\n\t\n\n\n\n\t\n\t\nUnrestricted\n\tFunds\n\t\nEric\n\tRobinson Fund\n\t\nFund\n\t#1\n\t\nThomas\n\tand Katherine\n\t\n      Upson\n\tFund\n\t\nCommunity\n\tFund\n\t\nFoundation\n\tFund\n\t\nScholarship\n\tFunds\n\t\nJoan\n\tAuld Fund\n\t\nOrin\n\tCarver Scholarship\n\t\n      Fund\n\t\nLorne\n\tand Ruby Bonnell\n\t\n      Scholarship\n\tFund\n\t\nLowell\n\tPhillips Scholarship\n\t\n     Fund\n\t\nSummerside\n\tNatick International\n\t\n      Friendship\n\tHockey Fund\n\t\nAdmiral\n\tLouise and James C.\n\t\n     Wilmot\n\tFund\n\t\nInterest\n\tFunds\n\t\n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "fowlie-s-mill",
  "title": "Fowlie's Mill",
  "summary": "Don investigates the history of Fowlie's Mill on the Little Black River using newspaper clippings and historical records. Documents include an 1828 account of Mrs. Fowlie's grist and saw mills burning under suspicious circumstances, an 1833 Gleaner article about George Fowlie establishing the mill, and a 1932 Chatham Gazette article about F.A. Fowlie remodeling the mill. Don expresses uncertainty about ownership details but provides valuable local historical documentation. The mill was burned and rebuilt twice and served as a community resource.",
  "content_preview": "Fowlie’s Mill\n\n\n\n\n\n\n\nclipping date and newspaper not known but believed to be 1978, includes the following uder a column entitled “150 years ago 1828”\n\n\n\n\nFoul play suspected\n\n\n\n\nThe grist and saw mills of Little Black River owned by Mrs. Fowlie, were totally consumed by fire on the 10th Feb.There was a large quantity of wheat, flour and oatmeal in the mill at the time, which was all consumed, together with everything on the premises.  \n\nFrom all the information we are able to glean, there is ev",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "friends-addresses-don",
  "title": "Friends addresses -Don",
  "summary": "Extensive address list compiled for Don's personal use, showing his network of lifelong friends and extended family connections across Canada, USA, UK, Australia, and New Zealand. Includes relatives in New Brunswick (Ada Glendenning in Englewood, FL; Eileen Glendenning in Black River Bridge, NB; Eric & Jeanie Glendenning; Keith & Ruth Glendenning). Lists close friends like Ray & Lois Presley (Ottawa), Russ and Doreen Saunders (Ottawa), David & Diane Campbell (Stratford, PE), and many others from university/professional circles. Includes Carol's Christmas list names (Carol Schlepp, Irma Comegys, Bill & Laine, Fords, Janet, Brian). Also contains \"Electronic List\" and \"Directors\"/\"Past Directors\" entries suggesting professional/institutional affiliations. Valuable genealogical and social network record.",
  "content_preview": "ADDRESSES\n\n\n\n\n\n\n\n  \n\n   Barbara Coppla\n\n   30 Claremont St.\n\n   Malden, Mass.  02148-4604\n\n   USA\n\n   \n\n  Robin & Joy Farrell \n\n   229 Cloverland Drive\n\n   Rochester\n\n   New York\t\t14610\n\n    \n\n   Dave and Clare Garland\n\n   5323 36th. Ave\n\n   Wetaskiwin, Alberta    T9A 2Z7\n\n  \n\n    Mrs. Ada Glendenning\n\n    8427 Truman St\n\n    Englewood, Florida     34224\n\n  \n\n    Miss Eileen Glendenning\n\n    450 Little Branch Road  \n\n    Black River  Bridge, NB\n\n    E1N 5N3\t\n\n\n\n\n    Eric &Jeanie Glendenning \n\nLi",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "fund-glendenning",
  "title": "Fund-Glendenning",
  "summary": "Fund overview for the Glendenning Fund (originally \"Glendenning Family Fund\"). Established to make grants for charitable purposes in Black River, NB (Don's birthplace). Contacts: Janet Glendenning and LoisAnne Gregan. Notes that fund will transfer to Miramichi if/when that area develops a community foundation. Grant history includes donations to Miramichi Historical Society (history prizes about Black River) and Miramichi Rural School (library books, 2005-2006). Demonstrates Don's enduring connection to his New Brunswick roots and commitment to community in his native region.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nFund Overview\n\n\n\n\n\n\n\nOfficial Name:\tGlendenning Fund \n\nOriginally the Glendenning Family Fund but apparently some \n\npeople thought that it was only for the Glendenning family\n\n\n\n\nDate of establishment:\n\n\n\n\nPurpose:\tto make grants for charitable purposes in the community of Black River, NB\n\n\n\n\nContact:\tJanet Glendenning or LoisAnne Gregan\n\n\n\n\nNotes:\n\nAnticipated that the Fund will be transferred to the Miramichi if and when that area develops a commun",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "fwd-harley-family",
  "title": "Fwd_ harley family",
  "summary": "Email from Kelsie Erskine (October 2006) describing an oil painting of Beaubair Island on the Miramachi River, painted by a Burchill, created circa 1849-1857 when John Harley and George Burchill were in partnership. The painting was brought to UK by Kelsie's grandmother (John Harley's granddaughter) when she married. Demonstrates Don's connections with distant cousins researching shared Harley ancestry and shows tangible historical artifacts (the painting) associated with the family's New Brunswick business and community involvement.",
  "content_preview": "From: \"Kelsie Erskine\" <erskinekd@yahoo.co.uk>\nTo: \"harley gllendinning\" <dglende@auracom.com>\nSubject: Fwd: harley family\nDate: October 25, 2006 5:21 PM\n\n\n\nKelsie Erskine <erskinekd@yahoo.co.uk> wrote:   Date: Wed, 25 Oct 2006 22:16:38 +0100 (BST)\nFrom: Kelsie Erskine <erskinekd@yahoo.co.uk>\nSubject: harley family\nTo: glendinning <dglen@aura.com>\n\n     Slideshow | Save to: My Yahoo! Photos or My Computer \n  Click a photo to view a larger version on Yahoo! Photos. See links above for more option",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "g-callister",
  "title": "G-Callister",
  "summary": "\"Plate 14: Dumfrieshire, Scotland\" contains three image captions: Callister Hall, \"Across from Callister Hall,\" and \"Main Street, Annan.\" These relate to Don's genealogical research into Scottish ancestral origins, specifically locations in Dumfriesshire where his ancestors may have connections.",
  "content_preview": "PLATE 14:\t\tDumfrieshire, Scotland\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCallister\nHall\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAcross\nfrom Callister Hall\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMain Street, Annan",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "games",
  "title": "Games",
  "summary": "Charming recollection of childhood games and pastimes in Black River, including Anti-I-Over (a team ball game played over buildings), buckety wade (teeter-totter), homemade darts made from cork and horseshoe nails, and the card game Flinch which was unique to the Glendenning family. Don credits his sister Grace with introducing Flinch via a Parker Brothers game sent from Salem, Massachusetts. Also describes snow-crust skating and coasting with a humorous incident of his front wheel dropping through.",
  "content_preview": "Anti-I-Over?\n\n\n\n\nDonald Edge was trying to recall the name of a game played by youngsters in Black River.  It was, I believe, Anti-I-Over although I am not sure of the correct spelling.\n\n\n\n\nIt was played between two teams separated by a building – usually the house, the barn or a large shed.  One team would throw the ball over the building – anywhere along the roof.  The other team would wait for the ball to appear and would try to catch it.  If not successful, they threw the ball back over.  If",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-2007-body",
  "title": "Glendenning 2007 Body",
  "summary": "Central content file from the 2007 Glendenning family history manuscript. Contains core narrative and biographical materials.",
  "content_preview": "Glendenning\n\tRoots\n\t\n____________________________________________________________________________\n\t\n\n\n\n\t\n\t\nDONALD\n\tGLENDENNING\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\t\nGlendenning\n\tRoots\n\t\n___________________________________________\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nDonald\n\tE. M. Glendenning C.M.\n\t\nCharlottetown,\n\tP.E.I.\n\t\nCanada\n\t\n200",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-2007-first-pages",
  "title": "Glendenning-2007 First pages",
  "summary": "Opening pages and front matter from the Glendenning family history manuscript. Likely includes title page, table of contents, and introduction.",
  "content_preview": "Glendenning\n\tRoots\n\t\n____________________________________________________________________________\n\t\n\n\n\n\t\n\t\nDONALD\n\tGLENDENNING\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\t\nGlendenning\n\tRoots\n\t\n___________________________________________\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nDonald\n\tE. M. Glendenning C.M.\n\t\nCharlottetown,\n\tP.E.I.\n\t\nCanada\n\t\n200",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-elmer1875-1938",
  "title": "Glendenning, Elmer1875-1938",
  "summary": "Newspaper obituary of Elmer A. Glendenning (Don's father) from Moncton Times, detailing his 14 years as secretary-treasurer of the Agricultural Society, membership in Masonic Order (25+ years), Oddfellows (30 years), and Orange Lodge (43 years). Lists surviving wife Jean Watling and nine children including Don and four daughters. Includes Don's reflective note about his father's work at Wilson Dam and J.G. White Engineering Company connections. Document shows Don's genealogical research into his parents' history.",
  "content_preview": "Venetia's clippings included the following believed to have been taken from the Moncton Times:\n\nCHATHAM,May 22 - The community of Black River and the Miramichi generally will learn with deep regret of the death of Elmer A. Glendenning at his home Black River Bridge.  For 14 years he had been the energetic secretary-treasurer of the progressive Agricultural Society of that district.  For over a quarter of a century  he has been a member of the Masonic Order; for 30 years enjoyed membership in the",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-fund",
  "title": "Glendenning Fund",
  "summary": "Documentation of the Glendenning Family Fund established by the family of Elmer and Jane Watling Glendenning (Don's parents) for charitable purposes related to Black River Bridge, New Brunswick (Don's birthplace). Lists grants (2002-2008): history prizes, library books for Miramichi Rural School, and planned cemetery bench. Notes include contacts (Janet Glendenning, Loisanne Gregan, Donna Goodfellow) and discussion of future Miramichi Foundation transfer. Demonstrates family philanthropy rooted in ancestral community.",
  "content_preview": "13\n\nGlendenning Fund\n\n\n\n\n\n\n\nContacts:\tJanet Glendenning, 46 Holland Ave, Ottawa, K1Y  0X4\n\n\t\tLoisanne Gregan, 325 Hardwicke Road, Hardwick, NB  E9A 1L5   Tel:\n\n\t\tDonna Goodfellow, Upper Kent, New Brunswick\n\n\t\t\n\n\n\n\nBackground\n\n\n\n\nEstablished by the family of Elmer and Jane (Watling) Glendenning, grants may be made for any charitable purpose related to the community of Black River Bridge, New Brunswick.  (Black River is a rural community stretching along both sides of the Black River which empties",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-george-maxwell",
  "title": "Glendenning, George Maxwell",
  "summary": "Undated Chatham Gazette clipping reporting funeral service for infant George Maxwell Glendenning, son of Mary and John Glendenning, held at their Black River Bridge home. Rev. Fraser Dunbar conducted service with hymns \"When He Cometh to Make up his Jewels\" and \"Jesus Loves Me.\" Infant survived by parents and siblings Margaret, Jean, and Frankie. Purely genealogical record.",
  "content_preview": "An undated newspaper clipping believe to be from the Chatham Gazette, reports\n\n\n\n\n\"GEORGE MAXWELL GLENDENNING  \"On Sunday, February 24th, at 2 the funeral of George Maxwell, infant son of Mary and John Glendenning was held from their home at Black River Bridge.\n\nRev. Fraser Dunbar, minister of St. Paul's Presbyterian Church  conducted the service.  The hymns sung were, When He Cometh to Make up his Jewels also Jesus Loves Me.  \n\nBurial was in Black River Cemetery.  Pallbearers were uncles of the",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-guy-wellington",
  "title": "Glendenning, Guy Wellington",
  "summary": "Herald Advocate obituary from February 24, 1967, reporting death of Guy W. Glendenning, age 77 (born Canobie, NB). Canadian WWI veteran; moved to Bowling Green, Florida in 1930. Active Mason (Past Master of Bowling Green Lodge 121, Scottish Rite Mason) and member of Wauchula Elks Lodge. Survived by widow Hazel Stultz Glendenning, son Robert, daughter Cornelia, brother Ray, and four grandchildren. Family connection document.",
  "content_preview": "The Herald Advocate of February 24, 1967 carried the following:\n\n \n\nGuy W. Glendenning, 77, Died February 8 after an extended illness.\n\n \n\nHe was born in Canobie, New Brunswick, Canada and was a Canadian Veteran of World War l.  He came to Bowling Green in 1930 from Peru where he was affiliated with the Masonic Lodge in 1921, serving as Worshipful Master a few years later.\n\n \n\nHe was Past Master of Bowling Green Lodge 121 and Past Patron of  Bowling Green Chapter 23, Order of the Eastern Star, a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-hilda-ellis",
  "title": "Glendenning. Hilda Ellis",
  "summary": "Newspaper clipping (source/date unknown) reporting death of Mrs. Hilda Glendenning, age 95, of Bathurst (formerly Canobie). Daughter of Edwin and Nina Jagoe Ellis. Last surviving member of immediate family. Member United Church Clifton and Women's Institute. Husband Raymond Glendenning died 1970. Survived by three sons (Marson, Guy, George), six daughters, 56 grandchildren, 94 great-grandchildren, and seven great-great-grandchildren. Extended family connection showing large family tree.",
  "content_preview": "A newspaper clipping, paper and date not known, reports:\n\n\"Mrs. H. Glendenning\n\nCANOBIE (Special) - Mrs. Hilda Glendenning, 95, of 2055 Vallee Lourdes Dr., Bathurst, formerly of Canobie, died Sunday at Foyer Notre Dame de Lourdes.\n\nBorn in Canobie, she was the daughter of  the late Edwin and Nina (Jagoe) Ellis.  The last surviving member of her immediate family, she was a member of the United Church, Clifton and the Women's Institute.  She was also a member of the Canobie Community Club.  Her hu",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-leonard",
  "title": "Glendenning, Leonard",
  "summary": "Northern Light obituary from November 13, 1958, of Leonard Glendenning, age 77, who died at home of Weston Breckenridge in Bass River after lengthy illness. Born in Canobie; lived in Palermo, Maine before returning to Salmon Beach. Survived by wife Alma Jagoe, two daughters (Verna, Millie), two sons (Myron, Stedman), and siblings. Notes large number of floral tributes. Extended family connection.",
  "content_preview": "The Northern Light of November 13, 1958 includes the following on page 8 \"Leonard Glendenning Paid Final Tribute\n\nThe death of Leonard Glendenning occurred  at the home of Weston Breckenridge in Bass River Sunday evening after a lengthy illness. He was 77.\n\nBorn in Canobie, he moved to the United States and resided in Palermo, Maine until about ten years ago when he returned to take up residence in Salmon Beach.\n\nHe is survived by his wife, the former Alma Jagoe of New Bandon; two daughters, (Ve",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-margaret-harley",
  "title": "Glendenning, Margaret Harley",
  "summary": "Brief genealogical note from Daniel F. Johnson's New Brunswick Newspaper Vital Statistics database. Reports death of Margaret (Harley) Glendenning on October 21, 1895 in Canobie at age 92; husband John Glendinning, Sr. died May 15, 1877. Burial at Presbyterian cemetery in New Bandon. Note about unmarked graves encountered during burial work. Purely genealogical reference.",
  "content_preview": "John Glendinning, Sr. died May 15th 1877 in Canobie; his wife, Margaret (Harley) Glendenning died on October 21, 1895.   Daniel F. Johnson's New Brunswick Newspaper Vital Statistics reports: \"Clifton (Glou. Co.) October 23 - Mrs. Margaret Glendenning of Canobie departed this life Monday, Oct. 21st, at the age of 92 years.  The interment took place Wednesday 23rd in the Presbyterian burying ground, New Bandon.  Mr. MacInnis was the officiating clergyman.\"; presumably her husband is buried there a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-margaret-virginia",
  "title": "Glendenning, Margaret Virginia",
  "summary": "Daily Press (Hampton, Virginia) death notice and gravestone record from January 1918 for Margaret Virginia Glendenning, infant daughter of Elmer A. and Jean Glendenning, died at Langley Field age 5 days (January 13-18, 1918). Funeral conducted by Rev. Charles Friend at Hampton Presbyterian Church. Buried in St. John's Episcopal Cemetery, Hampton. Documents Don's infant sibling and family's time in Virginia.",
  "content_preview": "The Daily Press Newspaper, Hampton, Virgina, for January 13-20, 1918 carried the following notice:\n\n\n\n\nDeath of an Infant\n\nMary Virginia Glendenning, the infant daughter of Mr. and Mrs. E. A. Glendenning, died in the home of her parents at Langley Field yesterday.  Funeral services will be conducted at 3 o'clock this afternoon by the Rev. Charles Friend, Pastor of the Hampton Presbyterian Church.  Burial will be made in St. John's Cemetery.\"  The gravestone inscription in St. John's Episcopal Ce",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-walter-sr",
  "title": "Glendenning, Walter Sr.",
  "summary": "Brief newspaper clipping reporting death of Walter Glendenning, age 63, in Falmouth, February 14 (year not specified). Funeral Sunday at 2:30 p.m. from daughter Mrs. Doring's residence (Falmouth Foreside). Don's annotation notes his grandmother (Peters) Glendenning moved to Portland/Falmouth to live with daughter Venetia after his grandfather's death. Family genealogy with personal memory.",
  "content_preview": "GLENDENNING--\"In Falmouth, Feb. 14, Walter Glendenning, aged 63  years.  Funeral Sunday afternoon at 2:30 o'clock, from the residence of his  daughter, Mrs. Doring,  Falmouth Foreside.\"  After my Grandfather died, Grandmother (Peters) Glendenning moved to Portland (Falmouth Foreside) to live with her daughter, Venetia.",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendenning-walter",
  "title": "Glendenning, Walter",
  "summary": "Moncton Times obituary of Walter J. Glendenning, age 84 (Don's eldest brother), who died June 16, 1998 at Moncton Hospital. Born Black River Bridge, son of Elmer and Jane Watling Glendenning. Retired from Modern Enterprises (30+ years), member St. Andrew's Presbyterian Church Moncton and past elder at St. Paul's Black River Bridge. WWII Canadian Army veteran. Married 58+ years to E. Agnes Gibson. Survived by two daughters, one son, seven grandchildren, one great-grandson, and four siblings including Don. Extensive family record.",
  "content_preview": "The Moncton Times carried the following (Clipping undated)\n\n\n\n\n\"Walter J. Glendenning\t\tMr. Walter J. Glendenning, 84, of Beech St., Moncton and formerly of Black River Bridge, passed away at the Moncton Hospital on Tuesday, June 16, 1998 after a lengthy illness.\n\nBorn in Black River Bridge, NB, he was the eldest son of the late Elmer and Jane (Watling) Glendenning.  Walter was a retired employee of Modern Enterprises  with over 30 years service.  He was a member of St. Andrew's Presbyterian chur",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendinning-front-pages",
  "title": "Glendinning-front pages",
  "summary": "Front matter of major genealogical work titled \"Family Series - 2: Descendants of Jubal Watling\" authored by Donald E. M. Glendenning (2010). Includes extensive introduction by Don describing his 60+ years of family information collection, explaining his genealogical methodology (census records, newspapers, church documents, cemetery visits), and justifying his focus on Watling and Glendenning families. Dedication to Carol and children Brian, Marie, Lisa, Laura, and Janet. Acknowledges family contributors, historians, and provides contact information (62 Queen Elizabeth Drive, Charlottetown; don@glendenning.net; 902-892-5859). Traces author's lineage back to Jubal Watling (1790-1845) of Norfolk, England through to Don (b. 1929). Demonstrates Don's scholarly approach to family history and deep commitment to documenting heritage.",
  "content_preview": "Family\nSeries - 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDescendants\n\nOf\n\n\n\n\n\n\nJUBAL\nWATLING\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald.\nE. M. Glendenning\n\n©2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\nJUBAL\n\tWATLING\n\t\nAbt\n\t1790-1845\n\t\n\n\n\n\t\n\t\nThe\n\tfirst Jubal Watling encountered was  the author’s Great Great\n\tGrandfather.  There were three Watling ancestors named Jubal; the\n\tfirst, at least the first in my records was born in Brockdish,\n\tNorfolk, Engla",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendinning-kath-letter-to",
  "title": "Glendinning, Kath-letter to",
  "summary": "Letter from Don Glendenning to Mrs. K. Glendinning, Low Hesket, Carlisle, Cumbria, UK (August 15, 2007). Don responds to a genealogical inquiry passed through the Dumfries and Galloway Family History Society. Outlines his direct descent from John Glendinning (b. 1807 at Callister Hall) through John's emigration to New Brunswick (1830), marriage to Margaret Harley (1833), and death in 1877 at Canobie. References his informal family newsletter and website (www.glendenning.net/don). Demonstrates Don's engagement with international genealogical communities and his role as a family historian sharing research across continents.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown\n\nPrince Edward Island, C1A 3A9\n\nCanada\n\n\n\n\n\n\n\nMrs. K. Glendinning\n\n8 Southwaite Rd.\n\nLow Hesket,Carlisle\n\nCumbria,  CA4 OES\n\nUnited Kingdom\n\n\n\n\nDear Mrs.  Glendinning:\n\n\n\n\nYour request for information, #3515, in the Dumfries and Galloway Family History Society was passed to me by a Ian Glendinning.\n\n\n\n\nI am a descendant of John Glendinning and Mary Rae through their son, John, who was my great Grandfather.\n\n\n\n\nJohn, my Great Grandfather, was born at Callis",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "glendinning-kath-uk",
  "title": "Glendinning, Kath, UK",
  "summary": "Letter from Don Glendenning to Kath Glendinning in the UK (July 15, 2009) sharing a newly discovered entry in the family Bible (c. 1830) that extends his ancestry by one generation. Proposes John Glendinning (1755-1830) as his Great Great Great Grandfather, and queries Kath's knowledge to support this interpretation. Shows Don's continued genealogical investigation into late life and his international family connections with Scottish relatives. Contact address: 62 Queen Elizabeth Drive, Charlottetown, PEI; email: don@glendenning.net.",
  "content_preview": "July 15, 2009\n\n\n\n\n\n\n\n62 Queen Elizabeth Drive\n\nCharlottetown, PEI\tC1A 3A9\n\nCanada\n\n\n\n\nDear Kath:\n\n\n\n\nSome time ago, I had computer problems and, as a result, seem to have lost your Email address – hence this letter.\n\n\n\n\nRecently, I found another entry in the family Bible in possession of my brother, Norman Glendenning – an entry, I should add, that had completely escaped me earlier.  The family Bible had belonged to my Great Grandfather, John Glendinning (1807 – 1877).  While quite faint in plac",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "gllendenning-hazel-stultz",
  "title": "Gllendenning, Hazel Stultz",
  "summary": "Florida Advocate obituary from May 29, 1936 of Robinson L. Doring, age 72, engineer and construction superintendent. Moved to Bowling Green, Florida in 1915 from Portland, Maine. Major construction projects included Stevens Creek dam, irrigation systems in Idaho, and WWI Amatol ammunition plant in New Jersey. Widow was Venetia G. Doring (Don's aunt). Children: Verna Elizabeth, Walter G., and John S. Doring. Document filed under Hazel Stultz but concerns her first husband Robinson Doring. Genealogical reference.",
  "content_preview": "The following obituary was taken from the Florida Advocate dated May 29, 1936.\n\n\n\n\nRobinson Doring Dies at Bowling Green Home\n\n\n\n\nRobinson L. Doring, 72, died at his residence west of Bowling Green on Wednesday after a lengthy illness.  He was born in Perry, Maine April 24, 1864.  Moving to Bowling Green in 1915, from Portland, Me., the deceased had lived there until his death.\n\n\n\n\nMr. Doring followed hydro-electric powerhouse, dam and paper mill construction as an engineer and general construct",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "godfrey-janet-watling",
  "title": "Godfrey, Janet Watling",
  "summary": "Miramichi Press (December 21, 1977) funeral service report for Mrs. Janet M. Godfrey, widow of John R. Godfrey of Black River Bridge (Don's aunt). Born Black River Bridge, daughter of Jubal and Grace MacDonald Watling. Active member St. Paul's Presbyterian Church, life member John Robertson WMS, former member Presbyterian Women's League and Women's Institute. Co-founder Victoria Knitting Club. Survived by daughter Grace Williston, son Alexander Newton, brother James A. Watling, six grandchildren, two great-grandchildren. Body placed in memorial vault pending spring burial.",
  "content_preview": "The Miramichi Press of December 21, 1977 carried the following:\n\n \n\nFUNERAL IN BLACK RIVER BRIDGE\n\n \n\nThe funeral service for Mrs. Janet M. Godfrey, widow of John R. Godfrey of Black River Bridge, was conducted at her home Dec. 10 at 2 p.m.\n\n \n\nRev. J. Posno conducted the service.  The organist, Mrs. Cameron Russell, played two hymns, \"The Lord is My Shepherd\" and \"Safe in the Arms of Jesus.\"  \"Amazing Grace\" was sung by a quartet.\n\n \n\nThe honourary pallbearers were Rankine MacLean, George Adams",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "grandma-shuttle",
  "title": "Grandma Shuttle",
  "summary": "Don's narrative from March 14, 2016 (New Symrna Beach, Florida), describing receiving a weaving shuttle from his first cousin Cornelia (Glendenning) Traetta that belonged to their Great Grandmother Margaret (Harley) Glendenning (1803-1895). Documents the shuttle's journey from Ireland via Margaret's migration in the 1820s, through Margaret's grandson Walter, to Venetia Doring, then to Cornelia, and finally back to Don for donation to the New Brunswick Museum. Includes planned Facebook post text. Rich family heirloom story connecting Don to Irish heritage and frontier weaving traditions.",
  "content_preview": "Grandma Glendenning’s shuttle\n\n\n\n\nMarch 14, 2016\n\nNew Symrna Beach, Florida\n\n\n\n\nHa a visit today from my first cousin, Cornelia (Glendenning) Traetta, and her husband, Bob, who live in Ormond Beach not far from here.  During her visit she presented me with a shuttle that belonged to our Great Grandmother, Margaret (Harley) Glendenning. This is my understanding of the story.\n\n\n\n\nThe Harley’s been English but moved to Courtmacsherry, Ireland, where William Harley was believed to have been a school",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "hampton-va",
  "title": "Hampton,VA",
  "summary": "A concise genealogical summary (titled \"Meadows to Little Branch\") documenting the Watling family migration and property succession. Details Jubal Watling Sr.'s 1814 marriage to Susan Leach in England; the immigration of five children to Canada; Jubal Jr.'s 1851 land petition and 1881 grant of Lot #30 (100 acres) in the Meadows where Don's mother was born; Grace MacDonald's 1874 marriage to Jubal Jr.; their move to Little Branch after 1901; Alexander MacDonald's original 1812 grant and property division between his son John and daughter Jessie; and the November 1901 agreement where Jubal and Grace took over John's Little Branch property to care for elderly Elspeth MacDonald and her son James. Notes Jubal Jr.'s death on February 16, 1915, and Uncle Jim's return from Portland to manage the farm.",
  "content_preview": "________________Meadows to Little Branch\n\n\n\n\nJubal Watling married a Susan Leach in Metfield, Suffolk County, England on November 14, 1814 and moved to Syleham, Suffolk County, England where their son, Jubal, was baptized on August 17, 1823.  They likely stayed in England, however, the following children came to Canada:\n\nJubal who married Christina MacNaughton\n\nWilliam who married Mary MacNaughton\n\nMary Ann who married William Maxwell\n\nGeorge who moved to the USA\n\nEmma who married William Eddy\n\n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "harley-biography-of-john-harley",
  "title": "Harley, Biography of John Harley",
  "summary": "Dictionary of Miramichi Biography entry documenting John Harley (b. 1800 Courtmacsberry, Cork, Ireland; d. 1875 Chatham Head, NB). Harley was a prominent ship carpenter, master builder, and businessman who came to Miramichi around 1823. He built 62 ships on Miramichi (1850-1866), served as militia officer, justice of the peace, commissioner of lights, and harbormaster. Married Ann Coughlan in 1829; had three sons and two daughters, including Fanny Harley who married Charles Sargeant. Important connection to Carol Louise Chesney's Harley family ancestry.\n- **Note:** Third-party source document (biographical dictionary entry).",
  "content_preview": "Dictionary of Miramichi Biography\n\n\n\n\n\n\n\nHARLEY, JOHN, ship carpenter and master builder, businessman, inspector of lights, harbormaster and JP; b. Courtmacsberry, Co. Cork, Ireland, 1800; m. 1829, Ann Coughlan, also a native of Ireland; d. Chatham Head, 26 Sep 1875.\n\n\n\n\nThe son of an Irish schoolmaster, John Harley came to the Miramichi around 1823 after a brother and sister had previously entered the province. He hired as a ship carpenter with William Abrams, for whom he was later master build",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "henry-homespun-volume-i",
  "title": "Henry-Homespun Volume I",
  "summary": "Extensive personal memoirs titled \"Homespun Memories of a New Brunswick (Canada) Boyhood\" by Rev. Frederick William Henry (b. 1872 near Bathurst, NB; d. 1964 Denver, CO). Contains multiple narrative sections: Rev. Henry's funeral notice (died Jan. 11, 1964, age 91); memoir by his mother Elizabeth Henry detailing family origins in Ireland, emigration, frontier life (teaching school, running shops, managing household during her husband's injury, 1844-1881); grandmother's memoir by Mary Ann Harley Henry (b. 1799 Courtmasherry, Cork, Ireland) describing 1822 emigration at age 23, marriage to John Henry (1823), and 19th-century New Brunswick settlement life; plus prefatory historical essays on Ulster-Scots settlement patterns and reflections on pioneer life. Rich primary source showing family resilience, women's roles, education, and community building. George Henry (Frederick's father) was directly related to John Harley (shipbuilder). Excellent biographical and historical material.\n- **Note:** Personal memoir/autobiography; contains edited transcription note by Robert John Stevens (2008).",
  "content_preview": "HOMESPUN\n\nMEMORIES\n\nof a\n\nNEW BRUNSWICK (CANADA) BOYHOOD\n\n\n\n\n\n\n\n\n\n\nFrederick William Henry\n\n\n\n\n\n\n\nNote: Several years ago—probably in 2000, I had a BYU coed transcribe this from a copy of the original typed-written copy in my procession, which I obtained from Earline Gertrude (Stevens) Wright (January 4, 1926, South Portland, Maine – October 7, 2006, Standish, Maine), who was the long.-time nurse and founding Trustee of the Remick. Museum in Tamworth, New Hampshire. Earline new Frederick Henry a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "home",
  "title": "HOME",
  "summary": "Don's account of the family home in Little Branch, originally built in the mid-to-late 1800s for Miss Jessie (schoolteacher who died 1912). Elmer Glendenning purchased it in 1914 and significantly expanded it in 1919 to accommodate his growing family of nine children (four daughters, five sons). Details the major renovation including added ell, new kitchen, dining room, parlour, bedroom on first floor, and four upstairs bedrooms. Describes sourcing materials from their own property: spruce framing, maple floors, pine cupboards from Fowlie's mill. Includes outbuildings: barn, henhouse, grain shed, privy, and seed shed for Agricultural Society #103.",
  "content_preview": "HOME\n\n\n\n\n\n\n\nMiss Jessie’s home sao n a hill overlooking the Little Branch School, an appropriate location for a school teacher.  The home itself, in Miss Jessie’s day was a modest one and would have been quit appropriate for an unmarried school teacher in the late 1800s.  Miss Jessie died in 1912 at the age of 89, my father bought the home in 1914.  We do not know when it was built but probably in the mid to late 1800s.\n\n\n\n\nIt was a typical small farm home of the period.  One and one-half story ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "homestead-map",
  "title": "Homestead Map",
  "summary": "Don references a homestead map by Roe & Colby from 1876 showing residences in Black River at that time, including names in the Meadows, Little Branch, and McKenzie Settlement areas. Don notes that the Glendennings were \"latecomers to Black River and are not included,\" indicating his family arrived after 1876. This documents available historical cartographic sources for the community.",
  "content_preview": "Homestead Map - 1876\n\n\n\n\nA homestead map by Roe & Colby shows the names, but not lot numbers, of people living in Black River in 1876; In the Meadows, on the south side of the River, we find D. Macbeth, J. Watling, W. MacNaughton, D. McNaughton, D. Cameron, J. Watling, and G. Archibald.  On the north side, across from the Meadows it shows J. Edge and W. Watling.\n\n\n\n\nOn the south side of the Little Branch, we find the Branch School, J. McDonald, J. McNaughton, G. Fowley and S. McDonald.\n\n\n\n\nThe M",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "jane",
  "title": "Jane",
  "summary": "Comprehensive biographical entry on Jane Elizabeth Jardine Watling (Elmer's wife, Don's mother), born February 28, 1890 at the Meadows, Upper Black River, NB. Second youngest of eight children of Jubal Watling and Grace MacAskill MacDonald; named after Jane Elizabeth Jardine (who married Donald Cameron). Documents her arrival in Portland, Maine on January 24, 1908 (day City Hall burned; age just prior to 18th birthday). Describes initial employment as nanny/housekeeper, likely with Mrs. Jennison family caring for children Marshall and Brian. Includes extensive documentation of friendships through photographs and autograph album entries (1910-1913): the Jennison, Ratcliffe, Kennedy, Courtney, and Lawrence families; friends including Goldie Ratcliffe (Cleveland, TN connection), Mae and Stanley Franke. Details her residence at 130 Emery Street, Portland and social circle. Final section on \"Life Together in USA\" describes marriage to Elmer at parents' home October 18, 1910 (Rev. George Grant officiating), honeymoon in Montreal, residence in Bonny Eagle, Maine, and move to Parksville, Tennessee. Chronicles household budget entries January 1911 showing domestic economy (cordwood, milk, flour, fish purchases). Not first-person from Jane but extensively documented family record compiled by Don.",
  "content_preview": "JANE ELIZABETH JARDINE WATLING\n\n\n\n\n\n\n\n\n\n\nJane Watling was born, presumably at  home, at the Meadows, Upper Black River, New Brunswick on February 28, 1890. Although her name was Jane, it seems that Dad always called her Jean.  This may account for the fact that the Watling side of the family continued to call her Jane (or Janie as Uncle Ern called her) while the Glendenning side of the family referred to her as Jean.  I remember Mum saying that Dad referred to her as \"Jeannie with the light brow",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "john-glendinning",
  "title": "John Glendinning",
  "summary": "Genealogical documentation of John Glendinning Sr. (Elmer's grandfather) and son Walter; legal petition records for land grants in Canobie, NB. Documents John Sr.'s two petitions (1854/1855) for 100-acre lots with notation of \"forty-seven years\" age in both petitions; lots were vacant but improved by applicant. Walter's petition (1865 notation, pre-printed \"AUCTION\" header) for Lot 30 Canobie, showing land transfer lineage from Charles Scott to John Glendinning to Walter. Notes significant lag between petition and actual grant (Walter's grant dated February 17, 1873). John Jr. land grant record (Lot 31, August 17, 1868). Includes tangential historical note: \"The Pious Pirate\" - San Salvador Island's Watling Castle, named Captain George Watling (buccaneer/\"pious pirate\" forbidding Sabbath card play/piracy), confirming no Watling family pirate connection. Brief final section on Grandfather Glendenning's land holdings itemization from will: 100-acre homestead (Lot 30, inherited by Leonard), 100 acres Canobie (Lot 28, to wife Elizabeth), Stevens Farm 100 acres (to wife with proviso to son Raymond if he settled Canobie), Taylor Farm 50 acres (to wife, eventually inherited/sold to daughter Venetia, then Matt Ellis). Primarily legal/archival document rather than narrative biography.",
  "content_preview": "John Glendinning, Sr. (F5929, F5931)\n\n\n\n\nJohn Glendinning, my Great Grandfather petitioned for two lots of 100 acres each in Canobie.  One petition shows the name as John Glendinning, Sr. and the other shows only John Glendinning but in both cases the age is given as Aforty-seven years@ so they are both the same person.  The petitions are faint and difficult to read.\n\n\n\n\nOne petition identifies the year as 1854 and mentions the Awest half of@ ....  No lot number is given.  The lot was vacant but",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "john-watling-descendants-1",
  "title": "John Watling Descendants (1)",
  "summary": "Extended genealogical research on descendants of John L. Watling (1825-), Don's ancestor. Details his immigration from England, marriage to Jessie Carruthers (1849), and census records tracking the family through 1871. Demonstrates Don's genealogical methodology and family connections.",
  "content_preview": "Descendants of John L. Watling\n\n\n\n\n\n\n\nFirst Generation\n\n\n\n\n\t1.\tJohn L. Watling  was born in Dec 1825 in Syleham, Suffolk, England. He was christened on 6 Mar 1825 in Syleham, Suffolk, England. He died before 1920 in probably Ayer Junction, Massachusetts. \n\n\n\n\nJohn was employed as  a plasterer/mason. \n\n\n\n\nIt is presumed that John Watling died before the Watlings made the Atlantic crossing in June of 1830, as \n\nhe does not appear in any New Brunswick records.  That is, unless he did not make the c",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "jubal-watling",
  "title": "Jubal Watling",
  "summary": "A short note on Jubal Watling's land petition (F4243) dated April 9, 1851, requesting 50 acres on the south side of Black River. Documents the petition's status uncertainties and notes a later grant of 100 acres (Lot #30) in the Meadows to Jubal Watling Jr. on April 20, 1881. Identifies conflicting information in different sources and Don's hope to resolve discrepancies with further research. **NOT originally written by Don** — this is a documentary note on archival records.",
  "content_preview": "Jubal Watling (F4243)\n\n\n\n\nA petition for 50 acres of land Asituate as follows: on the South side of Black River adjoining south of William McBeath=s meadow  lot and east of a lot applied for by John Edge@  The petition is dated at Chatham on April 9, 1851 and includes his signature.  The property was vacant, surveyed but without improvements.  Other handwritten notes on the page are confusing in that they show apparent approval on May 21/51 and AAuction, August 51\".  They are signed by Peters, t",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "kelly-peter",
  "title": "Kelly,Peter",
  "summary": "Obituary of Peter Kelly (died December 17, age 95), native of Thomastown, Kilkenny, Ireland, who arrived in Canada in 1828. Educated teacher and \"fine Penman\" who educated many Black River and surrounding area residents. Noted for sincere practical piety and Presbyterian faith. Maintained hale and hearty lifestyle until near death. Document includes verse tribute and was submitted by Judy Watling (great-granddaughter). Historical community record with tangential family connection.",
  "content_preview": "Peter Kelly\n\n\n\n\nOBITUARY:- The late Mr. Peter Kelly who died at Black River on December 17th in his 95th year was a native of Thomastown, Kilkenny, Ireland.   Mr. Kelly arrived in this country in 1828.  Having a good education, he engaged in teaching for several years.  He was a fine Penman and well versed in the common branches of learning, and a considerable number of the inhabitants of Black River and the surrounding district are indebted to him for the education they received.  Mr. Kelly was",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "kim-4",
  "title": "Kim-4",
  "summary": "Email thread between Don Glendenning and Kim Nielsen (January 2008) regarding the Harley family genealogy. Discusses Thomas Harley's presence in Toronto and York area in 1834, his position as Constable, and potential connections to the Harley relatives Don is researching. Kim mentions Loyalist connections (Barnes family) and attempts to establish family relationships. Shows Don's collaborative genealogical efforts and his interest in connecting various branches of ancestor families across different regions and time periods.",
  "content_preview": "From: \"Kim Nielsen\" <chriskim@telusplanet.net>\n\nTo: \"Don Glendenning\" <dglende@pei.sympatico.ca>\n\nSubject: Re: Harley\n\nDate: January 25, 2008 6:10 PM\n\n\n\n\nHi Don,  just a quick question.  Do you recognize the surname Shortel? Back in 2005 I was in touch with a Warren Forsythe regarding a Timothy F. Harley.  His site is http://wc.rootsweb.com.  His Harley relatives came from Cork Ireland and were in New Brunswick about the same time as the ones we are researching.  I will have to go back to his si",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "king-s-visit",
  "title": "King's Visit",
  "summary": "Two anecdotes related to British royalty. First is a childhood memory of stubbing his toe on a fence post stub in the lane—still remembered painfully. Main focus is the 1938/1939 visit of King George VI and Queen Elizabeth to Newcastle, when Don (age ~15-17) and about 20-25 others from Little Branch traveled by truck (possibly Smith family-owned) to witness the royals. Describes arriving early morning, standing throughout, and returning late evening singing. Includes the charming story of two sisters from Blackville/Boiestown photographing each other instead of the royal couple. Notes the Queen Mother's later death prompted this recollection.",
  "content_preview": "My sore toe\n\n\n\n\nPresumably when Dad put up the concrete post, he widened the lane.  I recall the stub of a fence post sticking up a couple of inches or so in the middle of the lane.  I not only recall seeing it but also recall feeling it when I stubbed my toe.  It hurts yet when I think about it. \n\n\n\n\n\n\n\n\n\n\nQueen Mother=s Birthday\n\n\n\n\nThe celebration of the Queen Mother=s birthday reminds me of the visit by the King and Queen to Newcastle in 1939.  We travelled to Newcastle in Hassie (?) Smith=s",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "land-grants",
  "title": "Land Grants",
  "summary": "Detailed land grant registry for the Little Black River area compiled from New Brunswick Department of Natural Resources records. Lists original Crown grants with lot numbers, acreages, grantee names, and dates from 1812 onward. Documents Alexander McDonald Sr.'s 1812 grant of Lot #2 (225 acres, now owned by Norman Glendenning), Sinclair, Glendinning, and Glendenning family grants, and Jubal Watling Jr.'s 1881 grant of Lot #30 in the Meadows. Notes Elmer Glendenning's 1936 grant of 100 acres. Includes detailed lot maps showing neighbors. Questions origin of \"Millers Bridge\" at Norman's property. **NOT originally written by Don** — this is compiled from government records.",
  "content_preview": "Land Grants\n\n\n\n\nThe Department of Natural Resources, Fredericton has maps showing the first owners of land granted by the Crown.  They also have a book listing all the original owners.  Information in the book and maps should be the same, but isn=t always.  The following information was gleaned from these sources.\n\n\n\n\nAlexander McDonald Sr. (not MacDonald) was granted Lot #2, 225 acres, on 1812-06-03. This is the property now owned by Norman Glendenning.\n\n\n\n\nOn the same date and further up the B",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "lister-patricia-weeks",
  "title": "Lister, Patricia Weeks",
  "summary": "Obituary of Patricia Jane Lister, age 37, who died September 19, 1984 at Victoria General Hospital Halifax. Only daughter of K. Brydone Weeks and Lillian (Glendenning) Weeks of Black River Bridge. Wife of Paul Lister of New Maryland. Survived by husband, parents, paternal grandmother Eva Weeks, three brothers (John, Kenneth, Heath), and extended family. Funeral and burial September 23 at New Maryland United Church. Document lists attending relatives including Norman and John Glendenning families. Cousin of Don's generation.",
  "content_preview": "Clipping, date and source unknown:\n\nDied in Halifax\n\nWord has been received of the death on September 19, 1984 of Patricia; Jane Lister of New Maryland, who died at the Victoria General Hosital, Halifax at age 37 years.  The wife of Paul Lister, she was the only daughhter of K. Brydone weeks formerly of Loggieville and Lillian (Glendenning) Weeks of Black River Bridsge.  Besides her husband and parents she is survived by her paaternal grandmother, Mrs. Eva Weeks of Loggieville; three brothers, J",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "living-costs",
  "title": "Living costs",
  "summary": "Provides historical economic snapshot of Black River community in 1939 and pricing data from 1947. Lists community facilities in 1939: community hall, four one-room schools (Little Branch, Cameron, Upper Black River, Victoria), Miramichi Rural High School at Bayside, two churches (St. Stephen's United, St. Paul's Presbyterian), and Agricultural Society #103. Cites records kept by brother Walter showing 1947 prices: butter at 45 cents/pound, eggs at 30 cents/dozen, young pig at $5, and wage work with New Brunswick Hydro at 55 cents/hour.",
  "content_preview": "Community Facilities\n\n\n\n\nIn 1939, Black River was served a community Hall, four one-room schools (Little Branch, Middle Black River (Cameron), Upper Black River and Victoria), the Miramichi Rural High School at Bayside (Miramichi) and two churches (St. Stephen’s United and St. Paul’s Presbyterian).  The Community also had a community Hall and an active Agricultural Society, #103.\n\n\n\n\n\n\n\nLiving Costs\n\n\n\n\nAccording to records kept by my brother, Walter Glendenning, in 1947 he received 45 cents per",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "lodges",
  "title": "Lodges",
  "summary": "Documents Elmer's fraternal organization memberships. Presents facsimile of Hadattah Lodge No. 117 (Independent Order of Odd Fellows) certificate dated October 21, 1901 in Portland, Maine admitting \"Bro. Elmer A. Glendenning\" to membership. Includes handwritten inscription from Masonic textbook: \"I was made a Master Mason the last Saturday night in 1911 at Ocoee Lodge No. 212, Benton, Tennessee, E.A.Glendenning.\" Notes Masonic book presentation from James Cortey of Knoxville, Tennessee. Provides context: Elmer and Jane established household in Parksville, Tennessee April 11, 1911; Elmer worked on Ocoee No. 1 dam construction; later worked on Ocoee No. 2 (few miles upriver). Jane returned to NB for Walter's birth September 1913; both returned to NB 1914. Fraternal organization involvement indicates Elmer's community engagement and social standing. Evidence of multiple organizations across geographic relocations.",
  "content_preview": "Lodges\n\n\n\n\nWhile looking through papers recently, I came across a certificate from Hadattah Lodge No. 117, Independent Order of Odd Fellows which reads s follows:\n\n\n\n\nPortland, Me. , Oct 21st, 1901\n\nThis Certifies that Bro. Elmer A. Glendenning\n\nWas this evening admitted to membership in this lodge.\n\nJohn Steward  N.G\n\nHenry G. Milliken Sec’y\n\n\n\n\nIn a Masonic Text Book, in Dad’s handwriting, is the following inscription:\n\n\n\n\nI was made a Master Mason the last Saturday night in 1911 at Ocoee Lodg",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mackay-2",
  "title": "MacKay-2",
  "summary": "Email correspondence from Dorothy & Bryan (February 22, 2006) to Don Glendenning regarding MacKay family genealogy, specifically regarding Norm and Peter MacKay genealogies. Includes descendants of John MacKay (1802-1880 married Marjory Cameron 1807-1878), listing eight children including Elizabeth, Jane, Peter, Archibald, Alexander James, Allan, Thomas George, and Hugh MacKay with marriage dates and death years. Writer references Peter MacKay obituary and asks for Don's input on genealogical connections. Shows Don was actively consulting with family members on genealogical research.\n- **Note:** Third-party correspondence; email message preserved in genealogy files.",
  "content_preview": "----- Original Message ----- \n\nFrom: \"Dorothy & Bryan\" < HYPERLINK \"mailto:brydor@shaw.ca\" brydor@shaw.ca>\n\nTo: \"Don Glendenning\" < HYPERLINK \"mailto:dglende@auracom.com\" dglende@auracom.com>\n\nSent: Wednesday, February 22, 2006 12:08 AM\n\nSubject: MacKay\n\n\n\n\n> Thanks for the information about Norm.  Have been wondering about him and\n\n> am very glad to hear he was not badly hurt.\n\n> \n\n> Regarding your guesses, I believe you are right.  I will add that so you\n\n> can hook them up.   Do you have an a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mackay-shirley-letter-from-elspie",
  "title": "MacKay, Shirley letter from Elspie",
  "summary": "Personal letter dated February 8, 1943, from Elspie (Elspeth) to John, written from Black River. Rich with details of daily life during WWII era: weather, egg sales, logging operations, family news including son Clifford being called (to military service), wartime rationing of butter, concerns about Churchill and Stalin, local accidents (Bob MacDonald's injury), and cheerful family updates. Signed \"Love to all. Mother\" with note that \"Jean's little girl is Norma Fay.\" Captures intimate family correspondence and historical context of rural New Brunswick during wartime. **Note: Written by Elspeth Watling MacNaughton, compiled by Shirley E. MacKay.**",
  "content_preview": "Black River, Feb. 8th/43\n\n\n\n\nDear John:\n\n     I do like to think that the winter is getting shorter each day. Soon be the middle of the month. \n\nWe have had some warm days. Had some rain, and today was like spring. Colder again tonight. \n\nThe snow plow is up to Dicks. I think he must be staying there tonight. It will be nice to have an \n\nopen road again. I was to Newcastle and Chatham today. Doug Campbell cane in to the crossroads, \n\nand Gordon MacNaughton, brought me down from there. The Roads ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mackenzie-alex-22-jan-08",
  "title": "MacKenzie, Alex 22 Jan 08",
  "summary": "Comprehensive genealogical research on descendants of Alexander MacKenzie (b. ca. 1780 Assynt, Sutherland, Scotland; d. after 1811). Documents his marriage to Annabella Watson (Jan. 10, 1800) and their children including David, Isobell, Euphemia, Allan, Hector, and Rodrick. Traces second generation including David MacKenzie (christened 1801, married Katherine Kerr 1835) and Euphemia MacKenzie (b. 1805, d. Apr. 2, 1885 Tabusintac, NB, with death notice included). Contains detailed Highland Scottish origins and links to MacKenzie family presence in New Brunswick (Tabusintac area). Multiple genealogical sources cited. Important for understanding Scottish Highlands origins of Don's wife's family connections.\n- **Note:** Genealogical research compilation with ancestral Scottish details; dated Jan. 22, 2008.",
  "content_preview": "Descendants of Alexander MacKenzie\n\n\n\n\n\n\n\nFirst Generation\n\n\n\n\n\t1.\tAlexander MacKenzie  was born about 1780 in Assynt, Sutherland, Scotland. He died after 1811 in Assynt, Sutherland, Scotland. \n\n\n\n\nAlexander married Annabella Watson  on 10 Jan 1800 in Assynt, Sutherland, Scotland. Annabella was born about 1780 in Assynt, Sutherland, Scotland. She died after 1811 in Assynt, Sutherland, Scotland. \n\n\n\n\nThey had the following children:\n\n\n\n\n+\t2\tM\ti.\tDavid MacKenzie  was christened on 23 Mar 1801. \n\n\n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mackenzie-christina-watling",
  "title": "MacKenzie, Christina Watling",
  "summary": "Undated press clipping reporting death of Mrs. Christina MacKenzie (formerly Christina Watling of Black River), age 80, wife of late John MacKenzie of Loggieville. Twice married: first to Thomas Adams (two sons: James, Willard in Chippewa, Ontario); second to John MacKenzie (two daughters: Mrs. F. Schickle Florida, Miss Jean MacKenzie Ontario). Siblings include Mrs. John R. Godfrey Black River Bridge and Mrs. Elmer Glendenning (Don's mother). Extended Watling family record.",
  "content_preview": "I have an undated press clipping which reads as follows:\n\n\n\n\nThe death of Mrs. Christina MacKenzie, wife of the late John MacKenzie, a well-known resident of Loggieville, occurred at Mount St. Joseph's Pavilion here at an early hour Friday morning.\n\n\n\n\nThe late Mrs MacKenzie was the former Christina Watling of Black River and was eighty years of age.  She was twice married, her first husband being Thomas Adams of Black River.\n\n\n\n\nSurviving from her first marriage are two sons, James Adams and Wi",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "macknight-william",
  "title": "MacKnight William",
  "summary": "Detailed genealogical record for William MacKnight (b. 1804 Dumfrieshire, Scotland; d. Dec. 31, 1865, age 61) who married Annie McDonald (b. Jun. 1813, d. Jun. 17, 1896, age 83), daughter of Alexander MacDonald (1775-1843) and Grace McAskill (1781-1874). Traces their 10 children including Samuel, Samuel Kenneth, Alexander, Grace, Elizabeth, Jean, Annabelle, Margaret, William, and James. Documents second and third generation descendants with detailed dates, locations (Napan, Chatham, Black Brook, NB), and marriage information. Shows MacKnight family settlement in Northumberland County, NB area. Extensive genealogical data for understanding family networks.\n- **Note:** Genealogical research compilation; multi-generational family tree.",
  "content_preview": "First Generation \n\n—————————————————————————————————————————————\n\n\n\n\n1. WILLIAM MACKNIGHT. Born in 1804 in Dumfrieshire, Scotland. WILLIAM died on 31 Dec 1865; he was 61.\n\n\n\n\nWILLIAM married ANNIE MCDONALD, daughter of ALEXANDER MACDONALD (1775-1843) & GRACE MCASKILL (1781-1874). Born in Jun 1813. ANNIE died on 17 Jun 1896; she was 83.\n\n\n\n\nThey had the following children:\n\n\t2\ti.\tSAMUEL (1835-1919)\n\n\t3\tii.\tSamuel KENNETH (1838-1904)\n\n\t4\tiii.\tALEXANDER “Alex” (1840-1904)\n\n\t5\tiv.\tGRACE (Twin) (1842",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "macnaughton-connection",
  "title": "MacNaughton Connection",
  "summary": "A genealogical summary (by Don Glendenning) of the MacNaughton family roots, tracing from John MacNauchtan at Dunderave Castle, Scotland (died before 1750) through Malcolm and John to Alexander (1789–1849). Establishes that Christina MacNaughton (1822–1901), Don's great-grandmother, married Jubal Watling (1823–1900); their son Jubal (1846–1915) married Grace MacDonald (1848–1934); and lists their eight children: Christina Catherine, Elspeth Jardine, Jubal George, Janet, John McDonald, James Alexander William, Jane Elizabeth Jardine, and Donald Ernest Watling. Shows Don's Scottish heritage through maternal connection and completes the genealogical chain leading directly to him.",
  "content_preview": "MacNaughton Connection\n\n\n\n\nFor the benefit of other readers, this is what I have on my MacNaughton roots.  Information about Scotland came mostly from Donald Edge.\n\n\n\n\nJohn MacNauchtan was born at Dunderave Castle, Scotland and died (before 1750) at Glenlyon, Perthshire, Scotland.  His son, Malcolm was also born at Dunderave Castle and died at Glenlyon.\n\n\n\n\nMalcolm’s son, John, was also born (July 24, 1774) at Dunderave Castle; he married Catherine Stewart and they had eight children.  John died",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "macnaughton-john-ward",
  "title": "MacNaughton, John Ward",
  "summary": "Community obituary of John W. MacNaughton, age 86, widely known farmer, lumberman, surveyor, and timber cruiser for A and R. Loggie Company Loggieville. Active Liberal, district party chairman, county council member representing Glenelg parish 37 years, county warden, Miramichi Hospital board member. Elder of St. Stephen's United Church since 1926, chair of 1907 building committee, cemetery improvement manager. Masonic, Orange Lodge, IOOF, Highland Society member. Wife Elspeth (daughter of Grace and Jubal Watling, Don's maternal grandparents) predeceased 1943. Eight daughters, three sons, 22 grandchildren, six great-grandchildren. Submitted by Dorothy Lind December 29, 2004. Community figure connected by marriage.",
  "content_preview": "Mourn Death of Well Known Resident \n\n\n\n\nBlack River (Special) - The death of John W. MacNaughton in his 86th year removed from the Miramichi scene a widely known and highly respected farmer and lumberman who, during his lifetime, took an active interest in affairs of his community. \n\n\n\n\nFor many years he worked with the A and R. Loggie Company ofLoggieville. He was a lumberman, surveyor and cruiser of timber lands. His work carried him far afield and he won many friends. Until recent years he co",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mail",
  "title": "Mail",
  "summary": "Genealogical and institutional research into Little Branch Post Office history using archival databases. Provides chronological postmaster succession from 1871-1928, including: Alexander Cameron, John MacNaughton, George Fowlie, Mrs. Marjorie Fowlie, Jubal Watling, A.E. MacDonald, Elmer Glendenning (Nov 1914-Aug 1916), and Donald MacNaughton. Don verifies his belief that his parents Elmer and \"Mum\" ran the post office between 1914-1916, using this data point to clarify family timeline. Notes parents were in Tennessee 1911-1913, then New Haven, Conn. (daughter Lillian born Jan 8, 1917), suggesting a return to Little Branch between jobs. Also documents the separate Watling Post Office (1911-1928). Identifies Aunt Tine MacKenzie as likely running the post office at Jessie MacDonald house between first husband Tom Adams' death (1902) and second marriage to John MacKenzie (1907).",
  "content_preview": "Little Branch Post Office\n\n\n\n\nThe Archives has a database, searchable through the Internet, on post offices and postmasters. In checking the Little Branch Post Office, I found the following:\n\nPostmaster\t\tDates\t\t\t\tCause of vacancy\n\nAlexander Cameron\t1871-11-01   to 1876-03-30\tResignation\n\nJohn MacNaughton\t1876-08-01 to 1883-08-20\tResignation, closed\n\nAlexander Cameron\t1884-11-01  to 1887-03-22\tResignation\n\n           (Re-opened)\n\nGeorge Fowlie\t\t1887-09-01 to 1899-10-02\tDeath\n\nMrs. Marjorie Fowlie",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "marson-margaret-glendenning",
  "title": "Marson, Margaret Glendenning",
  "summary": "Boothbay Register obituary from December 27, 1956 of Mrs. Margaret Glendenning Marsen, age 63, wife of Lucas Marsen of Boothbay Harbour and Wauchula, Florida. Born Canobie, New Brunswick; graduate of Sisters' Hospital Lewiston as registered nurse. Served overseas in WWI with Harvard Unit and re-enlisted with Canadian Medical Unit. District health worker in Portland for years. Survived by husband Lucas and brother Guy Glendenning of Bowling Green, Florida, plus numerous nephews/nieces. Body entombed at Ocean View Cemetery pending spring services. Extended family.",
  "content_preview": "The Boothbay Register carried the following on December 27, 1956\n\n \n\nMrs. Lucas Marsen\n\n \n\nMrs. Margaret Glendenning Marsen, 63, wife of Lucas Marsen, Oven's Mouth, Boothbay Harbour and Wauchula, Fla. Died at Memorial Hospital, Lakeland, Fla., Wednesday, December 19, following surgical treatment.\n\nMrs. Marsen, a graduate of Sisters' Hospital, Lewiston, as a registered nurse, was born in Canobie, New Brunswick.  She went overseas in World War I with the Harvard Unit and re enlisted on her return ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mary-postmaster-s-desk",
  "title": "Mary - postmaster's desk",
  "summary": "Don writes to Mary about an antique postmaster's desk from Hexham, New Brunswick with family/community connections. He traces the desk's history through Bob and Ira MacDougall and suggests it be preserved as local history, offering to help contact the NB Archives. This anecdote reveals Don's attention to family and community heritage.",
  "content_preview": "April11, 2009\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHappy Easter\n\n\n\n\nGreat to talk with you the other night and to know that you are on the mend.  It won’t be long now until you’ll be thinking of opening your cottage although the snow in the forecast is not very spring-like.\n\n\n\n\nI’ve been intending to mention the old postmasters desk in your garage but forgot each time I visited so decided to send this note.  Since I am mailing this to your Black River address, I will also send a copy to Jeannie in case you are still",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mckenzie-settlement",
  "title": "McKenzie Settlement",
  "summary": "Brief genealogical note on the naming and land settlement of McKenzie Settlement. Don speculates that the settlement was named after John and Roderick MacKenzie, who received land grants in 1871 and 1873 respectively. Questions whether Roderick was the Roderick MacKenzie who married his great-grandfather's sister Annabelle MacDonald. Notes John K. MacKenzie received lot #163 (100 acres) in 1907, possibly the \"Aunt Tine's second husband\" mentioned elsewhere. Records that Mary Anderson received 300 acres at the Little Branch end of the McKenzie Road in 1909.",
  "content_preview": "McKenzie Settlement was likely named after John and Roderick MacKenzie who were each granted 100 acres there in 1871 and 1873.  (Could this have been the Roderick MacKenzie who married my Great Grandfather=s sister, Annabelle MacDonald?  John K. MacKenzie gas granted lot #163 (100 acres) in 1907.  Would this have been Aunt Tine= second husband?  In 1909 Mary Anderson was granted 300 acres of land at the Little Branch end of the McKenzie Road",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "meadows-to-little-branch",
  "title": "Meadows to Little Branch",
  "summary": "A historical narrative of Don's grandparents' transition from the Meadows to Little Branch. Documents the November 13, 1901 agreement wherein Jubal and Grace Watling (with their four sons George, John, James, and Ernest as parties) took possession of John MacDonald's property at Little Branch, assuming lifelong support obligations for Elspeth (Jardine) MacDonald and her son James. Notes Elspeth's death on September 12, 1907, and James's death on April 1, 1923. Clarifies that the agreement did not include the Jessie McDonald property where Norman Glendenning later lived. Shows the family's legal and caregiving relationships within the community.",
  "content_preview": "Meadows to Little Branch\n\n\n\n\nOur Grandfather, Jubal Watling, lived at the Meadows; he married Grace MacDonald who lived at Little Branch – where Neil Watling now lives.  Grandmother’s father, John, died in 1900, I think, and her mother, Elspeth, was not well.  In addition, James, Grandmother’s brother had inherited the farm when his father died, was not married, was living at home but was not able to operate the farm.  As best I can interpret, the land did not include the Jessie McDonald propert",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "meadows",
  "title": "Meadows",
  "summary": "Genealogical and land settlement documentation of \"The Meadows\" area (mother's birthplace, though post office was Black River). Provides detailed land grant records starting from Route 11 on the south side of river moving west (1833-1883), including grants to Terrence Cook, Patrick Smith, Richard Hutchison, Gardiner Archibald, Jubal Watling Jr., Donald Cameron, and Donald McBeath. Lists north-side properties granted to J. Edge (1842) and multiple McNaughtons (Alexander, John, Malcolm with 200+ acres each, granted 1822-1828). Notes conflicting information about Don's own lot (#4 on Meadow Brook). Concludes with observations that land grants were made later and more gradually at Meadows than at Little Branch, and that poorer south-side land presumably explains the settlement's eventual disappearance.",
  "content_preview": "Land\n\tat the Meadows\n\t\n\n\n\n\t\n\t\nMy\n\tmother always referred to the place where she was born as The\n\tMeadows; the Post Office, however, would have been Black River.  The\n\tmap on the reverse side shows the location of the Watling property\n\tand some the properties immediately surrounding it.  Starting at\n\tRoute 11 on the south side of the river and moving west we find:\n\t\n\n\n\n\t\n\t\n\n\t26   Terrence Cook 150 Ac. \n\t\t1833-07-24\n\t\n\n\t27   Patrick Smith 112 Ac\n\t\t1838-12-21\n\t\n28\n\t  Richard Hutchison   100 Ac 1849",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "memory",
  "title": "Memory",
  "summary": "Humorous story about two elderly people (widower and widow) meeting at a community supper in a Florida mobile home park. After the widower proposes and the widow says yes, he cannot remember her response the next morning and must call to confirm. She had also forgotten who asked her. A charming tale celebrating memory loss, romance, and humor in later years. Found in Family Tree Maker folder (possibly misfiled), suggesting this sentimental story may have resonated personally with Don during his own later years. Likely represents either creative writing or a favorite story Don wanted to preserve.",
  "content_preview": "This is a story of two elderly people living in a mobile home park  \n\nin Florida.  He was a widower and she was a widow.  They had known  \n\none another for a number of years.\n\n\n\nOne evening there was a community supper in the Club House, and the  \n\nwidower and widow made a foursome with two other singles.\n\n\n\nThey had a wonderful evening and spirits were high.  The widower  \n\nsent a few admiring glances across the table, and the widow smiled  \n\ncoyly back at him.\n\n\n\nFinally, he plucked up his cou",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "mills-1",
  "title": "Mills-1",
  "summary": "Letter from Art (family correspondent) to Don about Miramichi Regional High School history, early bus services, babbit bearing manufacture by cousin Alexander Mills, and MRHS athletic patches from 1949-1950. Reflects Don's role as family historian receiving genealogical contributions.",
  "content_preview": "Hi Don;\n\nYou have had  a busy winter,111,112 and 113 very interesting,especially info,re Miramichi Regional High Busses etc.Sister Marg attended in those early days .She boarded one winter in Bayside then moved to Chatham,and lived with Uncle Douglas McLeod for the remainder .I was amazed to read The Godfrey busses only began in 1944,this was certainly a great service to the Comunities of Miramichi Bay.\n\nBABBET-now  here is something I know about in spite of my non-mechanical mind .My Dear Fathe",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "nancy-harter-2020",
  "title": "Nancy Harter-2020",
  "summary": "A warm family letter from Don to his niece Nancy Harter, recounting family news, Carol's recent health challenges (pneumonia), updates on their children and grandchildren, and reflecting on shared memories. The letter shows Don's family bonds and concern for younger generations, including his first great-grandchild Astrid.",
  "content_preview": "October 11, 2020\n\n\n\n\nDear Nancy:\n\n\n\n\nThanks for your newsy note.\n\nGreat to hear from you\n\nThought of sending an Email but not sure that I have your correct address – (katybug1997@att.net - ?)  Let me know if this is correct, please let me know and we’ll keep in touch via Email.  Mine is more complicated – dglend@pei.sympatico.ca\n\n\n\n\nWe are doing ok; Carol was had pneumonia with complications last summer; almost did not make it. Is home now; can look after herself but tires easily and rests a lot",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "neighbours-2023",
  "title": "Neighbours 2023",
  "summary": "A directory of 15 lots in the Glenway subdivision with owners' names and phone numbers. Don and Carol are listed as Lot 10 (147 Glenway Drive, 902-651-2186). Notable neighbours include Iain and Annette Galloway (Lot 9), Gordon and Elizabeth Lang (Lot 1), and Brenda and Brian Reid (Lot 14). Also notes Carol Glendenning as Lot 13 owner. Shows Don maintained detailed knowledge of his community at the cottage.",
  "content_preview": "Glenway Drive\n\nEarnscliffe\n\nPEI C0A 2E0\n\n.\n\n\n\n\nLot \tCivic No.\tLot owners\t\t\t\tTelephone \t\n\n\t\t\n\n\n\n\n1\t\t\tGordon and Elizabeth Lang\t\t626-8180\n\n\n\n\n2\t\t\tDon and Aileen Cameron\t\t\t\n\n\n\n\n3\t\t\tKaren McQuaig\n\n\n\n\n4\t\t\tWally and Valerie Ford\t\t651-2080\n\n\n\n\n5\t\t\tMacCallum Family\n\n\n\n\n6\t\t\tRoland and Carol McInnis\n\n\n\n\n7\t\t\tArleon Kelley and Donna Meinhard \t651-275\n\n\n\n\n8\t\t\tPaul and Coleen Norris\n\n\n\n\n9\t\t\tIain and Annette Galloway\t\t651-2241\n\n\n\n\n10\t147\t\tDon and Carol Glendennig\t\t651-2186\n\n\n\n\n11\t\t\tAnnette Galloway\n\n\n\n\n12\t\n\n\n\n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "new-watling-information",
  "title": "New Watling Information",
  "summary": "Don's genealogical research on the Watling family, comparing census data with family records. Discusses Jubal Watling (husband of Susan Leach) from the 1841 PEI census and variations in available information, particularly noting the difference between two different Jubals and determining that Susan may have died and Jubal remarried to Louisa. The analysis compares Jubal's age, occupation (mason), and landholdings to piece together family history. Written by Don as genealogical research notes.",
  "content_preview": "New Watling Information\n\n\n\n\nJanet Watling shows Jubal and Susan with two additional children – John and Susannah.  Any further information? Dates?\n\n\n\n\nPrince Edward Island Archives show a Jubal Watling living in Lot No. 52 at the time of the 1841 census.  Lot 52 is at the Eastern end of PEI near but not including Montague and Cardigan.\n\n\n\n\nAccording to the 1841 census, Jubal Watling was between 45 and 60 years of age, head of the family, his trade or occupation was that of a mason, he had 100 ac",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "photo-picnic",
  "title": "Photo-picnic",
  "summary": "A photograph of the St. Paul's Church group en route to a picnic at Bayside, featuring young Don Glendenning, his cousin Elinor Glendenning, and other Black River families (Camerons, Watlings). The image captures community and family connections in Don's childhood.",
  "content_preview": "ST. PAUL’S PRESBYTERIAN CHURCH\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn the way to church picnic at Bayside\n\n\n\n\n\n\n\n\nFrom the left: Unknown, Janie Cameron, Iona Cameron, Unknown,\nUnknown, Roy Watling George Watling, Elinor Glendenning, , Kate\nWatling, Don Glendenning Marjorie Watling, Unknown, Unknown\n\n\n\n\n\n\n\nGlendenning\ncollection",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "place-names",
  "title": "Place names",
  "summary": "A detailed historical reference documenting place name origins in the Miramichi region, including information about the Black River area's settlement in 1820 and original land grants from 1812. Includes family anecdotes about local place names like Ken's Hill and context about the Glendenning family's arrival in the area.",
  "content_preview": "________\n\n\n\tEarly Names\n\t\n\n\n\n\t\n\t\nThe\n\tfollowing information about early names of the area was taken from\n\tAGeographical\n\tNames of New Brunswick, 1875.@\n\t\n\n\n\n\t\n\t\nMiramichi\n\twas Aprobably\n\tnamed by Cartier in 1535 from Montagnais Maissimeu\n\tAssi A\n\tmeaning Micmac Land.   Northumberland\n\tStraight appears to\n\thave been named by Admiral Colville\n\taround 1877 after his\n\tflagship, Northumberland.  Before that, it was known as\n\tRed Sea. \n\tNorthumberland County\n\twas established in 1785 and was probably n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "publications-2015-2015-09-29t13-03-27",
  "title": "Publications 2015@2015-09-29T13;03;27",
  "summary": "A catalog of Don's genealogical and historical publications including Glendenning Roots, Family Chronicles volumes, The Neighbourhood, and Presbyterians in Black River. These extensively documented works (totaling approximately 800+ pages) represent Don's lifelong commitment to preserving family history and the cultural heritage of Black River, New Brunswick, his ancestral home.",
  "content_preview": "PUBLICATIONS\n\n\n\n\nBLACK RIVER HISTORY AND GENEALOGY \n\n\n\n\n\n\n\n\n\n\nPublications:\n\n\n\n\n1\tGlendenning Roots - Background and photos on the life and times of Elmer and Jane (Watling) Glendenning with a focus on their years in the USA.  It also lists ancestors for each as well as their descendants.  (Approximately 200 pages bound.)\n\n\n\n\nCarol Louise (Chesney) Glendenning - Background information and photos of Carol Chesney, her family and friends in Illinois.  (Approximately 100 pp bound)\n\n\n\n\nFamily Chroni",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "publications-2015-2015-09-29t22-30-36",
  "title": "Publications 2015@2015-09-29T22;30;36",
  "summary": "An updated version of Don's genealogical publications catalog, listing extensive works on the Glendenning and Watling families, including ancestry back to John Glendinning (born 1755 in Scotland) and Jubal Watling (born ca. 1790 in England). This comprehensive genealogical documentation demonstrates Don's meticulous commitment to family history preservation.",
  "content_preview": "gen\n\n\n\n\nPUBLICATIONS\n\n2015\n\nBLACK RIVER HISTORY AND GENEALOGY \n\n\n\n\n\n\n\n\n\n\nPublications:\n\n\n\n\n1\tGlendenning Roots - Background and photos on the life and times of Elmer and Jane (Watling) Glendenning with a focus on their years in the USA.  It also lists ancestors for each as well as their descendants.  (Approximately 200 pages bound.)\n\n\n\n\nCarol Louise (Chesney) Glendenning - Background information and photos of Carol Chesney, her family and friends in Illinois.  (Approximately 100 pp bound)\n\n\n\n\nFa",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "re-the-island-register-adams-file-2",
  "title": "Re_ The Island Register - Adams File-2",
  "summary": "Email correspondence (August 11, 2006) between Jane Adams and Don Glendenning discussing WWI military service of William Adams. Personally written by Jane. Analyzes census and obituary data to identify which William Adams served in WWI, narrowing down possibilities between two candidates born 1877 and 1896. Includes Annie Pardon Adams's obituary noting her meeting husband William during WWI and service in British Red Cross. Shows Don's detailed genealogical research methods and family network documentation work.",
  "content_preview": "From: \"Jane Adams\" <wadams@golden.net>\nTo: \"Don Glendenning\" <dglende@auracom.com>\nSubject: Re: The Island Register - Adams File\nDate: August 11, 2006 12:38 AM\n\nI don't have any information to confirm whether the William Adams b. August 1877 had served in WWI.  However, my husband's grandfather was a William Adams b. Jan 1896 - I believe he served in WWI as he met his wife during this war when he was in England (wife's obituary below).  Given that WWI was circa 1914 - 1919, this would make the W",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "revised-friends-2",
  "title": "Revised - Friends-2",
  "summary": "Updated version of Carol's friends contact list (19 entries), appears to be cleaned up and reorganized version of File 7. Includes Marjorie Ballem, Helen Bartlett, Maida Campbell, Jean Carr, Elva Costello, Susan Green, Margie Jardine, Arleon Kelley, Charlotte Lantz, Eve Leon, Ethel MacLeod, Charlotte MacLeod, Marion Morrison, Wayne & Sandra Rhodenizer, Marg Romcke, Kay Smith, Alma Steeves, Wayne Storey. Represents Carol's close social circle.",
  "content_preview": "Friends 2\n\nTelephone numbers\n\n\n\n\nBallem, Marjorie\t\t\t\t\t892-0410\n\nBartlett, Helen\t\t\t\t\t894-3387\n\nCampbell, Maida\t\t\t\t892-5820\n\nCarr, Jean\t\t\t\t\t\t566-8905\n\nCostello, Elva\t\t\t\t\t566-1360\n\nGreen, Susan\t\t\t\t\t676-3192\n\nJardine, Margie\t\t\t\t\t569-2663\n\nKelley, Arleon\t\t\t\t\t902-651-3311\n\nLantz, Charlotte\t\t\t\t\t892-6832\n\nLeon, Eve\t\t\t\t\t\t892-8690\t\n\nMacLeod, Ethel\t\t\t\t\t894-4880\n\nMacLeod, Charlotte\t\t\t\t894-3777\n\nMarnie\t\t\t\t\t\t\t367-0336\n\nMorrison, Marion\t\t\t\t892-1446\n\nRhodenizer, Wayne & Sandra\t894-5054\n\nRomcke, Marg\t\t\t\t\t892-198",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "roma-insert-2",
  "title": "Roma insert 2",
  "summary": "Comprehensive promotional document for the First Annual Fundraising Dinner celebrating fifteen years of CFPEI service and over one million dollars in grants. Explains administrative costs shortfall necessitating fundraising dinner. Details $90 ticket price, reception with steamed mussels and period bread, multi-course dinner with wine inclusion, Singing Strings entertainment, and silent auction. Lists all 50+ funds under management including Glendenning Family Fund. Names board of directors and professional advisors.",
  "content_preview": "Celebrating\nfifteen years of service\n\n\nand\ngrants in excess of  a million dollars  to Islanders and Island\norganizations \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFIRST ANNUAL FUNDRAISING DINNER\n\n\n\n\n\n\n\n\n\n\n\n\nROMA AT THREE RIVERS\nHISTORIC SITE\n\n\nWednesday, August 20, 2008 \n\n\n\n       Ticket\nPrice -\n$90 per person ($50 tax receipt)\n\n\n       Reception:\n  Steamed Mussels and Period Bread\n\n\n       Cash\nBar:     \n6:00 to 7:00\n\n\n\n\n\n\n\n\n        Dinner:\n        7:00 p.m.\n\n\nSquash Soup              \nBeet and Pearl Onion Soup\n\n\nChoice",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "roma-insert-8-x-11-master",
  "title": "Roma Insert 8 x 11 Master",
  "summary": "Marketing insert for Roma event featuring CFPEI mission statement \"Connecting People Who Care with Causes That Matter.\" Shows board of directors including Don Glendenning, C.M. Lists 50+ funds under management including Glendenning Family Fund. Details August 20, 2008 dinner at $90/person with $50 tax receipt, featuring steamed mussels reception, choice of roast pork or salmon, and entertainment by Singing Strings.",
  "content_preview": "COMMUNITY FOUNDATION OF\n\n\nPRINCE EDWARD ISLAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“CONNECTING\nPEOPLE WHO CARE \n\n\n\nWITH\nCAUSES THAT MATTER”\n\n\n\n\n\n\n\n\nThe Foundation is a\nvolunteer driven, non-profit, charitable organization whose mission\nis to improve the quality of life on P.E.I. through the creation and\nbuilding of endowment based, charitable trust funds.\n\n\n\n\n\n\n\n\nThe administration of the\nFoundation is funded by a small trust fund administration fee and\ndonations from directors, i",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "roots",
  "title": "Roots",
  "summary": "Comprehensive genealogical work by Don on the Watling surname origins, tracing it to Sussex, England and linking it to the Roman Watling Street. Documents the Watling coat of arms, discusses notable historical Watlings including Thomas Watling (an 1792 landscape painter in Australia) and pirate Captain George Watling. Traces Don's direct ancestor Jubal Watling (married Susan Leach in 1814 in Suffolk) and explores family origins in Norfolk/Suffolk, England. Essential genealogical reference authored by Don showing his meticulous historical research and family pride.",
  "content_preview": "WATLING ROOTS\n\n\n\n\nOrigin of Name\n\n\n\n\nThe first record of the name was found in Sussex, England somewhere between London and Dover.  It is likely that the name arises from Wartling which was a hamlet in the area but others believe that it was associated with Watling Road, the great Roman Road, which started near Dover, passed through Canterbury, turned north at London and went as far as St Albans     It is thought, furthermore, that the Watlings were Vikings who landed in Northern Scotland in 870",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "russell-cameron",
  "title": "Russell, Cameron",
  "summary": "Moncton Times clipping reporting death of D. Cameron Russell, age 72, of Point au Carr, Northumberland County, died on arrival at Hotel Dieu Hospital Chatham. Born Point au Carr, son of Ernest and Burgess Cameron Russell; worked as farmer, fisherman, carpenter. Member St. Paul's Presbyterian Church Black River (elder, active in church activities). Miramichi Highland Society member. Wife was former Venetia G. (Don's sister). Survived by wife, one daughter (Donna), two sons (Leonard PEI, Glenn Newcastle), two sisters, one brother, and four grandchildren. Important family connection.",
  "content_preview": "A clipping, believed to come from the Moncton times reports:\n\n\"D.C. Russell\t\tPOINT AU CARR (Special) - The death of D. Cameron Russell of Point au Carr, Northumberland County, occurred on arrival Wednesday at Hotel Dieu Hospital, Chatham.  He was 72.\n\nBorn at Point au Carr, he was a son of the late Ernest and Burgess (Cameron) Russell, and was a farmer, fisherman and carpenter.\n\nHe was a member of St. Paul's Presbyterian church, Black river, and an elder of the church.  He took an active part in",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "school-cameron-school",
  "title": "School Cameron School",
  "summary": "Don documents the Cameron School at Middle Black River, built around 1845 when the original school district was divided. The school was named after the many Cameron families in the immediate area. By 1939, it became one of seven schools in the newly-created Miramichi Rural High School district, continuing to offer grades 1-6 while the high school provided grades 7-11. This reflects the educational consolidation Don witnessed in the late 1930s.",
  "content_preview": "Cameron\nSchool\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCameron\nSchool courtesy of Elby and Shirley Donnelly\n\n\n\n\n\n\n\n\n\n\n\nAbout\n1845, the district was divided with one school being build at Middle\nBlack River and another at Bayside (now Miramichi).  The school at\nMiddle Black River, the Cameron School, was so named because of all\nof the Camerons found in the community.\n\n\n\n\n\n\nIn\n1939, the Cameron School became one of seven schools in the\nnewly-created Miramichi Rural High School district in 1939.  When the\nMRHS opened, grade",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "school-victoria-school",
  "title": "School Victoria School",
  "summary": "Don traces Victoria School's history from early Black River instruction in Archibald Cameron Sr.'s barn, followed by home-based teaching. A formal school was erected in 1825 near the lane now leading to St. Stephen's Church. Around 1845, the district divided with Cameron School at Middle Black River and another at Bayside. Victoria School's construction date is unknown. The original Victoria School burned in the late 1940s and was replaced; the latter building later served as Mrs. Louise MacDougall's residence. In 1939, Victoria School became one of seven schools in the Miramichi Rural High School district, offering grades 1-6. This documents educational infrastructure evolution across more than a century.",
  "content_preview": "Victoria School\n\n\n\n\n\n\n\n\n\n    \nPhoto\ncourtesy of Richard MacDougall\n\n\n\n\n\n\nMost\nof the early settlers in Black River spoke Gaelic.  Based on the work\nof A. W. McDougall, Black\nRiver and its First Settlers,\nthe first instruction in Black River was provided in a barn belonging\nto Archibald Cameron, Sr.  Following this, teachers provided\ninstruction in their own homes.  In 1825, residents petitioned\nsuccessfully for a school which, as I understand it, was erected near\nthe lane now leading to St. Step",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "shuttle-grandma-s",
  "title": "Shuttle Grandma's",
  "summary": "An expanded, more detailed version of the shuttle narrative (FILE 13), dated March 14, 2016, providing deeper historical context. Includes information about William Harley in Courtmacsherry, County Cork, Ireland, and the family's 1820s migration. Describes the weaving trade in pioneer Canobie, where John Glendinning operated one of the first looms. Provides technical description of the shuttle (12 x 1 1/8 x 7/8 inches, walnut wood, with tapered pirn). Traces object's path through Venetia (in Maine/Florida) to Cornelia to Don. Deeper genealogical and material culture documentation than FILE 13.",
  "content_preview": "Grandma’s\nShuttle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShuttle:\nThe vehicle used to traverse the weft from selvedge to selvedge –\nS. C. Lutton\n\n\n\n\n\n\n\nToday,\nMarch 14, 2016, my first cousin, Cornelia (Glendenning) Traetta\npresented me with a shuttle that belonged to our Great Grandmother,\nMargaret (Harley) Glendinning; this is my understanding of the story.\n\n\n\n\n\n\nMy\nGreat Great Grandfather, William Harley was born in Worcester,\nEngland but moved to Courtmacsherry, County Cork, Ireland, before the\nturn of the century ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "siblings",
  "title": "Siblings",
  "summary": "A genealogical plate (PLATE 3) showing Don's father Elmer Alton Glendenning (1875-1938) and his nine siblings, with birth and death years: Venetia Emily (1872-1960), John Franklin (1876-1937), Mary Ann May (1879-1955), Leonard Garfield (1881-1958), Alda Jane Maud (1883-1957), George Raymond (1885-1970), Guy Wellington (1889-1967), Margaret Violet (1893-1956), and Chipman Lowe (1897-1948). Document compiled by Don on March 23, 2008, with photo placeholders. High value for understanding Don's paternal family structure.",
  "content_preview": "Glendenning\n\tFamily Memories\n\nPLATE\n3:\tElmer’s Siblings\n\n\n\t\n\n\n\t\n\t\n\n\n\t\tPhoto not available\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nVenetia\n\tEmily Glendenning\n\t\n1872-1960\n\t\n\n\n\n\t\n\t\n\n\n\t\nElmer\n\tAlton Glendenning\n\t\n1875-1938\n\t\n\n\n\n\t\n\t\n\n\n\t\t\n\n\n\t\t\n\t\t\nPhoto\n\t\tnot available\n\t\n\n\n\t\n\t\n\t\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nJohn\n\tFranklin Glendenning\n\t\n1876-1937\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\nMary\n\tAnn May Glendenning\n\t\n1879-1955\n\t\n\n\n\t\tPhoto not available\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "sources-of-information",
  "title": "Sources of Information",
  "summary": "A comprehensive bibliography and source list for \"Glendenning Family Memories,\" dated June 19, 2005, written by Don Glendenning. Lists books, maps, family documents, church records, archives, newspapers, and personal contacts used in researching the family history. Includes references to his own work on \"Presbyterians in Black River\" (2004). Provides contact information (62 Queen Elizabeth Drive, Charlottetown; 902-892-5859; dglende@attglobal.net). **NOT originally written by Don** — this is a reference/administrative document.",
  "content_preview": "SOURCES OF INFORMATION\n\n\n\n\n\n\n\n\n\n\nInformation for this document was drawn from many sources, including:\n\n\n\n\nBooks\n\nBlack, George F, Surnames of Scotland, New York Public Library, 1946\n\nSynoptical Family History Giving Sketches of the Glendonyn- Glendening- Clendening- Etc. Family. Author and Date not known but obtained from the Archives in Charleston, West Virginia.\n\nBurkes Peerage\n\nMacLysaght, Edward, The Surnames of Ireland, Irish University Press, 1969\n\nSmith, Elsdon, New Dictionary of America",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "st-paul-s",
  "title": "St. Paul's",
  "summary": "History of St. Paul's Presbyterian Church in Black River Bridge, opened July 21, 1930, after 1925 Church Union. Succeeds earlier St. Stephen's Presbyterian (1836). Documents Don's local religious heritage.",
  "content_preview": "St. Paul’s Presbyterian Church\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrior\nto 1836, residents of Black River traveled to Bay du Vin to attend\nchurch which, although nominally Presbyterian, was used by other\ndenominations as well.  In 1836 a new church, St Stephen’s\nPresbyterian, was opened in Black River and was situated within the\nbounds of what is now the Black River/St Stephen’s cemetery.  The\noriginal church building was replaced in 1906.\n\n\n\n\n\n\nFollowing\nChurch Union in 1925, St. Step",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "st-paulls-congregation-1",
  "title": "St. Paulls Congregation-1",
  "summary": "Documentation of a photograph from St. Paul's Presbyterian Church, Black River, NB, showing young people following a Christmas service in the mid-1950s. Identifies multiple Glendenning family members: Margaret Glendenning, Betty Ann Glendenning, Jeannie Glendenning, and Eileen and Judy Glendenning. Also names Rev. Henry Russell (Minister) and others. Courtesy Don Glendenning, suggesting this was from his personal archive and family connections to Black River area.",
  "content_preview": "Black River Collection\n\n\n\n\n\n\n\n\n\n\n\n\nSt. Paul’s Presbyterian\nChurch\n\n\n\n\n\n\n\nNotes:\nYoung people at St. Paul’s Presbyterian Church following Christmas\nservice in mid-1950’s.\n\n\n\n\n\n\nBack\nrow: \tRev. Henry Russell, Minister\n\nFourth\nrow:\tLee Burnham, Unknown, Alexander Newton, Margaret glendenning,\nSandra Taylor\n\nThird\nRow:\tUnknown, Unknown, Unknown, Unknown, Brian Russell\n\nSecond\nrow:\tBetty Ann glendenning, Unknown, Unknown, Donna, Unknown, Jeannie\nGlendenning, Newton\n\nFront\nRow:\tUnknown. Eileen and Jud",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "st-pauls-annivrsary",
  "title": "St Pauls Annivrsary",
  "summary": "Don's personal recollection dated July 5, 2025, reflecting on his life at St. Paul's Presbyterian Church in Black River Bridge, New Brunswick. He participated in the church's official opening on July 20, 1930 (one year after his birth September 8, 1929). Details family's central role: father's involvement in construction, mother as active member, siblings' contributions, and his own marriage ceremony at the church. Describes the church's welcoming atmosphere, shared ministers serving multiple communities, and formative youth experiences including Bible school, vacation school, and church camps. Mentions key family members Aunt Kate and Uncle Jim Watling. Reflects warmly on Black River as a good community to grow up in.",
  "content_preview": "Memories of \n\nSt. Paul’s Presbyterian Church\n\nBlack River Bridge, NB\n\nJuly 05, 2025\n\nOn this anniversary occasion, I am pleased to provide a few recollections about my life and times in St. Paul’s Presbyterian Church in Black River Bridge, New Brunswick. Although I actually participated in the official opening on July 20, 1930, my memories of the event are a bit hazy.  I understand,furthermore, that older siblings were actually at a church event when I arrived at Little Branch on a Sunday evenin",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "taylor-earl",
  "title": "Taylor, Earl",
  "summary": "Newspaper obituary for Earl Taylor (age 53, died by accident at Black River), husband of Elinor Glendenning. Third-party document. Important family document: Earl was David Taylor's father and married into the Glendenning family. Lists multiple children including daughter Sandra (Mrs. Eugene Shea) and details of extended family connections in the Miramichi area.",
  "content_preview": "A clipping, believed to be from the Moncton times, reports the following:\n\n\n\n\nFuneral For Victim of Road Mishap\n\nBLACK RIVER (Special) - The funeral of a black river man who died in hospital Tuesday of injuries received when hit by a car, will be held today at 2:30 p.m. from St. Pau's Presbyterian Church here.\n\nEarl Taylor, 53, was struck by a car in front of his home just after he steeped from a friend's vehicle, Newcastle RCMO said.  The mishap occurred at 6:15 pm. and Mr. Taylor died in Miram",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "telephone",
  "title": "Telephone",
  "summary": "Describes telephone service in Black River during Don's childhood, contrasting the New Brunswick Telephone Company serving Black River with the 'Government line' serving areas down river to Escuminac. Details party line communication (exchange 1900, ring 4), battery-powered phones, and community dynamics of shared phone service. Recounts anecdotes including neighbors using their phone for emergencies, people eavesdropping for news, and a notable story of a neighbor who tied the receiver to her rocking chair. Reflects early 20th-century rural communication infrastructure.",
  "content_preview": "Telephone Service\n\n\n\n\nBlack River was served primarily by the New Brunswick Telephone Company; on the other side of the Little Branch River and all the way to Escuminac, phone service was provided by the “Government line”.  \n\n\n\n\nThe Government Line always seemed to be out of order.  That meant that people from down river frequently came to our house to use the phone; that also meant that emergency phone calls often came to our place with a request that they be delivered.  I cannot ever remember ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "the-united-church-manse",
  "title": "The United Church Manse",
  "summary": "Brief note about the United Church Manse in Black River, built in 1880, with a photo credited to Glendenning taken May 13, 2005. Don visited Black River in 2005 to document historical buildings related to his birthplace and family heritage.",
  "content_preview": "The United Church Manse\n\n\n\n\n\n\n\n\n\n\n\nPhoto by Glendenning on May 13, 2005\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlthough\nthe nearby church was built in 1836, the manse was not constructed\nuntil 1880.  In 19xx a new manse was constructed nearby and the\noriginal manse became the property of the Donnelly Family.",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "to-do-2",
  "title": "To Do-2",
  "summary": "To-do list dated October 23, 2015, tracking Education 20/20 priorities including newsletter production, genealogy research (with Alton), learning framework development, film screening (\"Most Likely to Succeed\"), and fundraising. References key figures like Wayne Thibodeau (Guardian contact), Fred Osborn, MLA Jordan Brown, and UPEI's Michelle Moffat. Personal notes mention iPad and wireless setup challenges.",
  "content_preview": "Mydoc/ToDo\n\nOctober\n23 , 2015\n\nGENERAL\nTO DO\n\n\n\t\n\n\n\t\n\t\n20/20\n\t\nActive\n\t\n\t\t\n\nWayne\n\t\tThibodeau-Guardian\n\t\t\n\nPaul\n\t\tMcNeill\n\t\t\n\nGenealogy-Alton\n\t\t\n\nImelda-award\n\t\t\n\nLearning\n\t\tframework\n\t\t\n\nKeizer\n\t\t\n\nStatistics\n\t\t\n\nEduc\n\t\tconferences\n\t\t\n\nPremier\n\t\t\n\nAmanda\n\t\t–tough stuff\n\t\t\n\nTom-1\n\t\t role\n\t\t\n\nQualification\n\t\tauthority\n\t\t\n\nWindsor\n\t\t\n\nNewsletter\n\t\t34\n\t\t\n\n\n\t\tPhotos\n\t\tfor PR purposes\n\t\t\n\n\n\t\tJoAnne\n\t\tMcCabe-Reading\n\t\t\n\nLisa-coffee\n\t\t\n\nPrinter\n\t\tcartridge\n\t\t\n\nDesign\n\t\ta learning centre\n\t\t\n\nCoding\n\t\t\n\n",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "together-in-usa",
  "title": "Together in USA",
  "summary": "Comprehensive historical narrative of Glendenning and Watling families' migration to USA and establishment in Tennessee during 1910-1913. Opens with post-WW2 context of Maritimer emigration patterns (woods work in Maine/New Hampshire initially, then year-round settlement). Describes Portland's historical significance as Atlantic & St. Lawrence Railroad terminus (\"Canada's winter port\"), industrial development (locomotives, docks, construction jobs), 1866 fire (1500 buildings destroyed, 12,000 homeless), Promenade grand homes. Chronicles Glendenning family's Portland settlement with siblings' roles and occupations. Extensively documents Elmer and Frank's cartage business (Glendenning Bros. & Co., 24 Hammond Street, ice delivery, general team work). Details Elmer's work progression in woods (Maine/New Hampshire near Skowhegan, Millinocket, Berlin; lumbering with horses; record lumber cut). Parallels with Jane Watling's Portland arrival (January 24, 1908, City Hall fire day), employment as nanny/housekeeper with Jennison family. Covers marriage ceremony (October 18, 1910 at Little Branch home of parents by Rev. George Grant), honeymoon in Montreal, residence in Bonny Eagle, Maine. Describes Jane's household journal/purchase record (January 1911 entries documenting domestic economy). Extensive section on Parksville, Tennessee: geographic/historic context (Polk County, Ocoee River, southeast of Chattanooga); technical details on dam construction (Ocoee No. 1 and No. 2 developments, Tennessee Power Authority documents); construction timeline (August 1910 commencement, February 1911 concrete placement, January 27, 1912 plant start); employment scale (1500+ workers); infrastructure (constructed town with waterworks, stores, hospital, police); concrete placement rates (12-15 hundred cubic yards daily). Details relocation from Ocoee No. 1 to Ocoee No. 2 (Caney Creek, May-October 1912). Contains repeated sections (FILE 8 duplicates FILE 5 and FILE 6 content). TRUNCATED in extraction (original ~6345 words).",
  "content_preview": "SOJOURN\nIN THE USA\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor\nyears, Maritimers flocked to the USA to find work; this trend did not\nreally change until after WW2 when Maritimers travelled west, first\nto work in the plants in Ontario but later to work in the oilfields\nof Alberta.  The Glendenning and Watling families were no exception. \nI am told three times a day, trains left Prince Edward Island and\nmade connections with trains to the ABoston\nStates.@\n\n\n\n\n\n\n\nMany\nMaritimers found their first jobs in the woods of Maine a",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "tombstone-margaret-virginia",
  "title": "Tombstone Margaret Virginia",
  "summary": "Correspondence (Nov 2011) between Don and St. John's Cemetery administrator regarding restoration of his sister Margaret Virginia's gravestone in Hampton, Virginia, buried 1918. Shows family care and connection to diaspora.",
  "content_preview": "November 12, 2011 \n\n\n\n\nMy father and mother, Elmer and Jane Glendenning, lived in Hampton, Virginia during the construction of the Langley Field and, in fact, had a daughter, Margaret Virginia buried in St. John’s Episcopal Cemetery. A number of family members, including myself, have visited the cemetery over the years. \n\nMy remaining siblings are wondering if the stone still exists, what kind of shape it is in and if it could benefit from restoration.\n\nIs it possible to arrange for someone to l",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "transferred-black-river",
  "title": "Transferred black River",
  "summary": "Email correspondence (2004-2005) with Janet Watling and Ron Robichaud about historical Black River/Miramichi bridges, early sawmills, and genealogical photo collection. Reflects Don's role as local historian and family network coordinator.",
  "content_preview": "From: \"Janet Watling\" <jewatling@yahoo.com>\n\nTo: \"Donald Glendenning\" <dglende@auracom.com>\n\nSubject: Re: Cameron Bridge\n\nDate: December 20, 2004 2:40 AM\n\n\n\n\nHi Don;\n\n \n\nIt's been ages since I heard from you. Glad to hear all is well in PEI. Are you ready for Christmas yet? I finished all my shopping on Saturday because I am working all week. I really have to spend this winter organizing my geneology and updating it. Maybe when Christmas is over and all the activity dies down. As for the picture",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "transferred-genealogy",
  "title": "Transferred Genealogy",
  "summary": "Email exchange with genealogist Ian Glendinning (Oct 2005) about William Glendinning ancestry in Scotland and Alice Carey Saulnier regarding genealogical research. Don receiving and sharing specialized genealogical findings from other researchers.",
  "content_preview": "From: \"Ian Glendinning\" <ian@glendinning.name>\n\nTo: \"Donald Glendenning\" <dglende@auracom.com>\n\nSubject: William Glendinning\n\nDate: October 24, 2005 11:47 AM\n\n\n\n\nHi Don,\n\nA bit more about William Glendinning son of John Glendinning and Mary Rae.\n\nThe entry in your father's family bible ties in very nicely with other information I have, to confirm it is the same person.\n\nIn 1855 a daughter Jane Glendinning was born on 9 Sep 1855 to William Glendinning and Grace Marshall.  The place of birth was g",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "us-relatives",
  "title": "US Relatives",
  "summary": "Documents information about Glendenning and Watling relatives who emigrated to or settled in the United States. Traces family connections including those in Maine, Massachusetts, and other eastern states. Provides genealogical context for the American branch of the family.",
  "content_preview": "USA Migration\n\n\n\n\nWe know the precise date that my mother landed in Portland (January 24,1908); we cannot say the same for my father.  We know, however, that he and one or more of his brothers ran a cartage business in Portland prior to 1910.  We also know that some of his first cousins by the name of Henry had moved to the Portland area prior to 1870 and that their mother, his Great Aunt Mary Anne (Harley) Henry moved there after her husband died (1970).  Dad also had first cousins by the name ",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "victoria-bridge",
  "title": "Victoria Bridge",
  "summary": "Email exchange (January 2006) between Richard MacDougall (a professional at the Canadian Hydrographic Service) and Dorothy & Bryan about nostalgic memories of Victoria Bridge near Black River. MacDougall recalls childhood adventures: playing in the bridge, fishing, climbing girders, and later removing roadblocks in 1969-70 during closure attempts. Memories include encounters with bootleggers and the physical characteristics of the wooden bridge. Shows Don's connection to local landmarks and community memories.",
  "content_preview": "From: MacDougall, Richard [MacDougallR@mar.dfo-mpo.gc.ca]\nSent: Saturday, January 14, 2006 12:02 PM\nTo: 'brydor@shaw.ca'\nSubject: Re: Victoria Bridge\n\nHi Dorothy\nThat bridge brings back lots of memories for me too. \n\nWe played in it - climbed the girders - went under the floor - fished from\nthe pier or the causeway or the wharf and peeked through the holes where\nboards were missing.\n\nThe floor boards \"flapped\" when a car went over and made a great din. The\nsounding the horses hooves and the iron",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "watling-donald-ernest",
  "title": "Watling, Donald Ernest",
  "summary": "Newspaper obituary for D. Ernest Watling Sr. (age 81) of Loggieville, died at Hotel Dieu Hospital after long illness. Third-party document. Born in Black River Bridge; son of Jubal and Grace MacDonald Watling. WWI veteran (26th Battalion) and WWII security guard at CFB Chatham. Survived by wife Alice MacLean and three sons including Ernest of Buffalo, NY. Key figure in extended Glendenning family genealogy.",
  "content_preview": "The following clipping was in the local newspaper:\n\n\n\n\n\"The death of D. Ernest Watling Sr. of Manse Lane, Loggieville, occurred Sunday at Hotel Dieu, here, following a long illness.  He was 81.  Born at Black River Bridge, he was the son of the late Jubal and Grace (MacDonald) Watling.\n\nHe attended Knox United Church, Loggieville, and was a veteran of the First Worls War, serving overseas with the 26th Battallion.  During the Second World War he was a security guard at CFB Chatham.  He was a mem",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "watling-genealogy",
  "title": "Watling Genealogy",
  "summary": "Email from Judy Watling (Apr 2008) sharing extensive Watling family research, photos, and obituaries from 1917, responding to Don's Family Chronicle publications. Demonstrates impact of his genealogical work on broader family research community.",
  "content_preview": "From: \"Judy Watling\" <watlingj@nbnet.nb.ca>\nTo: <don@glendenning.net>\nSubject: Watling Genealogy\nDate: April 26, 2008 6:36 PM\n\nHello : \n\nI am a great-granddaughter of Alexander MacNaughton Watling (son of Jubal Watling and Susan Leach) and his wife Catherine Kelly.  I am descended from their son John Gordon Watling and his wife Myrtle Dempsey (my grandparents).\n\nI have been following your \"Family Chronicle\" issues with great interest for several years now and was thrilled to see your last few is",
  "theme": "03-family-genealogy"
 },
 {
  "slug": "watling-notes-from-pei",
  "title": "Watling notes from PEI",
  "summary": "Genealogical notes compiled by Don on Watling family: census data (1881, 1891), vital statistics, marriage licenses, and church records (St. Paul's Anglican, Charlottetown). Demonstrates systematic archival research methodology.",
  "content_preview": "WATLING NOTES\n\n\n\n\nNotes from Don Glendenning\n\n\n\n\nCensus 1881:\tCharlottetown Royalty\n\n\t\t#436\n\n\t\tWatling, Charles \t34, painter, C of E\n\n\t\t\tSara Jane \t36\n\n\t\t\tWilliam A\t1\n\n\t\t\tJohn \t\t12\n\n\n\n\nDeath:\t\tWatling, Elizabeth\t(Mrs. Charles)\n\n\t\tMorning Guardian, June 30, 1901, p.1\n\n\n\n\nLouisa Watling:\tIslander, 1847, April 23, p2\n\n\t\t\t3 pounds, 0 shillings, 0 pence\n\n\n\n\nBaptism:\tWatling, William Ambrose\n\n\t\tb May 29, 1879, Charlottetown\n\n\t\tBaptized Sept 21, 1879 by A. Osborne\n\n\t\tFather Charles\n\n\t\tMother Sara Jane\n",
  "theme": "03-family-genealogy"
 }
]