[
 {
  "slug": "0-contents",
  "title": "0- Contents",
  "summary": "Another organizational overview presenting the structure for \"Reframing Education.\" This version emphasizes changing world contexts, essential skills (communication, technology, work), educational philosophy (beliefs, goals, principles), education services (governance, information, counselling, instruction, assessment, finance, professional development), systemic issues (mission/vision, accountability, assessment), and learners. Notably includes sections on training for employment, individual achievement records, and curriculum development with diverse voices represented.",
  "content_preview": "REFRAMING EDUCATION\n\nCONTENTS\n\n4-11-0\n\n\tIntroductory Pages\n\n  \nIntroduction\n  \nContents\n\n\n\n\n\n  \nOur changing world\n\n\n  \nLife roles\n  \nEssential skills, \n  \nCommunication\n  \nTechnology\n  \nWork\n  \nSkills, knowledge, attitudes- soft skills\n\n\n\n\n\n  \nEducation\n\n\n  \nBeliefs\n  \nGoals\n  \nPrinciples\n  \ncontext\n  \nLevels\n  \n, teach, curriculum\n\n\n  \nEducation Services\n\n\n  \nGovernance\n  \nInformation\n  \nCounselling\n  \nInstruction\n  \nAsssessment\n  \nFinance\n  \nProfessional Development\n\n\n\n\n\n  \nIssues\n\n\n  \nMissio",
  "theme": "10-creative-writing"
 },
 {
  "slug": "12-compo8-nents-of-an-education-system",
  "title": "12 Compo8 nents of an Education system",
  "summary": "This visual breaks down the seven essential components of a functioning education system: information/counseling services, formal institutions, community-based learning organizations, certification/qualification services, governance structures, resource materials, and qualified staff. The document reflects Don's systematic thinking about how education systems must be multifaceted and collaborative, serving diverse learner needs through multiple channels and institutional types.",
  "content_preview": "Visuals\n\nComponents of an Education system\n\n\n\n\n  \nInformation, counselling and advice for people who make decisions about their own or a family member’s education. \n\n\n  \nInstitutions, places with desks and chairs, for people who want or need formal instruction\n\n\n  \nCommunity based organizations such as libraries, youth organizations, access centres, employer training, service clubs, NGO’s and Itinerant teachers that provide instruction, information, tutoring, experience in non-formal education\n ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "14-education-definition",
  "title": "14 Education Definition",
  "summary": "This document compiles multiple authoritative definitions of education from diverse sources: general (any experience with formative effect), Good's definitions emphasizing positive social development, OECD (organic and sustained communication), and UNESCO (practices and outcomes). Don uses these definitions to establish a comprehensive conceptual foundation, positioning education as both personal development and social process. Defines \"learner\" as a person in the process of changing behavior.",
  "content_preview": "Education\n\n\t\n\n\n\tany\n\texperience that has a formative effect on the way a person thinks\n\tfeels or acts.\n\t\n\n\n\tGood\n\t- The aggregate of all the processes by means of which a person\n\tdevelops abilities, attitudes and other forms of behaviour of\n\tpositive value in the society in which he lives\n\t\n\n\n\tGood\n\t– the social process by which people are subjected to the\n\tinfluence of a selected and controlled environment sot that they may\n\tattain social competence and optimum individual development\n\t\n\n\n\tOECD\n",
  "theme": "10-creative-writing"
 },
 {
  "slug": "2009-1-focus-for-2009",
  "title": "2009-1- Focus for 2009",
  "summary": "December 22, 2008 memo from Don to Development Committee outlining achievements and strategic focus for 2009. Details accomplishments in professional advisors outreach (Heather, John, Donnie), donor file updates (Jeniene), cemetery trust identification (David, Donnie), and persons of interest discussions (Norman). Emphasizes principles: \"People give to people,\" past donors are best source of new donations, committee is forum for discussion, diverse outreach approaches (letters, presentations, brochures). Reflects Don's leadership philosophy.",
  "content_preview": "Date:\t\tDecember 22, 2008\n\n\n\n\nTo:\t\tDevelopment Committee\n\n\n\n\nFrom:\t\tDon Glendenning\n\n\n\n\nSubject:  \tDevelopment focus for 2009\n\n\n\n\n1\tAchievements to date:\n\n\n\n\nProfessional Advisors – Heather (Chair), John and Donnie prepared a Power Point presentation  and met with (name organizations)  Meetings usually lasted xx minutes depending on the amount of discussion.  Additional meetings will be scheduled.  Proposing to expand beyond financial institutions and have target of three new presentations each m",
  "theme": "10-creative-writing"
 },
 {
  "slug": "4-reading-competeencies-4",
  "title": "4 Reading Competeencies-4",
  "summary": "A comprehensive list of reading competencies covering diverse reading tasks (interpretation, analysis, comprehension strategies, functional reading of tables/charts/instructions). Demonstrates Don's systematic approach to defining and assessing educational competencies.",
  "content_preview": "Reading Competeencies\n\n\n\n\n\n\n\nWhat you do when you read?\n\nSo, what is involved in reading?  My search of the literature resulted in only a partial list, shown below. \n\n  \nChoose words appropriate to the subject\n  \nComprehend what has been read\n\n\n  \nSpeak fluently\n  \nExhibit a wide vocabulary\n  \nRead and interpret drawings\n  \nRead and interpret manuals\n  \nRead and interpret symbols\n  \nRead and interpret instructions\n  \nDistinguish fact from fiction\n  \nInterpret authors intent\n  \nRead and interpret",
  "theme": "10-creative-writing"
 },
 {
  "slug": "5-learner",
  "title": "5 Learner",
  "summary": "Framework document defining \"Learner\" as a person engaged in learning. Categorizes factors influencing learners into three areas: Prior Experiences (home, school, travel, culture, lifestyle, support) and Prior Conditions (physical, mental, emotional, social wellness), and Imagined Future (family, career, community, income, lifestyle). Emphasizes that learners bring diverse backgrounds and contexts to learning situations. Part of holistic educational framework acknowledging individual learner circumstances.\n- **Key People**: None\n- **Key Organizations**: None mentioned\n- **Tags**: EDUCATION, PROFESSIONAL, TECHNICAL\n- **Eulogy Relevance**: LOW - Theoretical educational framework",
  "content_preview": "5\n\nLEARNING FOR LIFE\n\nLearners\n\n\n\n\nLearner – a person engaged in learning\n\n\n\n\nPrior experiences:\n\n  \nHome \n  \nSchool \n  \nTravel\n  \nCulture\n  \nLife style\n  \nSupport\n\n\n\n\n\nPrior Conditions:\n\n  \nPhysical\n  \nMental\n  \nEmotional\n  \nSocial wellness\n\n\n\n\n\nImagined future:\n\n  \nFamily\n  \nCareer\n  \nCommunity\n  \nIncome\n  \nLifestyle",
  "theme": "10-creative-writing"
 },
 {
  "slug": "5-restructuring",
  "title": "5 Restructuring",
  "summary": "Don identifies structural issues requiring urgent educational reform in PEI: unclear purpose definitions, services poorly integrated, departmental structure based on clients rather than functions, insufficient teacher autonomy, and weak accountability mechanisms. References OECD PISA findings and World Bank research. Advocates that autonomy and accountability, properly applied, can enhance responsiveness to diverse learner needs.",
  "content_preview": "About\nEducation\n\nGlendenning\n\n\n       5\n\nRESTRUCTURING\nCALLED FOR - 1\n -\t\t\t\t\t\t\t\t\t     Doc.5\n\n_____________________________________________________________________________\n\n\n\n\n\n\nThe\neducation literature speaks of the need for educational reform. I\nagree; the mos pressing issues, I suggest, are structural.\n\n\t\n\nPurpose\n\tsets\n\tthe stage for what we do and how we organize to do it. The\n\tPEI education literature refers to helping people find a place in\n\tsociety; we need to better define that “place”. ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "500-relevant-standards",
  "title": "500 Relevant Standards",
  "summary": "Don addresses the gap between public expectations and school delivery, citing Common Core State Standards and Ontario's Provincial Report Card as incomplete responses. He argues \"exit standards\" are the pressing issue—defining expected growth levels from schooling. Don defines standards as three-component constructs: criteria (dimensions like vocabulary, style, grammar), rating scales (6-level example for writing from disorganized to creatively written), and benchmarks (industry-recognized reference points like a competent plumber who solves problems independently). He notes doctors use test results without averaging to determine patient health, while teachers average diverse subjects' grades—an illogical analogy. Don argues judgment cannot be removed from standards-setting, only made consistent, as doctors exemplify through using test results to inform judgment about treatment.",
  "content_preview": "Relevant Standards\n\n\n\n\n\n\n\nA gap exists between what the public expects of schools and what schools deliver; the two do not speak the same language.  Two recent reports, a US report on Common Core State Standards and the Ontario Provincial Report Card address the gap but both, in my view, are still works in progress.  If working models exist, they have not come into my view - at least not yet.  In my view, exit standards is the pressing issue of the day.  By standards, I refer to the level of gro",
  "theme": "10-creative-writing"
 },
 {
  "slug": "500-teachers-as-change-agents",
  "title": "500 Teachers as Change Agents",
  "summary": "Don defines teachers as change agents helping learners acquire behaviors for adult community participation, arguing content is the easy part. Learning, he states, is change—in cognitive, affective, or psychomotor domains. Learning is fundamentally individual; teachers don't teach classes but may teach multiple individuals within group settings. Teaching involves stimulating learning through diverse techniques: modeling, information delivery, questioning, timelines, projects, field trips, and assessment. The crux of good teaching is creating individual learning environments that yield favorable experiences. Don notes subjects serve as media for teaching broader skills—English teaches communication, school environment teaches citizenship. Good assessment focuses on what people actually do in real life: communicate, solve problems, discuss literature, analyze situations, not on memorizing isolated content.",
  "content_preview": "Teachers as Change Agents\n\n\n\n\n\n\n\nTeachers are change agents.  They help learners gain a set of behaviours needed to participate in adult community.  Content is the easy part.\n\n\n\n\nTo learn is to change; to teach is to help others change.  In educational jargon, changes may be in the cognitive, affective or psychomotor domains.  More simply put, a person who has learned has new or changed attitudes, skills or information or some combination thereof.  \n\n\n\n\nLearning is an individual matter.  Only th",
  "theme": "10-creative-writing"
 },
 {
  "slug": "8-graduation",
  "title": "8 Graduation",
  "summary": "Open Education No. 63 (April 18, 2018), authored by Don Glendenning questioning whether current school calendars can coexist with learning excellence. He notes individual learner pace and style differences conflict with group-based instruction organized in time blocks, complicating diploma awards and graduation ceremonies. Don proposes five alternatives: schools focus on learning, not grading; independent bodies award grades; learning time adjusts to individual pace; graduation requirements change; Canadian Qualification Authority established; graduation becomes \"recognition.\" The article references an education award program and discusses information as an education service separate from instruction. Don's personal reflection on an eye doctor's \"Cataract Information for Patients\" pamphlet raises whether comparable patient/learner information services exist, and a concluding poem lament reflects on teaching effectiveness when students face social challenges.",
  "content_preview": "Open Education\t\t\t\t\t     \n\nNo. 63\t\t\t\t\t                \t                 \t\t          April 18, 2018\n\n\t\t\t\t\t      \n\n“For so long we’ve used a degree as a proxy for employability, but it doesn’t work that way anymore,” -Noel Ginsburg \n\n\n\n\n\n\n\nRETHINKING GRADUATION\n\n\n\n\nI’ve been pondering the dilemma of school graduation; can the current school calendar and “learning excellence” co-exist? It’s not a new issue; I was alerted to the dilemma on arrival on PEI fifty years ago, and it was part of a discussi",
  "theme": "10-creative-writing"
 },
 {
  "slug": "90-i-taught-them-all",
  "title": "90 I Taught them all",
  "summary": "Article No. 89 (April 27, 2020) presents a reflective poem titled \"I Taught Them All,\" adapted from Naomi John White's \"Progressive Education\" (1943), in which a 10-year teacher describes three troubled students—a quiet murderer, a loud fighter, and a charming thief—whom she taught Elizabethan sonnet rhyming schemes and sentence diagramming, only to later encounter them in penitentiaries and jail. Don notes the poem has haunted him since he started teaching, suggesting its profound commentary on education's limitations and disconnect from real-world impact on troubled youth. The adapted poem appears to reflect Don's broader educational philosophy that teaching technical skills alone is insufficient without addressing underlying human needs.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 89\t\t   \t\t\t                                   \n\t    \t                 April 27, 2020\n\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\nI\n\tTaught Them All\n\t\n\n\tA\n\treflective poem about teaching.\n\t\n\n\tAdapted\n\tfrom Naomi John White, Progressive Education (1943).\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tI\n\thave taught high school for ten years. During that time, I have\n\tgiven assignments, among others, to a murderer, a street-smart\n\tfighter, and a thief.\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tmurderer was a quiet little boy who sat on the front ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "92-structural-issues",
  "title": "92- Structural Issues",
  "summary": "Don references People for Education's recommendation for a comprehensive Task Force on education, including diverse partners (directors, teachers' federations, principals, trustees, students, deans, Indigenous education groups). He broadens the vision beyond schools to all islanders of all ages and their futures. Published February 20, 2020 in Open Education No. 92.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 92\t   \t\t\t                                    \n\t   \t                 February 20, 2020\n\t\n\n\tWhen\n\tschools and ministries are managed well, learning happens-World Bank\n\n\n\n\t\n\n\n\t\n\t\n\n\tTIME\n\tFOR A CONVERSATION\n\t\n\n\tPeople\n\twant to talk about education,  not just about schools, storm days or\n\ttest results. People for Education, an Ontario group,  has\n\trecommended that the Minister constitute a Task Force – with \n\tparticipation from all the education partners, including directors\n\t",
  "theme": "10-creative-writing"
 },
 {
  "slug": "94-learning",
  "title": "94 Learning",
  "summary": "Don presents his philosophy of learning as personal, multi-faceted change in how people think, feel, and act. He stresses that learners carry three types of baggage into learning situations: innate conditions, prior learning, and aspirations about the future. Criticizing PEI's narrow focus on school-based education, he argues institutions must redesign programs to accommodate diverse learner needs and that educators must engage as professionals with communities they serve, not remain confined by political filters and bureaucratic constraints. His vision emphasizes that meaningful education develops lifelong competencies beyond credentialing.",
  "content_preview": "Open Education\n\nNo. 94\t\t   \t\t\t                                        \t                 June 4, 2020\n\nEducation  – creating circumstances where others will learn  - Anon \n\n\n\n\n\n\n\nIT’S ABOUT LEARNING\n\nLearning is about people making change in their lives; more precisely it’s about changes in the way they  think, feel and act. Learning is a very personal matter; only learners can learn – in other words one person cannot learn for another person.  Learning itself is neutral, neither  good nor bad.  ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "99-emerging",
  "title": "99 Emerging",
  "summary": "Don outlines his vision of emerging changes in PEI education, including individual learner profiles, outcomes-based report cards, a Board of Education with both appointed and elected members to oversee all educational services, family education advisers, a Chief Education Officer role, program advisory committees including employers and community, mini-courses with short-term credentials, education clinics for literacy/numeracy support, expanded library services, and area directors of educational services. This document captures his comprehensive proposal for structural educational reform emphasizing professional autonomy, community engagement, and lifelong learning opportunities beyond traditional schooling.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo.99\t                                        \t  \n\t              \t\t\tAugust 20, 2020\n\t\nPedagogical\n\tautonomy and accountability:\n\t\na\n\trecipe for improving academic results - Bedard\n\n\n\n\t\n\n\n\t\n\t\n\n\tCOMING\n\tTO A SCHOOL NEAR YOU\n\t\n\n\tChanges\n\tto watch for:\n\t\n\t\t\n\n\n\t\tIndividual\n\t\tlearner profiles\n\t\tfor secondary and post secondary students.\n\t\t\n\n\n\t\tOutcomes\n\t\trather than subjects appearing on report cards.\n\t\t\n\n\n\t\tA\n\t\tPEI Board of Education – to provide oversight\n\t\tto educational service",
  "theme": "10-creative-writing"
 },
 {
  "slug": "a-friend-passes",
  "title": "A Friend Passes",
  "summary": "Short reflective poem dated June 1, 1974, meditating on the fragility of life and the impact of a friend's death. The piece captures the tension between everyday life and the sudden awareness of mortality that death brings, exploring themes of what truly matters in life.",
  "content_preview": "A Friend Passes\n\n\n\n\n\n\n\nLife\n\nFragile\n\nVibrant\n\nEngrossed with living\n\nWe take it for granted\n\n\n\n\nThe lifeline snaps\n\nEternity\n\nWhat is important\n\n\n\n\nJune 1, 1974",
  "theme": "10-creative-writing"
 },
 {
  "slug": "a-midnight-sojour1",
  "title": "A Midnight Sojour1",
  "summary": "Early draft of a poem dated December 1973 about a camping experience far from traffic and civilization. Describes frost, stars, brookside sounds, and campfire dwindling into moonlight. Uses nature imagery to evoke memory creation and the fleeting quality of moments. This is a draft version with slight variations from the final version.",
  "content_preview": "A Midnight Sojourn\n\n\n\n\n\n\n\nFar from the traffic\n\nStillness overwhelms one\n\nFrost in the hollow\n\nWhy am I here\n\nStars twinkle\n\nBrooks trickle\n\nGentle sounds all\n\nAs the campfire dwindles\n\n\n\n\nFlickering shadows\n\nFade in the moonlight\n\nMemories created\n\nLong may they reigh\n\n\n\n\nDecember 1973",
  "theme": "10-creative-writing"
 },
 {
  "slug": "a-midnight-sojourn",
  "title": "A Midnight sojourn",
  "summary": "Final version of the camping poem (December 1973) with minor refinements from the draft. Same themes of stillness, natural beauty, and the ephemeral nature of moments creating lasting memories. The polished version corrects \"overwhelms one\" to \"overwhelms me\" and \"reigh\" to \"reign,\" showing Don's attention to craft.",
  "content_preview": "A Midnight sojourn\n\n\n\n\nFar from the traffic\n\nStillness o’erwhelmsd me\n\nFrost in the hollow\n\nWhy am I here\n\n\n\n\nStars twinkle\n\nBrooks trickle\n\nGentle sounds\n\nAs the campfire dwindles\n\n\n\n\nFlickering shadows\n\nFade in the moonlight\n\nMemories created\n\nLong may they reign\n\n\n\n\nDec/73",
  "theme": "10-creative-writing"
 },
 {
  "slug": "a2-why-education-2016-04-24t20-18-52",
  "title": "A2 Why education @2016-04-24T20;18;52",
  "summary": "Educational philosophy essay explaining education as formative change affecting how one thinks, feels, and acts, distinguishing it from schooling and credentials. Emphasizes that education encompasses diverse learning across attitudes, skills, and knowledge from multiple sources; explains that formal school represents only one sector and learning happens through broader experiences at home, community, travel, and self-study.",
  "content_preview": "About Education\n\nYou and your education\n\nNo. 01\t\t\t\t\t\t\t\t\t\t\tAbout-A-2\n\n______________________________________________________________________________________\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen we are young, in fact at any age, we are told that we should “get an education”; sounds like a good idea but where does one I get it and how? And how do I know when I have it?  I really do not want to go to school?  If you are reading this or talking about it with friends, you already have an education, so you’ve got to be ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "ab-learn-3-path-2",
  "title": "AB Learn-3 Path -2",
  "summary": "Collaborative learning framework document developed with youth panel discussing learning processes. Panel identified 16+ learning activities (gathering information, lectures, counseling, demonstrations, tasks, assessment, motivation, observation, resources, reflection, feedback, instruction, self-evaluation, coaching, practice). Document notes learners follow different paths through these activities depending on goals and preferences. Includes chart mapping support useful at different learning stages respecting diverse learning styles. Credits Tanya Craig for panel convening and Mike Chapman for design.",
  "content_preview": "About education\n\n\n\n\nLearning path\t\t\t     \t\t\t\n\nAB Learn-3\t\t\t \t\t\t\t\t                November6, 2014\n\n\n\n\nThe first step in understanding education is to understand learning and the learning process.  So, what do we know about learning.  First of all learning is an individual matter; only the learner can learn.  To learn is to change behaviour; a person who has learned has new knowledge a new skill or a different attitude. Learning involves engaging in an experience that has a formative effect on a p",
  "theme": "10-creative-writing"
 },
 {
  "slug": "an-evening-of-television",
  "title": "An Evening of Television",
  "summary": "Satirical poem written in Ottawa in 1966 capturing the chaos of television viewing—rapid scene changes, emotional whiplash from dramas to news to commercials. References current events (riots in Africa, Hess), describes typical evening escapism, and concludes with fatigue before the workday begins. Reflects Don's observational wit and critique of media consumption.",
  "content_preview": "An Evening of Television\n\n\n\n\nThe day was a rough one\n\nThe evening was free\n\nUnload worry and CareRelax in your chair\n\nAnd watch some TV\n\n\n\n\nThe room was in shambles\n\nThe fight was terrific\n\nSlamming and banging\n\nAnd also haranguing\n\nThe scene was horrific\n\n\n\n\nLove in the making\n\nYou cannot mistake it\n\nBilling and Cooing\n\nInternally stewing\n\nOh how can we take it\n\n\n\n\nAgain the scene changes\n\nProducing domestics\n\nFather, mother\n\nSister, Brother\n\nA little less hectic\n\n\n\n\nAn oft changing pattern\n\nKe",
  "theme": "10-creative-writing"
 },
 {
  "slug": "arthur-the-artist",
  "title": "Arthur the Artist",
  "summary": "Children's story about Brian (Don's son) and his sister Janet visiting a Charlottetown TV studio where they meet Arthur, a commercial artist working on \"The Krazy Keepers\" show. Arthur explains different types of artistic work and careers, including set design, sign painting, and freelance work. The story demonstrates Don's educational approach to teaching children about careers and professions, incorporating his son's direct experience.",
  "content_preview": "ARTHUR THE ARTIST \n\n\n\n\nBrian and Janet En joyed T. V. Especially \n\n\n\n\nThe Krazy Keepers Which was produced In Charlottetown Where they lived. \n\n\n\n\nOne day, \n\n\n\n\nMummie, Daddy, Janet, and Brian Went to the \n\n\n\n\nT. V. Studio. \n\n\n\n\nThey wanted to see The show \n\n\n\n\nBeing produced. \n\n\n\n\nThe producer told them That they could watch Provided they would be Very quiet. \n\n\n\n\nBefore the show started They watched the people Working around the studio. \n\n\n\n\nOne man \n\n\n\n\nWas painting a picture Of a red school.",
  "theme": "10-creative-writing"
 },
 {
  "slug": "backgroud-3",
  "title": "Backgroud 3",
  "summary": "Comprehensive background statement addressing the urgency and scope of transition issues in PEI education system. Emphasizes urgency and shared responsibility (\"the issue will not resolve itself and cannot be resolved by educators alone, but resolve it we must—and soon\"). Details performance determination factors and catalogs transition dilemmas including credential gaps, diploma/credit mismatches, and employment skill deficits. Identifies contributing factors and driving forces: education costs, 21st-century skills, economic change, skill-unemployment paradox, and IT revolution. Proposes small working group of diverse stakeholders to explore actions needed. Lists contributors to smooth transition: communication, clear requirements, reliable assessment, relevant documentation, positioned responsibility, information and counselling. Notes mathematics as focus field. Demonstrates Don's comprehensive systems thinking.",
  "content_preview": "Transition/\n\t\n\n\tTRANSITION \n\t\n\t\n\n\n\n\t\n\t\n“A\n\tstudent’s ability to transition from secondary school to\n\tpost-secondary education and the labour market is a key measure of\n\tthe education system’s success for students” – CMEC, July 2016\n\t\n\n\n\n\t\n\t\nThe\n\tabove statement by the Council of Ministers of Education Canada\n\t(CMEC) highlights a concern that is shared by many educators,\n\temployers, certification agencies and the community at large. The\n\tissue  will not resolve itself and cannot be resolved by ed",
  "theme": "10-creative-writing"
 },
 {
  "slug": "christmas-remembered",
  "title": "Christmas Remembered",
  "summary": "Nostalgic poem dated December 1973 reflecting on childhood Christmas memories—Santa's arrival, the red tractor gift, waiting for Santa, and the transition to adulthood when Don realized he would be filling stockings for others. Captures the bittersweet passage from childhood wonder to adult responsibility, revealing personal vulnerability and affection for family traditions.",
  "content_preview": "Christmas Remembered\n\nChristmas is over\n\nFestivities ceased\n\nEating as normal\n\nThen ond of the feast\n\n\n\n\nTurmoil and gladness\n\nReel through the mind\n\nYet we remember\n\nPast years, other times\n\n\n\n\nEarly to bed\n\nListen for Nick\n\nAnd if we hear him\n\nWe’ll run downstairs \tquick\n\n\n\n\nSanta’s provisions\n\nA najoor factor\n\nHow I remember\n\nThe little red tractor\n\n\n\n\nNotes from St. Nicholas\n\nWhere hhave they gone\n\nWritten in haste\n\nEre hurrying on\n\nTry to decipher\n\nRead them we must\n\nEyes cannot follow\n\n Gi",
  "theme": "10-creative-writing"
 },
 {
  "slug": "competencies-don-s-list",
  "title": "Competencies-Don's list",
  "summary": "Reference document detailing reading competencies spanning foundational skills (vocabulary, fluency) to advanced comprehension (interpreting symbols, drawings, tables, graphs). Includes practical applications relevant to adult literacy and workplace contexts. Demonstrates Don's systematic approach to defining measurable learning outcomes across diverse reading contexts.",
  "content_preview": "Reading Competencies\n\n\n\n\n\n\n\nWhat you do when you read?- miscellaneous \n\n\n\n\n  \nChoose words appropriate to the subject\n  \nComprehend what has been read\n\n\n  \nSpeak fluently\n  \nExhibit a wide vocabulary\n  \nRead and interpret drawings\n  \nRead and interpret manuals\n  \nRead and interpret symbols\n  \nRead and interpret instructions\n  \nDistinguish fact from fiction\n  \nInterpret authors intent\n  \nRead and interpret computer print outs\n  \nRead text messages\n  \nRead rapidly for the main points \n  \nRead rapi",
  "theme": "10-creative-writing"
 },
 {
  "slug": "d-00-long-list",
  "title": "D 00 Long list",
  "summary": "This extensive brainstorming document catalogs dozens of educational initiatives under six strategic areas: Focus on Teaching, Challenge for Credit, Grade Improvement, Library-Based Services, Provincial Clinic, and Comprehensive Reform. Don synthesizes diverse concepts from educational research (including references to Pathways to Education from Globe and Mail). Proposals range from teacher competency identification to early childhood development to qualification authorities to summer programs. The \"First Steps Plan\" outlines ambitious systemic improvements including early childhood education reform, school performance focus, independent learning encouragement, and qualification authority establishment. This document reveals Don's comprehensive educational vision and capacity for synthesizing complex ideas into actionable frameworks.",
  "content_preview": "Long LIST\n\n\n\n\n\n\n\n\n\n\nFocus on teaching:\n\nIdentify competencies/outcomes\n\nIdentify key skills\n\nProvide a copy for each teacher \n\nEncourage each teacher to self-evaluate\n\nUse as basis for discussion between teacher and principal\n\n\n\n\nChallenge for Credit\n\nSelect a subject – Math would be easiest\n\nGrade 11 and 12 level\n\nCredit must be acceptable for high school graduation and entrance to postsecondary institutions\n\nAvailable on request\n\nCharge a fee\n\n\n\n\nGrade Improvement Initiative\n\nAvailable to stud",
  "theme": "10-creative-writing"
 },
 {
  "slug": "d-3-learning-cafe",
  "title": "D 3 Learning Cafe",
  "summary": "A straightforward proposal for an informal, monthly discussion forum on PEI education improvements. The Learning Café would operate in accessible restaurant or lounge settings, open to anyone without membership requirements, using evening meetings for primarily informal discussion with optional speakers. Logistics are minimal: communication via email, no required minutes or meeting reminders, no fees. Governance emphasizes maximizing participation, maintaining non-partisan focus, and respecting diverse viewpoints while remaining issue-oriented. This modest initiative reveals Don's belief that grassroots community conversation is essential to educational reform and his talent for creating low-barrier opportunities for public engagement.",
  "content_preview": "Educ-Proposala\n\nLEARNING CAFÉ\n\n\n\n\n\n\n\nPurpose: \n\nprovide a forum for, and stimulate discussion among, people with an interest in the improvement of education in Prince Edward Island\n\n\n\n\nMeetings:\n\nOpen to anyone; membership not required\n\nEvenings\n\nLocal restaurant or lounge\n\nMonthly\n\nEvening\n\n\n\n\n\n\n\nProgram:\n\nPrimarily informal discussion\n\nMay include focus or speaker\n\nPreferably licensed\n\nPerhaps a theme determined in advance\n\n\n\n\n\n\n\nLogistics\n\nEmail\n\nNo commitment to minutes\n\nNo meeting reminders",
  "theme": "10-creative-writing"
 },
 {
  "slug": "d-3-we-are-all-educated",
  "title": "D-3 We are all educated",
  "summary": "This inclusive piece challenges narrow definitions of education, asserting that all humans continuously educate themselves through diverse experiences: learning to talk, ride bikes, drive cars, conduct research, design buildings, create art, or advance technology. Don broadens education beyond schooling to encompass skill development, information acquisition, attitude change, and confidence building. He positions schools as playing a special role but not the only role in education, reflecting his holistic understanding that learning is a lifelong, multifaceted process occurring across all life contexts and experiences.",
  "content_preview": "We are all educated\n\n\n\n\nWe are all educated; meaning that we have all learned something.\n\n\n\n\nAt birth, we are all catapulted onto the road of life – and we are there as long as we live. We gurgle, say mama, learn to ride a bike, read a book and drive a car.  In my books, that’s all part of one’s education; so is learning to do research, design a building, creating a piece of art or put a human on Mars. \n\n\n\n\nImproving one’s education is as simple as learning new information, sometimes it is simpl",
  "theme": "10-creative-writing"
 },
 {
  "slug": "d-let-march-20",
  "title": "D let March 20",
  "summary": "A letter criticizing PEI Department of Education and Lifelong Learning for conflating \"education\" (umbrella concept) with \"instruction\" (schooling). Don argues the Department's narrow role of \"developing and delivering programs to young people\" contrasts unfavorably with other departments' broader mandates and ignores individual and community needs across lifespans. He proposes government should fund diverse individual services (literacy, numeracy, employment prep) and community services, noting comparative examples from health care. The letter reflects his recurring theme about fundamental definitional and structural confusion in education policy.",
  "content_preview": "March 20, 2020\n\n\n\n\nDear Editor:  \n\nCommunication: a key to improvement in education\n\nTo views of education\n\n\n\n\nIt appears that the PEI Department of Education and Lifelong Learning does not distinguish between education, an umbrella term, and “instruction” (schooling)– a service provided mostly in schools. The Department implies that going to school and getting an education are the same; World Bank reports disagree. \n\n\n\n\nThe Department of Education and Lifelong Learning describes its role as one",
  "theme": "10-creative-writing"
 },
 {
  "slug": "death-of-an-uncle",
  "title": "Death of an Uncle",
  "summary": "Poem dated December 1973 capturing the shock of a late-night phone call announcing an uncle's death. Traces the emotional journey from confusion to grief, with memories of family gatherings and laughter interrupted by mortality. Reflects on human finitude and divine will, displaying Don's contemplative approach to loss and family bonds.",
  "content_preview": "Death of an Uncle\n\n\n\n\n\n\nThe hour is late\n\nThe telephone rings\n\nYour hear jumps a beat\n\nIs it bad news\n\n\n\n\nYou jump from the bed\n\nIncessant, the ringing\n\nTurn on the light\n\nChildren awake\n\n\n\n\nWho can it  be?\n\nAt this time of night\n\nSickness or worse\n\nYou reach for it\n\nWondering\n\n\n\n\nA voice so familiar\n\nIs some consultation\n\nBut you can soon sense\n\nThere is something more\n\n\n\n\nThe family all well?\n\nA qualified answer\n\nBreak the news gently\n\nAn uncle is gone\n\n\n\n\nConversation continues\n\nSome sketchy ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "description-calculate-pay",
  "title": "Description-calculate pay",
  "summary": "Sample competency guide for \"Calculate Gross and Net Pay\" (Code 2-3) demonstrating the gig economy context and diverse income sources. Provides rationale, elaborations (employee wages, salaries, contracts, commissions, piecework), typical activities, and performance assessment criteria. Shows Don's systematic approach to translating real-world competency requirements into learner-centered instructional materials.",
  "content_preview": "CALCULATE\nGROSS AND NET PAY\n\nMathematics\n\t\t\t\t\t\t\t\t\t            Code 2-3\n\n--------------------------------------------------------------------------------------------------------------------------------\n\nRATIONALE\n\nThe gig economy is\nreal. People work for a variety of employs and many are self\nemployed.  As a result, a persons income may be dived in a variety of\nwaysWhile many employees will work for xtended periods, It is likely\nthat many will  receive income from a variety of sources.  \n\n\n\n\n\n\n\nE",
  "theme": "10-creative-writing"
 },
 {
  "slug": "description-calculate-using-decimal-fractions",
  "title": "Description-calculate using DECIMAL FRACTIONS",
  "summary": "Competency description for decimal fraction calculations applied to income calculations in diverse employment contexts. Shares structure and rationale with other platform descriptions, including gig economy framework and elaborations on wages, salaries, contracts, commissions, and piecework. Represents systematic approach to building foundational numeracy skills.",
  "content_preview": "CALCULATE\nUSING DECIMAL FRACTIONS\n\nCompetency\ndescription\n\nMathematics\n\t\t\t\t\t\t\t\t\t                        Code 2-3\n\n--------------------------------------------------------------------------------------------------------------------------------\n\nRATIONALE\n\nThe gig economy is\nreal. People work for a variety of employers, others are self\nemployed and still others do a c0mbination of both.  As a result, a\nperson’s income may come from a variety of sources, varying amounts\nand irregular periods. Payin",
  "theme": "10-creative-writing"
 },
 {
  "slug": "drowning",
  "title": "Drowning",
  "summary": "Don's somber recollection of a June 10, 1938 (possibly 1937) tragedy at Victoria Bridge, Black River, where Larry Brideau and John Paul drowned while swimming after peeling pulpwood at Hexham. Don visited the scene the following day, witnessing rescue efforts with raft and divers. He includes a full commemorative poem in eight stanzas, honoring John Paul's heroic attempt to save Larry and reflecting on mortality and faith. The poem's signature date is \"Black River, June 10th, 938.\"",
  "content_preview": "Drowning at Victoria Bridge\n\n\n\n\nIN MEMORIAM\n\n\n\n\nLarry Brideau and John Paul were drowned at Victoria Bridge, Black River, on June 10, 1938. (Or was it 1937?) They were peeling pulpwood at Hexham and decided to go for a swim at the end of the day.  I remember going down to the Victoria Bridge next day and seeing the raft and divers at the side of the Victoria Bridge.   \n\n\n\n\nOnce again the sun is setting\n\nAnd a year has passed away,\n\nSince a boy cried: Come my comrades\n\nWe will go and swim today.\n",
  "theme": "10-creative-writing"
 },
 {
  "slug": "educ-services-4-system-colour",
  "title": "Educ Services 4  system  colour",
  "summary": "A comprehensive education services framework showing how services meet the needs of \"150,000 Islanders with differences\" (those born with differences, who have learned, and who hold aspirations) seeking to change their attitudes, skills, and knowledge. The document presents education services across governance and leadership, instruction, quality assurance, information and counselling, human resources, learning products, and funding. This represents Don's systems-thinking approach to addressing diverse population needs.",
  "content_preview": "GOVERNANCE\n\t& LEADERSHIP\n\t\n\n\tLeadership\n\t\n\n\tPlanning\n\t\n\n\tLiaison\n\t\n\n\tSupport\n\t\n\n\tResearch\n\t\n\n\tAdvocacy\n\t\n\n\tQuality\n\tControl\n\t\n\n\t       ?\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tINSTRUCTION\n\t\n\n\tPresentation\n\t\n\n\tDemonstration\n\t\n\n\tPractice\n\t\n\n\tDiagnosis\n\t\n\n\tInstructional\n\tmaterials\n\t\n\n\tLiaison\n\t\n\n\tCoaching\n\t\n\n\tRecord\n\tkeeping\n\t\n\n\tGuided\n\tPractice\n\t\n\n\t         ?\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nQUALITY\n\tASSURANCE\n\t\n\n\tCredential\n\t\n\n\tQualification\n\t\n\n\tProficiency\n\t\n\n\tLevel\n\t\n\n\t    ?\n\t\n\n\t    \n\t\n\t\nEDUCATION\n\tSERVICES\n\t\n",
  "theme": "10-creative-writing"
 },
 {
  "slug": "educ-services-5-landape1",
  "title": "Educ Services 5 landape1",
  "summary": "This framework document presents \"Typical Education Functions\" addressing clientele with diverse needs (varying genes, prior learning, and goals) in multiple life roles: individual, family member, citizen, learner, producer, and consumer. The services needed to help islanders thrive include developing better attitudes, skills, and knowledge across information and counselling, human resources, learning products, and funding categories. The repetition of client descriptions emphasizes the comprehensive nature of education's role.",
  "content_preview": "GOVERNANCE & LEADERSHIP\n\nLeadership\n\nPlanning\n\nLiaison\n\nSupport\n\nResearch\n\nAdvocacy\n\nQuality Control\n\n       ?\n\n\n\n\n\n\n\n\n\n\n\n\n\nINSTRUCTION\n\nPresentation\n\nDemonstration\n\nPractice\n\nDiagnosis\n\nInstructional materials\n\nLiaison\n\nCoaching\n\nRecord keeping\n\nGuided Practice\n\n         ?\n\n\n\n\n\n\n\nQUALITY ASSURANCE\n\nCredential\n\nQualification\n\nProficiency\n\nLevel\n\n    ?\n\n    \n\nTYPICAL \n\nEDUCATION FUNCTIONS\n\nCLIENTELE\n\nIslanders with differing and diverse needs (genes, prior learning and goals) filling these life r",
  "theme": "10-creative-writing"
 },
 {
  "slug": "educ-system-comp-2014-11-08t19-48-28",
  "title": "Educ System comp@2014-11-08T19;48;28",
  "summary": "Formal paper defining the components of an education system including service providers (schools, colleges, universities), information services, community agencies, feedback mechanisms for quality assurance, funding structures, leadership/governance, and industry support. Don articulates his vision that a true education system must integrate multiple institutions and support services beyond schooling to meet diverse citizen learning needs.",
  "content_preview": "About\nEducation\t\t\t\t\t\t\t\t\n\n   An\nEducation System\n\n\nOccasional paper No. 4\t\t\t\t\t Oct 11, 2014 \n\n\n\nAbt/educ/comp\n\n\n\n\t\n\n\n\t\n\t\nComponents\n\tof an Education System\n\t\nDefinitions:\n\t\n\t\t\n\nEducation –\n\t\tany experience that has a formative effect on the way we think,\n\t\tfeel or act.\n\t\t\n\nPurpose –\n\t\thelp people to develop their capacities to be full participating\n\t\tmembers of a community\n\t\t\n\nEducation\n\t\tsystem – all services put in place by a community to meet the\n\t\teducational needs of its citizens\n\t\n\t\n\n\n\n\t\n\t\n",
  "theme": "10-creative-writing"
 },
 {
  "slug": "education-agenda-docx",
  "title": "Education agenda docx",
  "summary": "Philosophical and conceptual analysis contrasting education with schooling, drawing on World Bank perspectives. Argues that education is an umbrella concept encompassing learning processes that occur anywhere, anytime, through multiple mechanisms, while schools are specialized institutions for formal learning. Notes that schools' focus on traditional subjects and cultural studies can cause education itself to suffer. Outlines diverse support mechanisms for learning beyond traditional classroom instruction.",
  "content_preview": "About Education\n\nGlendenning\n\nThe Education Agenda\n\nThe World Bank cautions countries about treating education and schooling as though they are one and the same; we may have fallen into the same trap; education suffers as a result.\n\n\n\n\nEducation is an umbrella word; it applies to the process of creating experiences that help others learn. It can happen anywhere, at any time and in a vriety of ways. Given  its importance and the numbers involved, communities usually provides especially designed a",
  "theme": "10-creative-writing"
 },
 {
  "slug": "education-services-2",
  "title": "Education Services-2",
  "summary": "This refined service description articulates purpose: increasing training opportunities supporting employment in Souris. It establishes three guiding principles (increase local capacity, prioritize employment-related training, become \"go-to\" information source) and details governance (three-person local committee, non-provider representation, program advisory committee, non-profit hosting). Typical offerings include community education services, employability skills, credit modules, online courses, and information/counseling. Financial section addresses cost structures, direct training expenses, and diverse funding sources (donors, tuition, SkillsPEI, in-kind contributions, associations).",
  "content_preview": "Community\nEducation Service-1\n\nSouris/Eastern\nKings, PEI\n\n3-Souris/EduServe\n\n\nBackground:\t\n\t\n\nSouris\nis an urban centre in eastern Prince Edward Island; it has a\npopulation in 2016 of 1,053; with additional 2745 people living in\nthe immediate surrounding area. Together they make a community one of\n3,798 people.  The economy of the area is dominated by seasonal\nindustries of fishing, aquaculture, agriculture and tourism.  A\nrecent study of the area revealed an interest and needs for\nadditional co",
  "theme": "10-creative-writing"
 },
 {
  "slug": "february-memories",
  "title": "February Memories",
  "summary": "Poignant poem about the death of Don's sister Elinor (one of his 8 siblings). The narrative begins with a missed phone call where Elinor had called about a hall fire, followed weeks later by news of her illness and death from the flu. Don reflects on moving Elinor to a location twenty years earlier and witnessing the hearse carry her away from that same spot. The poem conveys deep sibling affection and demonstrates Don's emotional sensitivity to family losses.",
  "content_preview": "February Memories\n\n\n\nMy mind wanders back\n\nTonight as I sit\n\nIn my own living room\n\nAnd I think back a bit\n\n\n\n\nTo one year ago\n\nIn the heart of the winter\n\nDeath entered the circle\n\nAnd left with my sister\n\n\n\n\nWhen I came home one night\n\nI learned in our hall\n\nI was a  few minutes too llalte\n\nFor her telephone call\n\n\n\n\nShe called to find out\n\nAbout family and all\n\nAnd to tell us the news\n\nOf a bad fire at the hall\n\n\n\n\nI did not phone back\n\n‘twas too late at night\n\nIn another few days\n\nI would si",
  "theme": "10-creative-writing"
 },
 {
  "slug": "finalities",
  "title": "Finalities",
  "summary": "Philosophical meditation on different types of \"finality\"—temporary (closing a door before a trip), bittersweet (saying goodbye to a friend), prolonged (family farewells), and permanent (death itself). Written in 2002, the poem contemplates how various endings punctuate human experience, with the final stanza addressing \"the finality of finalities\" (death). Reflects Don's sophisticated engagement with mortality and loss.",
  "content_preview": "Finalities\n\n\n\n\nThere is a  finality\n\nIn the click of a door lock\n\nAs we follow our suitcases\n\nTo the waiting taxi\n\n\n\n\nThere is a finality\n\nWith the diminishing silhouette\n\nOf the taxi\n\nAs we enter the airport\n\n\n\n\nThere is a finality\n\nWith the receding ground\n\nAs the aircraft lifts\n\nFrom PEI’s red soil\n\n\n\n\n……………………………………\n\n\n\n\nThere is a momentary finality\n\nIn the click of a doorlock\n\nAs we leave on a trip\n\n\n\n\nThere is a sweet finality\n\nIn the adieu of a friend\n\nDeparting a rendevous\n\n\n\n\nThere is a",
  "theme": "10-creative-writing"
 },
 {
  "slug": "from-a-country-road",
  "title": "From a Country Road",
  "summary": "Vivid descriptive poem dated June 21, 1987, capturing observations from a PEI country road. Uses synesthetic imagery to describe birds, wildflowers (lupins, dandelions, clover), butterflies, waters, and the vast open landscape. The poem demonstrates Don's deep appreciation for PEI's natural beauty and his observational precision, conveying the overwhelming sensory experience of rural contemplation.",
  "content_preview": "From a Country Road\n\n\n\n\n\n\n\n\n\nA panorama \n\nOf sights and sounds \n\nUnfolds\n\nAs I sit quietly\n\nOn a country road\n\nIn PEI\n\n\n\n\nBlackbirds chucking\n\nSparrows twittering\n\nSwallows chirping\n\nAnd other birds\n\nNot recognized\n\nAdding to the \n\nQuiet cacophony\n\nOn a country road\n\nIn PEI\n\n\n\n\nPink and pur;ol lupins\n\nDanndelion whiskers\n\nLocust tree blossoms\n\nAlsike and red clover\n\nGreens of all values\n\nBrown and grey\n\nWhere people inhabit\n\nPALE BLUE SKY\n\nSteel grey waters\n\nThe deeper blue of Nova Scotia\n\nWith ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "glenway",
  "title": "Glenway",
  "summary": "Celebration of \"Glenway,\" Don's property overlooking Orwell Bay in PEI, written October 18, 1996. Describes the property as an oasis of natural beauty that attracts neighbors and friends seasonally, creating enduring memories and bonds. For youth, it was \"a place of freedom, friends and more.\" The poem reveals Don's deep attachment to this place as a family gathering space and reflects his ability to create meaningful shared experiences.",
  "content_preview": "Glenway\n\n\n\n\n\n\n\nIt may sound high falutin’\n\nOr that’s what some folks ssay\n\nBut its beauty is for certain\n\nOverlooking Orwell Bay\n\n\n\n\nI’ve seen it in the winter\n\nI’ve stayed there in the fall\n\nSpring brings hope eternal\n\nBut summer’s best of all\n\n\n\n\nFor summer brings us nneighbours\n\nAnd froemds from near and far\n\nWho share this bit of heaven\n\nOof land and sea and star  /star\n\n\n\n\nIt has gentle, natural beauty\n\nAs beautiful as  it can get\n\nMy memories are etched forever\n\nWith the  beauty of our sun",
  "theme": "10-creative-writing"
 },
 {
  "slug": "glenway1",
  "title": "Glenway1",
  "summary": "Earlier draft version of Glenway dated July 10, 1974, presenting a more austere perspective. Describes the property as windswept, rain-drenched, fog-shrouded, and barren of natural shelter, though humanized by erected structures. Emphasizes impermanence—inhabitants scatter, time marches on, memories linger. Contrasts sharply with the 1996 celebratory version, revealing how Don's emotional relationship to the place evolved over 22 years.",
  "content_preview": "Glenway\n\n\n\n\n\n\n\nGlenway\n\nConcocted\n\nMisleading\n\nIncomplete\n\n\n\n\nWindsdwept\n\nRain drenched\n\nSunbathed\n\nFog shrouded\n\nBarren of natural shelter\n\n\n\n\nShelters erected\n\nInhasbited sometimes\n\nOwners and travelers\n\nRetreat for a while\n\n\n\n\nCharacter changes\n\nWarmth reappears\n\nBrief moments of friendship\n\nEstablished\n\nCemented\n\n\n\n\nIhhabitants scatter\n\nTime marches on\n\nMemories linger\n\nTill we return\n\n\n\n\nJuly 10, 1974",
  "theme": "10-creative-writing"
 },
 {
  "slug": "he-s-a-man",
  "title": "He's a Man",
  "summary": "Reflective poem from January 1980 about realizing his son Brian has become a man at age 18. Catalogs the gradual changes—height, weight, voice, completing school, enrolling in university, driving. The moment of recognition comes in the bathroom when Don sees his son's electric razor (a birthday gift) actually being used, symbolizing the transformation from boyhood. Reveals Don's paternal observation and emotional awareness.",
  "content_preview": "He’s a Man\n\n\n\n\nAt age 18\n\nA  son’s a man\n\nYou hardly notice\n\nThe changes\n\n\n\n\nThe height\n\nThe weight\n\nThe changing voice\n\nThe changes in his friends\n\n\n\n\nSchool completed\n\nEnrolled in university\n\nDriving the car\n\nAll evidence\n\nHe’s a man\n\n\n\n\nToday\n\nIt registered\n\nIn the bathroom\n\nThe electric razor\n\nA gift for his birthday\n\nWass no longer just sitting there\n\nIt was plugged in\n\n\n\n\nIts true\n\nHe’s a man\n\n\n\n\nJanuary 1980",
  "theme": "10-creative-writing"
 },
 {
  "slug": "issues-3-education",
  "title": "Issues-3 Education",
  "summary": "(185 words):**\nThis comprehensive document identifies nine interconnected structural issues in education systems, with emphasis on PEI. Don argues that education—complex and individualized—requires clear definitions and systemic alignment. Issues identified: (1) Clarity—lack of definition and shared understanding, perpetuating \"educationese\" jargon; (2) Purpose—PEI's stated purposes lack necessary detail for program development and assessment; (3) Education versus schooling—fundamental definitional confusion confuses roles and increases costs; (4) Structure—failing to organize around identified functions, particularly administrative and instructional services; (5) Autonomy and accountability—insufficient educator autonomy limiting responsiveness to diverse learner needs, despite OECD research showing autonomy improves outcomes; (6) Personalization—calendar-driven delivery ignores individual learner needs and interests; (7) Government relationship—political operation of education systems introduces inefficiency and instability; (8) Quality assurance—tension between teaching and grading roles; (9) Human and social capital—isolation of teachers prevents collaborative culture. Don advocates for systemic conversation and structural reorganization (dated June 5, 2023).",
  "content_preview": "ISSUES\nIN EDUCATION -3\n\n\nAbout 4-11\n\n\nMarch 3, 2022\n\nIt\nis widely recognized that education is a key factor in determining\neach citizen’s quality of life; in the same way, the collective\neducation of our citizens will determine to a significant degree the\nquality of the communities in which we live. Government support is\njustified for two reasons, one to suppot personal growth and\ndevelopment for every citizen; the other is to ensure the common\ngood.\n\n\n\n\n\n\nEducating\nis a complex matter made so b",
  "theme": "10-creative-writing"
 },
 {
  "slug": "issues-4",
  "title": "Issues-4",
  "summary": "(150 words):**\nThis document analyzes why education systems are slow to adapt to changing conditions, comparing education to other institutional sectors (health, justice, religion, hospitality). Don identifies five characteristic categories affecting change resistance: autonomy, clarity, accountability, structure, and culture. He then catalogs contemporary issues across K-12 and higher education: higher education faces student debt, completion rates, mental health, accreditation questions; K-12 confronts funding, safety, discipline, technology, charter school debates, standardized testing, teacher salaries, bullying, poverty, class size. Structural barriers include unclear purpose, limited autonomy, undefined accountability, inadequate reward systems, and risk-averse culture. Additional issues span health/wellness, equity, governance relationships, and resource adequacy. This document reveals Don's systematic thinking about institutional change barriers and his comprehensive understanding of contemporary education challenges at multiple system levels.",
  "content_preview": "Abut\nEducation\n\nGlendenning\n\n\nISSUES-4\n\n\nAbout 4-11\n\n\n_____________________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nRecent\n\tconversation raise a new question\n\t\nWhy\n\tis education slow to adjust to changing conditions\n\t\n\n\n\n\t\n\t\nMay\n\thave something to do with  culture\n\t\na\n\tcompared to:\n\t\n\t\t\n\nHealth\n\t\t\n\nJustice\n\t\t\n\nEducation\n\t\t\n\nReligion\n\t\t\n\nHospitality\n\t\n\t\n\n\n\n\t\n\t\nCharacteristics:\n\t\n\t\t\n\nAutonomy\n\t\t\n\nClarity\n\t\t\n\nAccountability\n\t\t\n\nStructure\n\t\t\n\nCulture\n\t\n\t\n\n\n\n\t\n\t\nHigher\n\tEduc",
  "theme": "10-creative-writing"
 },
 {
  "slug": "issues-7-structural",
  "title": "Issues-7 structural",
  "summary": "This document provides foundational definitions and frameworks for understanding education systems. Don defines education as preparation for life's roles and schooling as instruction delivered through institutions. He identifies typical education functions (policy/governance, instruction, human resources, products/technology, information/counselling, funding, quality assurance) and notes that PEI education services emerge from multiple government departments. Key structural issues include: lack of overarching public statements about education beliefs, narrow mandates for education departments, insufficient community engagement, politicization, and lack of clear accountability. He proposes delegating instruction to diverse providers (schools, colleges, universities, private practitioners, independent learners) and establishing independent qualification bodies separate from teaching roles.",
  "content_preview": "Issues\nEducation -2\n\n\nAbout 4-11\n\nWhat\nis a systemic issue\n\n\n\n\n\n\nIt\nis widely recognized that education is a key factor in determining\neach citizen’s quality of life; in the same way, the collective\neducation of our citizens will determine to a significant degree the\nquality of the communities in which we live.  In recognition of its\nimportance, governments provide massive support for public education.\nThe investment is justified for two reasons, one to ensure a high\nlevel of personal growth and",
  "theme": "10-creative-writing"
 },
 {
  "slug": "learning-path-2014-11-08t04-03-57",
  "title": "Learning Path@2014-11-08T04;03;57",
  "summary": "A foundational document on learning paths describing how a panel of young people identified key steps in their learning process. Don discusses learning as individual behavioral change and outlines diverse learning pathways. The learner process diagram shows three phases (Planning, Engagement, Verification) with multiple support options including observation, feedback, assessment, and credentials.",
  "content_preview": "About\neducation\n\n\n\n\n\n\n\n\nLearning\npath\t\t\t\n    \t\t\t\n\n\nNo.\nB-2\t\t\t\t \t\t\t\t\t                November6, 2014\n\n\n\t\t\t\t\t\t\t\t\t\tAbt/edu/sys\n\n\n\n\n\n\nThe\nfirst step in understanding education is to understand learning and\nthe learning process.  So, what do we know about learning.  First of\nall learning is an individual matter; only the learner can learn.  To\nlearn is to change behaviour; a person who has learned has new\nknowledge a new skill or a different attitude. Learning involves\nengaging in an experience that ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "list",
  "title": "list",
  "summary": "This document presents a structured framework for educational decision-making, addressing key issues including vision, structure, school autonomy, accountability, philosophy, curriculum, and the need for self-correcting mechanisms. Don identifies essential starting points: overarching statements of beliefs, clear functions, defined services, and transparent allocation of government funding. The framework employs \"Road of Life\" as an organizing principle—described as simple, relatable, applicable across educational levels, and useful for addressing educational transitions. This approach bridges diverse perspectives and decision-making roles, providing practical guidance for educational policy and system design in PEI.",
  "content_preview": "ISSUES\n\n\n\n\n\n\n\n\n\n\n\n\t\n\nVision\n\t\n\nStructural\n\t\n\t\n\t\n\nSchool\n\tautonomy\n\t\n\nAccountability\n\t\n\nPhilosophy\n\tof Educ\n\t\n\nMandate\n\tletters\n\t\n\nCurriculum\n\t\n\nNo\n\tself- correcting mechanism\n\n\n\n\n\n\n\n\n\n\n\n\nWhere\nto begin\n\n\t\n\nOverarching\n\tstatement of beliefs/direction\n\t\n\nFunctions\n\t\n\nServices\n\t\n\nWhat\n\tGovernment will pay for\n\t\n\nWho\n\twill do what – Best way\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA\nFRAMEWORKFOR EDUCATIONAL DECISION MAKING\n\n\t\n\nEDUCATION\n\tIS A COMPLEX ISSUE\n\t\n\nNEED\n\tA FRAMEWORK FOR MAKING DECISIONS\n\t\n\nTHERE\n\tARE M",
  "theme": "10-creative-writing"
 },
 {
  "slug": "math-preparedness-2-2015-02-06t14-26-09",
  "title": "Math Preparedness (2)@2015-02-06T14;26;09",
  "summary": "A duplicate problem-solving framework diagram examining math preparedness issues through a consumer-provider lens, highlighting structural mismatches in supply, delivery timing, and documentation. The model reflects Don's systems-level analysis of how educational supply chains fail to serve diverse learner populations and impact quality of life, productivity, and opportunity.",
  "content_preview": "EduGraph\n\nProblem-solving Framework-2\n\nLOGO\n\nIssues \n\nNature of problem: Supply; timely delivery; mis-match; documentation\n\nMath consumers\t\t\t\t\t\t\t\t\t\t\tMath Providers\n\nIndividuals\t\t\t\t\t\t\t\t\t\t\t\tSchools\n\n\n\n\nEmployers\t\t\t\t\t\t\t\t\t\t        \tPostsecondary\n\nPostsecondary Institutions\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\tOn-line courses\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nProducer\t\t\t\t\t\t\t\t\t\t\t\tExperience\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tForeign Workers\n\n\n\n\nCommunity agencies\t\t\t\t\t\t\t\t\t\tNGO’s\n\n\t\t\t\t\t\t\t\t\t\t\t    Tutors\n\n\n\n\nImpact: quality of life; productivity; emplo",
  "theme": "10-creative-writing"
 },
 {
  "slug": "mother",
  "title": "Mother",
  "summary": "Elegiac poem titled \"Mother's Day\" (dated 1964) honoring Don's mother, reflecting her warmth, encouragement, and unconditional support. The poem traces her qualities—welcoming smile, cherish words, comfort on her knee, and her faith in family members regardless of their path. The shift to past tense and mention of passing a store \"I would purchase never more / For Mother\" indicates this was written after her death, expressing continued grief and longing.",
  "content_preview": "Mother’s Day\n\n\n\n\nA special day is drawing near\n\nA day when all from far and near\n\nLook forward to a meeting dear\n\nWith Mother\n\n\n\n\nA  welcome smile\n\nA cheery word\n\nWere treasures that were oft conferred\n\nBy mother\n\n\n\n\nAnd young folk have a special place\n\nOn Mother’s knee, and their embrace\n\nBrought extra gladness to the face\n\nOf Mother\n\n\n\n\nA conversation always led\n\nRegardless of the path they tread\n\nTo praise for those the race wjho led\n\nBy Mother\n\n\n\n\nAnd as for those who had not led\n\nWho stumbl",
  "theme": "10-creative-writing"
 },
 {
  "slug": "my-farm",
  "title": "My Farm",
  "summary": "Poem from October 18, 1995, describing Don's farm property—hilly, wet, wooded, and \"a treasure\" despite its challenges. He uses a tractor and ploughs as \"toys\" for pleasure rather than livelihood. Details infrastructure improvements (bridge, swamped road) and small satisfactions that evoke youth memories of rainy roofs, brooks, and summer woods. The property provides peace and serenity, suggesting a retreat from professional life.",
  "content_preview": "My Farm\n\n\n\n\nI say I have a farm\n\nBut not really\n\nIt was a farm\n\nAnd is now a piece of farm property\n\n\n\n\nIt’s hilly\n\nIts wet\n\nIts wooded and yet\n\nIt is a  treasure to me\n\n\n\n\nA tractor and ploughs\n\nAre really just toys\n\nBut they give me pleasure\n\nIn so many ways\n\n\n\n\nA bridge has been built\n\nA road has ben swamped\n\nAccess to all corners secured\n\n\n\n\nThe thins I  recall \n\nAre really quite small\n\nBut give me hours of pleasure\n\n\n\n\nThe sun and the wind\n\nAnd sometimes the rain\n\nRecall the days of my yout",
  "theme": "10-creative-writing"
 },
 {
  "slug": "my-little-girl",
  "title": "My Little Girl",
  "summary": "Narrative poem depicting a young daughter's morning routine and demands for parental attention. Captures the chaotic energy of childhood—requesting snuggles, watching cartoons, teasing the cat, and the cascading needs from early morning through school departure. Conveys parental patience, affection, and the organized chaos of raising a child, likely inspired by Don's daughter Janet.",
  "content_preview": "My Little Girl\n\n\n\nDaddy, \n\nWhere are you?\n\nI just want to know\n\nWill you snuggle with me?\n\nI don’t want you to go\n\n\n\n\nFrom daybreak \n\nTo sun down\n\nAnd later than that\n\nWatching cartoons\n\nAnd teasing the cat\n\n\n\n\nA knock on the door\n\nAt seven o’clock\n\nWakens us all\n\nNoise in the bathroom\n\nFeet in the hall\n\n\n\n\nQuiet again \n\nFor a few minutes more\n\nExcept for the footsteps\n\nAnd the rustle of paeer\n\nAnd a knock on the door\n\n\n\n\nMommy, I’m hungry\n\nWhat time is it, Mom\n\nNo use pretending\n\nNight is now e",
  "theme": "10-creative-writing"
 },
 {
  "slug": "new-friends",
  "title": "New Friends",
  "summary": "Short reflective poem dated October 22, 1981 in Vancouver, invoking Will Rogers's adage that \"strangers are friends we haven't met.\" Celebrates the experience of moving to a new community and discovering that strangers become neighbors, friends, teachers become counselors, and even landlords are not villains. Reflects Don's adaptability and ability to build community wherever he relocated during his career transitions.",
  "content_preview": "New Friends\n\n\n\n\n\n\n\nWill rogers was right\n\nStrangers are friends we haven’t met\n\n\n\n\nHow interesting again\n\nTo be catabulted\n\nInto a new community\n\nAt first so new and strange\n\nPerhaps\n\n\n\n\nThe stranger next door\n\nIs a neighbour\n\nIs a daaughter’s school mate\n\nThe teacher is a councilor\n\nThe landlord is not a villan\n\nEven the telephone voice\n\nIs no longer unknown\n\n\n\n\nYesterday we met strangers\n\nToday, they are friends\n\n\n\n\n\n\n\nVancouver, oct 22, 1981",
  "theme": "10-creative-writing"
 },
 {
  "slug": "newsletter",
  "title": "Newsletter",
  "summary": "A comprehensive template defining the newsletter structure and content categories for Open Education. The document outlines a weekly publication model with diverse content elements including bilingual articles, member profiles, products, presidential columns, guest editorials, board meeting notes, event reports, student sections, photo galleries, regular columns, advertising opportunities, and reader letters. The template emphasizes management responsibilities (editor, committee roles, distribution, timelines), technical specifications (bilingual layout, PDF format, Arial or Times New Roman fonts, color elements), and editorial workflows including article preparation, selection, editing, and proofreading. This represents Don's comprehensive vision for a professional, member-focused educational publication.",
  "content_preview": "NEWSLETTER\n\n\n\n\nName:\t\tOpen Education ?\n\nMost valuable tool for members\n\n  \nCan it serve members and public as well\n  \nShould answer questions: who, what, when, where, why, and how\n  \nForm of promotion\n  \nHelps gain support\n\n\n\n\n\nFrequency:\tWeekly\n\n\n\n\nDistribution:\tElectronic with copies available for printing for drop-off to individuals and offices\n\n\n\n\nContent:\n\n  \nBilingual articles\n  \nAbout members\n  \nProducts\n  \nAdvertisers\n  \nPresident’s column\n  \nGuest editorials\n  \nMission statement\n  \nCont",
  "theme": "10-creative-writing"
 },
 {
  "slug": "norah-the-nurse",
  "title": "Norah the Nurse",
  "summary": "Educational narrative by Don about young Janet's hospital experience, featuring nursing assistant Norah and introducing the distinction between registered nurses and nursing assistants. Story reflects Don's educational interests in vocational training and professional roles, possibly influenced by his wife Carol's nursing background.",
  "content_preview": ".- \n\n\n\n\n'. \n\n\n\n\nNORA THE NURSE \n\n\n\n\nJanet opened her eyes. She felt so sleepy. This wasn't her room. Where was she? \n\n\n\n\nShe was so tired. \n\n\n\n\nShe couldn't keep her eyes open. \n\n\n\n\nShe opened them again. A lady was standing Beside her bed. \n\n\n\n\nJanet asked, \n\n\n\n\n\"Where am 1? \n\n\n\n\nWho are yoU?\" \n\n\n\n\nThe lady answered, \n\n\n\n\n\"You are in a hospital. 1 am a nurse.\" \n\n\n\n\nSoon she \n\n\n\n\nBegan to wake up. \n\n\n\n\nShe was in a large room. Everything looked so white And clean. \n\n\n\n\nThe nurse had on A white u",
  "theme": "10-creative-writing"
 },
 {
  "slug": "occasional-ppapers-guidelines",
  "title": "Occasional ppapers Guidelines",
  "summary": "Guidelines for an \"Education First\" initiative to publish occasional papers on education topics for public dissemination. The document argues that information is essential fuel for educational change and that public engagement requires accessible information beyond what educators typically provide. Proposed characteristics include stand-alone issues limited to two pages, a standardized format, and guest author opportunities. Initial topic suggestions include outcomes and competencies, standards, and independent learners. The guidelines emphasize working with diverse writers (journalism students, retirees, professional journalists) and prioritize Island expertise, revealing Don's commitment to making educational research accessible to non-specialist audiences and fostering community-based discourse.",
  "content_preview": "Draft October 16, 2012\n\nGuidelines\nfor Occasional Papers\n\nBackground:\n\n\n\n\n\n\nIt\nis widely recognized that the level and quality of education is key\nto our future as individuals, families, communities and countries. \nThere is also a widely held view that the education system we now\nhave is unlikely to provide the kind of education our people need,\nespecially our young people.  There is a widespread call for change\nfrom many quarters, including educators, employers, and the public at\nlarge. The fie",
  "theme": "10-creative-writing"
 },
 {
  "slug": "p1-school-autonomy",
  "title": "P1-School autonomy",
  "summary": "A polling proposal from Don Glendenning regarding school autonomy and accountability, referencing an October 2011 OECD PISA report. The document notes that countries with greater school autonomy over curriculum and assessment tend to show better student performance, especially when coupled with public accountability (posting achievement data). Conversely, autonomy without accountability measures correlates with worse performance. Don proposes specific poll questions: whether respondents favor greater school autonomy in daily operations and whether schools should post PISA results publicly. This represents Don's evidence-based approach to educational policy, grounded in international comparative research.",
  "content_preview": "School\nAutonomy \n\n\nPoll\nNo. 1\n\n\n\n\n\n\nWe\nspoke on occasion about conducting polls and surveys.  I am wide open\nto any suggestion but propose school autonomy and accountability as a\nplace to start.  As background:\n\n\n\n\n\n\n\n“PISA in Focus, an OECD\nreport in October, 2011 reported that:\n\n\t\n\nIn\n\tcountries where schools have greater autonomy over what is taught\n\tand how students are assessed, students tend to perform better. \n\t\n\t\n\nIn\n\tcountries where schools account for their results by posting\n\tachievem",
  "theme": "10-creative-writing"
 },
 {
  "slug": "panel-2",
  "title": "Panel 2",
  "summary": "Panel recruitment worksheet for Math Map project identifying ideal characteristics (articulate, active in community, representative, balanced) and typical occupations represented (farmers, health workers, IT professionals, supervisors, youth workers, community organizers). Lists 11 specific potential candidates including Tanya Craig, Martina MacDonald, Regis Duffy, Margaret Ching, and others from various PEI sectors. Shows Don's deliberate network-building and community engagement in recruiting diverse panel members.",
  "content_preview": "Math\nMap Panel \n\n\n\nWorksheet\n\n\n4\n\n\nTwelve\nmembers  who collectively demonstrate mathematic skills of a kind and\nat a level deemed needed for every day functioning.\n\n\nCharacteristics:\n\n\t\n\nArticulate\n\t\n\nActive\n\tin community\n\t\n\nRepresentative\n\t\n\nBalanced\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTypical\n\n\t\n\nA\n\tyouth\n\t\n\nField\n\n\n\t\n\nTourism\n\t\n\nFarmer\n\t\n\nCountry\n\tstore operator\n\t\n\nHealth\n\t\n\nCall\n\tcentre\n\t\n\nIT\n\n\n\t\n\nCommunity\n\torganizations\n\n\n\t\n\nYouth\n\tworker\n\n\n\t\n\nCall\n\tcentre supervisor\n\t\n\nIT\n\t\n\nHealth\n\t\n\t\n\t\n\nNew\n\temploy\n\t\n\nFirst",
  "theme": "10-creative-writing"
 },
 {
  "slug": "panel-3",
  "title": "Panel 3",
  "summary": "Expanded list of 20+ potential panel members for Math Map analysis including educators, entrepreneurs, community leaders, and artists from across PEI (Tanya Craig, Martina MacDonald, Regis Duffy, Margaret Ching, John Lane, Hazel Robinson, Marion Reid, and others). Reflects Don's broad community connections and deliberate strategy to represent diverse perspectives from rural/urban, cultural, occupational, and educational backgrounds.",
  "content_preview": "Math\nMap Panel \n\n\n\nWorksheet\n\n\n4\n\n\nTwelve\nmembers who collectively demonstrate mathematic skills of a kind and\nat a level deemed needed for every day functioning. Panel members\nshould be articulate, active, social and representative -age,\nrural/urban, male/female, language, aboriginal\n\n\n\n\n\n\n\n\nPotential\npanel members\n\n\t\n\nTanya\n\tCraig, Events Coordinator, Stratford\n\t\n\nMartina\n\tMacDonald, Rural Economic Development. Montague\n\t\n\nRegis\n\tDuffy, Employer, Charlottetown\n\t\n\nMargaret\n\tChing, Potato Grower",
  "theme": "10-creative-writing"
 },
 {
  "slug": "panel-4",
  "title": "Panel 4",
  "summary": "Another panel recruitment worksheet emphasizing specific demographic characteristics desired: youth, recent immigrants, Aboriginal members, public school non-completers, unemployed/job-seekers, people with health issues. Lists 25+ candidate names including diverse occupations (farmers, tourism operators, construction, sports, arts). Shows Don's commitment to inclusive, representative panel composition reflecting actual PEI community diversity rather than traditional educational or business elite.",
  "content_preview": "Math Map Panel \n\n\n\nWorksheet\n\n\n4\n\n\nTwelve members who\ncollectively demonstrate mathematic skills of a kind and at a level\ndeemed needed for every day functioning.\n\n\nCharacteristics:\n\n\t\n\nArticulate\n\t\n\nActive\n\tin community\n\t\n\nRepresentative\n\t\n\nOpen\n\tminded\n\t\n\nNot\n\tactive in education\n\t\n\nges\n\t\n\nDiverse\n\tinterests and experience\n\n\n\n\n\n\n\n\n\nTypical\n\n\t\n\nA\n\tyouth\n\t\n\nRecent\n\timmigrant\n\t\n\nAboriginal\n\t\n\nMember\n\tof start-up Zone\n\t\n\nPublic\n\tschool non completer\n\t\n\nUnemployed/seeking\n\twork\n\t\n\nSomeone\n\twith hea",
  "theme": "10-creative-writing"
 },
 {
  "slug": "panel-8",
  "title": "Panel-8",
  "summary": "Panel 8 participant list (October 7-8, 2019) with names, contact details, and organizational affiliations. Includes diverse participants such as Bipin Singh (Software Engineer, recent immigrant), Melissa Peter-Paul, Matt Brown, and ongoing core team members. Reflects Don's commitment to including varied demographic perspectives in curriculum design.",
  "content_preview": "CITIZEN\nMATH PANEL-8\n\n\nOctober\n7and 8, 2019\n\nN0te:\nRemove extra pages\n\n\t\n\nMartina\n\tMacDonald, Director, Rural Action Centre, Montague, (902-838-4030.\n\tExt. 223), martina.macdonald@cbdc,ca\n\t\n\nMike\n\tRedmond,  Director, Bedford MacDonald House, 184 Weymouth St,\n\tCharlottetown, C1A 4Z3;  902-892-9242\n\t\n\nMelissa\n\tPeter-Paul mpeterpaul@gmail.com,\n\t902-  ) mpeterpaaul@gmail.com\n\t\n\nMatt\n\tBrown, businessman,  Home schooling ,(matthew@peibrowns,com) \n\tBayshore, PEI, (902-978-1304) or 8704?\n\t\n\nGloria\n\tWelt",
  "theme": "10-creative-writing"
 },
 {
  "slug": "paul-the-politician",
  "title": "Paul the Politician",
  "summary": "Educational narrative by Don about young Bruce learning about his father's political campaign and election, including discussion of platform issues (jobs, highway safety, downtown mall). Story teaches civic engagement and democratic processes, reflecting Don's interest in education and community participation.",
  "content_preview": "PAUL THE POLITICIAN \n\n\n\n\nBruce \n\n\n\n\nHeard people talking. He listened \n\n\n\n\nAnd Listened \n\n\n\n\nBut couldn't quite hear What was being said. \n\n\n\n\nAfter \n\n\n\n\nHe went to bed \n\n\n\n\nThe door bell rang And people \n\n\n\n\nCame to the house \n\n\n\n\nThey sat in the living room And talked with his father. Mostly they talked \n\n\n\n\nIn low voices \n\n\n\n\nBut \n\n\n\n\nOnce in a while He heard names \n\n\n\n\nNames he heard before And sometimes \n\n\n\n\nRead about in the paper. \n\n\n\n\nA few days later His daddy said \n\n\n\n\nHe was going to ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "planning-sheet-1",
  "title": "Planning sheet 1",
  "summary": "July 2016 planning document for Beyond Measure screening showing budgeting, task assignments, and strategic decisions. Projected revenue of $2,100 from sponsors and ticket sales; estimated expenses of $900. Assigns Don to invite major donors (Regis Duffy, Roger Birt, David Smith), work with directors to obtain sponsors, and manage general logistics. Specifies promotional strategy through newsletters, Facebook, and media release (Don to oversee media relations). Discussion question prepared: \"What is the implied contract between a community and its school?\" Shows detailed organizational thinking.",
  "content_preview": "July 7, 2016\n\npro/film\n\nEducation 20/20 Inc.\n\nPlanning sheet\n\n\n\n\n\n\n\n\n\n\nFilm:\tBeyond Measure\n\nCity Cinema, Sunday, October 16, 2016; 2:00 pm – Capacity 70 seats\n\nBudget: \n\n\n\n\n  \n    \n      \n        \n\n\n      \n      \n        \nRevenue\n      \n      \n        \nBudget\n      \n      \n        \nIncome\n      \n    \n    \n      \n        \n\n\n      \n      \n        \nSponsors (15x$100)\n      \n      \n        \n\t$1,500\n      \n      \n        \n\n\n      \n    \n    \n      \n        \n\n\n      \n      \n        \nTickets (60x$5 )\n ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "poetry",
  "title": "Poetry",
  "summary": "Don shares a poem his father taught him about perseverance and trying again, and a traditional nursery rhyme about crows. He notes the poem reflected his father's values and expresses concern about the loss of such traditional rhymes in younger generations.",
  "content_preview": "Poetry \n\nMy Dad liked to recite poetry and taught me to do the same.  Here is one poem I remember:\n\n \n\nStanding at the foot, boys\n\nGazing at the sky\n\nHow can you get up, boys\n\nIf you never try?\n\n \n\nThough you be discouraged\n\nNever be downcast\n\nTry and try again, boys\n\nYou’ll succeed at last\n\n\n\n\n\n\n\nNursery rhyme:\n\n\n\n\nJennie Foley (we are both descended from John Peters and Jane (Sealey) Peters) reminded me of the following rhyme usually triggered when spotting one or more crows: \n\n\n\n\nOne crow sor",
  "theme": "10-creative-writing"
 },
 {
  "slug": "post-3",
  "title": "Post-3",
  "summary": "This incomplete but insightful piece addresses Don's persistent frustration with conflating education and schooling. He defines education as \"an experience that has a formative effect on the way we think feel or act,\" emphasizing it as a personal change process occurring across diverse contexts and relationships. The distinction matters crucially: schools organize directed learning experiences, but education extends far beyond institutional boundaries. He notes that much early education occurs in homes and families, with schools playing a supplementary role. The piece critiques misleading appropriation of \"education\" terminology by schools.",
  "content_preview": "Blog-3\n\n\n\n\nMy brother-in-law used to delight in telling stories about the impeccable grammar of teachers of English, especially about the use of “I” and “me”.  My frustration, however, comes from the failure of people, especially educators, to distinguish between education and schooling.  The most recent being a question from a new friend about where I got my education; it turned out, what he really wanted to know was where I went to university.\n\n\n\n\nOn the one hand, when I think of a person purs",
  "theme": "10-creative-writing"
 },
 {
  "slug": "reading-competencies-1",
  "title": "reading competencies 1",
  "summary": "An ad hoc working document listing comprehensive reading competencies and skills. The document catalogs diverse reading-related abilities including critical reading, comprehension, vocabulary, interpretation of various text formats (prose, graphs, drawings, manuals, tables, symbols, labels), word attack skills, and specialized reading modes (skimming, scanning, extensive, intensive reading). The list addresses contemporary needs such as reading text messages and computer printouts alongside traditional literacy skills. This appears to be a working reference tool for curriculum development, organizing reading competencies by type and application to support evidence-based literacy instruction in educational systems.",
  "content_preview": "Competencies/Skills/outcomes (Ad hoc list)\n\nA reader is able to: \n\n  \nDemonstrate critical reading skills\n  \nChoose words appropriate to the subject\n  \nComprehend what has been read\n  \nSpeak fluently\n  \nExhibit a wide vocabulary\n  \nRead and Interpret Prose\n  \nRead and interpret graphs\n  \nRead and interpret\n  \nRead and interpret drawings\n  \nRead and interpret manuals\n  \nRead and interpret tables\n  \nRead and interpret symbols\n  \nRead and interpret manuals\n  \nRead and interpret instructions\n  \nRead",
  "theme": "10-creative-writing"
 },
 {
  "slug": "reading-list",
  "title": "Reading List",
  "summary": "A curated reading list on religion, Christianity, and biblical studies including works by Karen Armstrong, John Shelby Spong, Bart Ehrman, and Christopher Hitchens. The list reflects Don's intellectual engagement with diverse theological perspectives and historical biblical scholarship.",
  "content_preview": "Reading List\n\n\n\n\n\n\n\nArmstrong, Karen, The Case for God\n\nBaigent, Michael, The Jesus Papers, Harper/Collins, 2006\n\nClifford, N. Keith, The Resistance to Church Union in Canada, 1904-1939, UBC Press, 1985\n\nFinkelstein, Israel,  and Silberman, Neil Asher,  The Bible Unearthed, Free Press New York, 2001\n\nGear, Kathleen and Michael, The Betrayal Pelikan, Jaroslav, Whose Bible is it? Viking 2005\n\nHalley, Henry H, Bible Handbook, Zondervan Publishing,1964\n\nHistory of Christianity, Lion Publishing, 1977",
  "theme": "10-creative-writing"
 },
 {
  "slug": "recollections",
  "title": "Recollections",
  "summary": "Short poetic reflection by Don (December 1973) on Christmas memories and lost loved ones, with meditation on stillness and the question of whether others will remember his Christmas with him. Shows his introspective and emotional nature, particularly around family and the passage of time.",
  "content_preview": "Recollections\n\nIn the night\n\nStillness\n\nChristmases\n\nOf yesteryear\n\n\n\n\n\n\n\nImages \n\nOf loved ones\n\nNo longer with us\n\nWhy so at Christmas\n\nWhy? Why? Why?\n\n\n\n\nMemories flooding\n\nYet fully remembered\n\nWill someone remember\n\nThis Christmas with me?\n\n\n\n\nDecember 1973",
  "theme": "10-creative-writing"
 },
 {
  "slug": "scale-reading",
  "title": "Scale, Reading",
  "summary": "Reading proficiency scale with five progressive levels plus a zero level, assessing literacy competency from non-recognition (Level 0) through complex technical reading (Level 5). Level 5 describes reading diverse complex materials with fluency and ease; Level 3 represents functional reading of newspapers with occasional assistance; Levels 2-1 describe narrower reading capacity and basic sign/instruction interpretation. Includes pedagogically significant note that Level 3 reading competency is required for active citizenship, establishing baseline literacy expectations for civic participation. This framework acknowledges literacy as essential to democratic engagement and community participation, reflecting Glendenning's commitment to education's civic purpose.",
  "content_preview": "Reading\nlevels:\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\tA\n\t\t\t\t\t\t\t\tPERSON:\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t5\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\nCAN\n\t\t\t\t\t\t\t\tREAD\n\t\t\t\t\t\t\t\ta wide variety of complex printed materials, including\n\t\t\t\t\t\t\t\ttechnical material, with fluency, ease and without assistance\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\nCAN\n\t\t\t\t\t\t\t\tREAD a\n\t",
  "theme": "10-creative-writing"
 },
 {
  "slug": "school-characteristics",
  "title": "School, characteristics",
  "summary": "A refined critique from February 2014 explicitly comparing school system characteristics against current educational thinking. Don identifies key discrepancies: client-centeredness versus content delivery, achievement versus time spent, teaching versus instructing, spiral versus linear curriculum, and coaches versus referee models for teachers. The document reinforces absence of market mechanisms creating perverse incentives and critiques the monopoly structure preventing outsourcing, credit for external learning, or independent assessment. Non-educational activities (ranking, transportation, fundraising, competitive sports, day care) are identified as distraction from core educational mission. This refined version demonstrates Don's evolving sophistication in diagnosing systemic problems and the conceptual frameworks needed for reform.",
  "content_preview": "Outlines\n\nFebruary 16, 2014\n\nCharacteristics of School System\n\n\n\n\nSchools - a system of delivering knowledge to youth\n\n\n\n\nDiscrepancy with current thinking:\n\n  \nClient centeredness vs delivery of content\n  \nAchievement vs time spent\n  \nTeaching vs Instructing\n  \nSpiral  vs linear curriculum\n  \nDevelopment vs delivery model\n  \nAchievement vs ranking\n  \nTeacher as coach vs referee\n  \nCollegial vs expert\n  \nTeaching vs administration\n  \nKnowledge vs education\n  \nExpert vs bureaucrat directed\n  \nMuz",
  "theme": "10-creative-writing"
 },
 {
  "slug": "structuring-2-b",
  "title": "Structuring-2-B",
  "summary": "Detailed structural reform proposal grounding education in six life roles (individual, citizen, family member, student, consumer, producer) and advocating reorganization around functions rather than client demographics. Glendenning draws on Australian and international examples, emphasizing that autonomy combined with accountability enables educators to tailor services to diverse learner needs without significant cost.",
  "content_preview": "About\nEducation\n\nDon\nGlendenning\n\nStructure\n\nNo.\n5\t\t\t\t\t\t\t\t\t\t\t\tDoc. 5\n\n-------------------------------------------------------------------------------------------------------------------------------\n\nPeople\nare said t fill six life roles, that of an individual, citizen,\nfamily member, student, consumer and producer, an education system is\nto help people prepare for and thrive in those roles.\n\n\n\n\n\n\nThere\nare various suggestions as to the best way to prepare.\n\nTypically,\nthe structure of organizati",
  "theme": "10-creative-writing"
 },
 {
  "slug": "sunrise-at-glenway",
  "title": "Sunrise at Glenway",
  "summary": "A meditative poem celebrating the dawn over Orwell Bay as seen from Glenway (the summer cottage). Don captures the beauty of the landscape—water, silos, geese—and expresses gratitude for natural blessings and the privilege of owning property with such views. The poem reflects his love of the cottage property and his poetic sensibility, using natural imagery to express contentment and spiritual appreciation.",
  "content_preview": "Sunrise at Glenway\n\n\n\n\n\n\n\nThe flag flutters idly in the breezes\n\nThe water ripples gently in the bay\n\nThe silos point their domes toward the heavens\n\nAs morning dawns again on Orwell Bay\n\n\n\n\nThe sky begins to brighten to the eastward\n\nShaping silhouettes along the way\n\nThe canopy above begins to brighten\n\nAs dawn returns again to Orwell Bay\n\n\n\n\nThe stars hhve disappeared at glenway\n\nThe moon has disappeared in light of day\n\nThe morn is about to break in all its glory\n\nAs I contemplate the  beaut",
  "theme": "10-creative-writing"
 },
 {
  "slug": "susan-the-secretary",
  "title": "Susan the Secretary",
  "summary": "A children's story written by Don in which his young daughter Janet visits her father's office (likely as President of Holland College) and learns about office work by observing secretary Susan. The narrative shows Don's professional role and family life, using the encounter to teach his daughter about secretarial duties and office procedures. The story reflects his ability to use his leadership position as a teaching opportunity for his child.",
  "content_preview": ", \n\n\n\n\nft!-'\" .,-/ ..: \n\n\n\n\n, \n\n\n\n\nSUSAN THE SECRETARY \n\n\n\n\nJanet looked out the window \"Here's Daddy\", she said \n\n\n\n\nAs a car turned into the driveway. \n\n\n\n\nShe ran to him \n\n\n\n\nWhen he came into the house. \n\n\n\n\nDaddy said, \n\n\n\n\n\"Sorry I'm late tonight, \n\n\n\n\nBut my secretary was sick today.\" \n\n\n\n\n\"What's a secretary?\" Janet asked. \n\n\n\n\nII A secretary\", Daddy said \n\n\n\n\n\"Is a person \n\n\n\n\nWho helps me in my office.\" \"But what does she do?\" Janet asked. \n\n\n\n\n\"Well\", said Daddy, \n\n\n\n\n\"You come to my ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "system-10-elements",
  "title": "System, 10 elements",
  "summary": "Shorter document synthesizing components of successful education systems from multiple sources. Identifies problems with current systems (examination-oriented, outdated teaching, lack of innovation). Lists Lay Kee Ching's inclusive system elements: rigorous learning models, diverse criteria, problem-solving mindset, personalized methods, technology use, faculty training, curriculum, adaptive courses. Presents Business Roundtable components (standards, assessments, accountability, professional development, autonomy, parent involvement, learning readiness, technology, safety/discipline) and Community Education Principles (lifelong learning, self-determination, help, leadership development, responsiveness, integrated delivery, localization, resource use, inclusiveness, information access).",
  "content_preview": "About Education\n\nGlendenning\n\nSYSTEM\n\n1-11\n\nInnova schools\n\nHudson, Leask ND Younie – Education System Design, 2020\n\nHill. J.E, Designing a school sysem that Learn.Univ of Calgary, 200\n\n\n\n\nProblems with our current system:\n\n  \nExamination oriented\n  \nOutdate teaching practices\n  \nLack of Innovation\n  \nLevels -primary,Secondary, Higher)\n\n\n\n\n\nElements of an Inclusive Education system- Lay Kee Ching\n\n  \nA rigorous model of learning\n  \nDiverse learning criteria\n  \nProblem solving mindset\n  \nPersonal",
  "theme": "10-creative-writing"
 },
 {
  "slug": "system-school-current",
  "title": "system school Current",
  "summary": "A systems analysis of Canada's public school system written June 25, 2011. Don applies systems theory to education, defining a school system as a human-made entity with bounded components, relationships, designed outputs, and governing rules. He describes the current system's purpose as helping youth gain skills, knowledge, and attitudes for life roles, existing as either preparation for employment or personal growth. The document catalogs the system's basics (ages 6-16 compulsory attendance, September-June calendar), characteristics (state-run monopoly with limited participation), service gaps, and system weaknesses including focus on post-secondary preparation, diffused accountability, poorly defined standards, limited public input, outdated delivery model, and lack of coordination. This represents Don's sophisticated understanding of educational systems and their structural limitations in serving diverse learner needs.",
  "content_preview": "June 25, 2011\n\n\nEdu2020-A5\n\n\nSchool System?\n\n\n\n\n\n\n\n\nSchool system:\n\n\t\n\n\n\tis a human made system\n\t\n\nWith a\n\tboundary \n\t\n\t\n\n comprised\n\tof a set of components and relationships\n\tof interconnected parts \n\t\n\t\n\nDesigned to\n\twork as a coherent entity for the delivery of outputs\n\t\n\n\n\tThe term system may also refer to a set of rules that governs\n\tstructure and/or behavior\n\n\n\nMost systems share common characteristics, including:\n\n\t\n\n\n\tSystems have structure,\n\tdefined by components/elements and their comp",
  "theme": "10-creative-writing"
 },
 {
  "slug": "the-clock",
  "title": "The Clock",
  "summary": "A nostalgic poem from December 1973 reflecting on an old clock that once stood in a country kitchen during Don's boyhood. The poem traces the clock's journey through different homes and its witness to joyful and sad occasions, using it as a metaphor for the passage of time and memory. This piece reveals Don's sentimental connection to childhood and objects of domestic life.",
  "content_preview": "The Clock\n\n\n\n\nIt stands\n\nUnused to adulation\n\nAnd in its tranquility\n\nTicks away the time\n\n\n\n\nA memory of other times\n\nOf boyhood recollection\n\n\n\n\n\n\n\nIts advent \n\nOn a winter night\n\nAccompanied by excitement\n\n\n\n\nFor years i\n\nIt marked the time\n\nIn a country kitchen\n\n\n\n\nIt held a high position\n\nSurrounded by matches\n\nA key or two\n\nAnd two stalwart oil lamps\n\n\n\n\nIt marked occasions\n\nBoth joyous and sad\n\nTime passed quickly \n\nPeople assed on\n\nIt found a new home\n\n\n\n\nIt stands again\n\nProud of its hi",
  "theme": "10-creative-writing"
 },
 {
  "slug": "the-protector",
  "title": "The Protector",
  "summary": "A short poem from Vancouver (October 1981) about an umbrella, using it as a metaphor for protection and irony (when the umbrella is up, people are down indoors). Don displays his ability to find meaning and humor in everyday objects through wordplay and observation about the relationship between weather and human activity.",
  "content_preview": "The Protector\n\n\n\n\n\n\n\nFinished\n\nFor the day\n\nIt stands in a corner\n\n\n\n\nNeither open \n\nNor furled\n\nPoint set firmly\n\nIt leans against the wall\n\n\n\n\nIts usefuleness is attested to\n\nBy the puddle of water\n\nAround it on the floor\n\n\n\n\nWill duty call today?\n\nTomorrow?\n\nTis too soon to tell\n\nStaying or going \n\nWill depend\n\nOn the weather\n\n\n\n\nWhen its up\n\nPeople are down\n\nWhen its down\n\nPeople are up\n\n\n\n\nThat’s one of the strange things\n\nAbout an umbrella\n\n\n\n\nVancouver, October 22, 1981",
  "theme": "10-creative-writing"
 },
 {
  "slug": "tom-the-technician",
  "title": "Tom the Technician",
  "summary": "A children's story about young Brian visiting his Uncle Tom in Hamilton and learning about his work as an electronic technician at Westinghouse, testing color television sets. The story follows Brian's fascination with factory work and technical instruments, and his dream of becoming a technician himself. This reflects Don's family experience and interest in making technical work understandable to young people.",
  "content_preview": "TOM THE TECHNICIAN \n\n\n\n\nBrian was happy, \n\n\n\n\nHe was on vacation. \n\n\n\n\nDaddy, Murnmie, and Janet were on vaction also. But most important, \n\n\n\n\nThey would spend a few days in Hamilton And Brian would see Uncle Tom, \n\n\n\n\nHe could hardly wait. \n\n\n\n\nSoon Daddy said - \n\n\n\n\n\"Only five more miles\". Then Brian saw a sign, \n\n\n\n\nIt said 'Hamilton Next Exit'. He could hardly wait. \n\n\n\n\nDaddy pulled off the big highway He went down Main Street \n\n\n\n\nHe turned right on Johnson Avenue. \n\n\n\n\nD~ddy said - \"This",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-2",
  "title": "Untitled 2",
  "summary": "A year-end reflection written December 30, 1986, meditating on sunlight, shadows, and the passage of time. The poem contemplates life's ups and downs, the search for perspective and understanding as the year ends, and hope for renewal in the coming year.",
  "content_preview": "Untitled\n\n\n\n\n\n\n\nYear end,\n\n Sunlight, \n\nShadows, \n\nReflections, \n\nNew Year. \n\n\n\n\nSunlight glitters \n\nOn new fallen snow \n\nOn the window sill.\n\nIn the yard, \n\nOn a neighbour's roof \n\nAcross the harbour \n\nDisappearing over the horizon. \n\n\n\n\n\n\n\nSunshine of Christmas \n\nFamily \n\nFriends \n\nHealth \n\nAccomplishments \n\nAglow at year end. \n\n\n\n\n\n\n\nShadows accompany \n\nDays at bright sunshine \n\nSome playing lightly \n\nOn Life's unfolding \n\nOthers unfathomable \n\nForbidding, \n\nForeboding, \n\nDarkest of shadows \n",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-3",
  "title": "Untitled 3",
  "summary": "A creative poem or meditation exploring themes of connection, communication, and interpersonal relationships through poetic language.",
  "content_preview": "I read your not e \n\non Sat urda y after \n\nan absence from my office. \n\n\n\n\nIt pI ea sed me to hear again but regret \n\nthat you favoured \n\nNewfoundland over P.E.I. \n\n\n\n\nPerhaps \n\nNext time \n\nThe attraction of the \n\nCradle of Confederation wi 11 d r a ,-7 you \n\nAnd \"\\ole can sha re \n\na coffee \n\nor better still a LOBSTER \n\nFresh from \n\nthe warmest salt water \n\nNor tho f FI 0 rid a • \n\n\n\n\nBut guilt \n\nAlso prevailed \n\nBecause \n\n\n\n\nyour earlier notes and book \n\nsat immobile \n\nThough read \n\non a side ta",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-4",
  "title": "Untitled 4",
  "summary": "A creative writing piece exploring relationships and emotional connections. The fragment suggests personal reflection on human bonds and attachment.",
  "content_preview": "Untitled\n\n\n\n\n\n\n\nYour note received\n\nConsidered\n\nReflected\n\nUnanswered\n\nBut not forgotten\n\n\n\n\nThoughts jumbled\n\nTumbled\n\nNew Shapes\n\nChange and uncertainty\n\nFinal transition\n\nJust 10days away\n\n\n\n\nAlthough role changing\n\nTravels continue\n\nPerhaps my next visit\n\nWill see us share tea\n\n\n\n\nJune 21, 1987",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-5",
  "title": "Untitled 5",
  "summary": "Document from Don Glendenning's personal writing collection. Content includes Upon my desk, they sat\nOpened, read and contents noted\nBut still unanswered\nFor ere so long\nMy consc...",
  "content_preview": "Upon my desk, they sat\n\nOpened, read and contents noted\n\nBut still unanswered\n\nFor ere so long\n\nMy conscience is much troubled\n\n\n\n\nSo with the spirit of the season\n\nI sit this morn\n\nTo pen to you\n\nA few rambling thoughts\n\n\n\n\nFirst\n\nLet me assure you that\n\nMy breach of etiquette\n\nHas naught to do with you\n\nNor anything you penned\n\nBut simply \n\nMy unorganized\n\nAnd disorganized\n\nAnd unfocussed\n\n(Or too focused)\n\nStyle of living\n\n\n\n\nEnough said\n\nLet us move on\n\nI note on re-reading\n\nThat the source ",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-6",
  "title": "Untitled 6",
  "summary": "Creative writing piece exploring personal thoughts and experiences through verse.",
  "content_preview": "Untitled\n\n\n\n\nBeside the fire I sit\n\nAnd pen this note\n\nWhile the household sleeps\n\nOt, at least, rests\n\n\n\n\nThe evening shortened\n\nBy the stroke of\n\nSome lawmakers pen\n\nProvides a lengthened \n\nPeriod for\n\nRelaxation and reflection\n\n\n\n\nLife also\n\nIs shortened\n\nBy powers beyond us\n\n‘tis strange \n\nTo reflect upon\n\nWho knows what regulations\n\nAre  being struck for me\n\n\n\n\nEvents\n\nIn kaleidoscopic fashion\n\nImpinge and infringe\n\nUpon us\n\nUnclear and uncertain\n\nIn their machinations\n\nThey push\n\nPull\n\nLif",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-7",
  "title": "Untitled 7",
  "summary": "Creative writing piece by Don Glendenning exploring personal themes and reflections through poetic expression.",
  "content_preview": "Untitled\n\n\n\n\nIn the US of A\n\nOn an earlier day\n\nA son came to us\n\nWithout much fuss\n\n\n\n\nToday he’s grown\n\nTall and lean\n\nAnd on his way\n\nHe turned sixteen\n\n\n\n\nIt’s not hard to  guess\n\nWhat he will find\n\nBut this little game\n\nWill test his mind\n\n\n\n\nThe Beatkles record\n\nHe will tresure\n\nIt will give him\n\nHours of pleasure\n\n\n\n\nAnd before I give t\n\nThe benedicton\n\nHere’s money for\n\nYour science fiction\n\n\n\n\nEnjoy these things\n\nAnd your birthday, too\n\nHave a happy day\n\nAnd a good year, too",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-8",
  "title": "Untitled 8",
  "summary": "An untitled poem by Don about childhood evening routines—playtime chaos, mealtime chatter, bedtime resistance, and a daughter seeking her father's comfort and presence. The piece captures the tender domestic moments of parenting with vivid sensory details and emotional connection.",
  "content_preview": "Untitled\n\n\n\n\n\n\n\nEvening excitement\n\nFriends in to play\n\nDolls and doll clothing\n\nToys and paper\n\nNot ut away\n\n\n\n\nSupper and chatter\n\nNoise never ending\n\nTears\n\nTemper tantrums\n\nTo get her own way\n\nBed time at last\n\nReluctantly going\n\n“I need something to eat’\n\n“My nose needs blowing”\n\n\n\n\nIn bed with her playthings\n\nAnd not yet asleep\n\nYou quietly sneak out\n\nNot making a peep\n\n\n\n\n“Daddy, where are you?\n\nI just want to know\n\nWill you snuggle with me\n\nI just want to know\n\n\n\n\nUndated",
  "theme": "10-creative-writing"
 },
 {
  "slug": "untitled-9",
  "title": "Untitled 9",
  "summary": "A reflective poem from December 1973 exploring themes of time, uncertainty, and human struggle. The verses touch on problems solved in the night, concern for the less fortunate, the relentless passage of minutes and hours, and the preciousness of time as a limited resource. The philosophical tone suggests contemplation during a significant period in Don's life, coinciding with his presidency at Holland College.",
  "content_preview": "Untitled\n\n\n\n\n\n\n\nHyper\n\nPerhaps\n\nMorning approaches\n\nProblems are solved\n\nIn the still of the night\n\n\n\n\nOthes\n\nLess fortunate\n\nDrowning their sorrows\n\nUnable to cope\n\nWith a rising tomorrow\n\n\n\n\nMinuutes and hours\n\nTRelentlessly passing\n\nDecisions required\n\nWhat will they be?\n\n\n\n\nNo use delaying\n\nSand has all fallen\n\nAnswers are given\n\nTime will tell\n\n\n\n\nTim is important\n\nLimited quantity\n\nWhen will we learn\n\nTo treasure its worth\n\n\n\n\nDecember 1973",
  "theme": "10-creative-writing"
 },
 {
  "slug": "upon-my-desk",
  "title": "Upon my desk",
  "summary": "A short poem dated June 10, 1986, reflecting on unanswered correspondence sitting on Don's desk. The poem explores his internal conflict about responding, noting uncertainty about the purpose and origin of the message, and his desire to respond with care and uncommon commitment. Brief but revealing of Don's conscientious personality and tendency to overthink correspondence.",
  "content_preview": "Upon my desk\n\n\n\n\nUpon my desk \n\nIt sat \n\nINtruding \n\nINtriquing \n\nOccasionally Attracting. \n\n\n\n\nI read\n\nAND thought\n\nAND said \n\nI must respond\n\nBut HOW? \n\n\n\n\nPurposes, \n\nMESSages\n\nOrigin\n\nUNcertain \n\n\n\n\nOBviously \n\nA MISSION personal \n\nRespond in Kind \n\nWith CARE \n\nAnd UN-COMMITTED\n\n\n\n\n\n\n\nJune 10, 1986",
  "theme": "10-creative-writing"
 },
 {
  "slug": "w-1-5-life-road-2015-03-04t15-07-08",
  "title": "W-1-5  Life Road  @2015-03-04T15;07;08",
  "summary": "A detailed educational framework diagram mapping learning support mechanisms (assistance, information, instruction, feedback, self-study) across multiple life roles including family member, student, consumer, producer, and citizen. The model emphasizes continuous learning and adaptation across diverse social roles.",
  "content_preview": "W-1-5\n\nLearning\nfor Life\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tLife\nRoles\n\n\t\n\n\n\tAssistance\t\n\t\nInformation\n\t\nInstruction\t\n\t\nAttempt\n\ttask\t\n\t\nFeed\n\tback \t\n\t\nSelf\n\tstudy resources\n\t\nOn-line\n\tcourse \n\t\n\t\nExperience\t\n\t\nSelf\n\tevaluate\t\n\t\t\t\t\t\t\t\t\t\t\t\tIndividual\t\t\t\t\n\n\n\nFamily\nmember\t\n\n\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tStudent\t\t\n\n\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tConsumer\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tProducer\t\t\t\t\t\t\t\t\t\t\t\t\n\n\nCitizen\n\nLearner",
  "theme": "10-creative-writing"
 },
 {
  "slug": "zassess-methods",
  "title": "ZAssess Methods",
  "summary": "Document cataloging diverse assessment methods organized into five categories: Selected Response (true/false, matching, multiple choice), Essay Assessment, Performance Assessment (skills demonstration, product creation, role-playing, portfolio), and Personal Communication (questioning, discussion, interviews, parent/teacher conferences). Attributes approach to Richard Stiggins. Represents comprehensive, multi-modal approach to educational assessment reflecting contemporary best practices in educational measurement.",
  "content_preview": "ASSESSMENT METHODS \n\nSelected Response \n\nTrue or False \n\nMatching \n\nMultiple Choice \n\nFill in the Blanks \n\nQuizzes \n\nAssignments \n\nEssay Assessment \n\nPerformance Assessment \n\nDemonstrate a skill \n\nCreate a product \n\nRole Playing \n\nPortfolio \n\nPersonal Communication \n\nAsking Questions \n\nListening to answers \n\nListening to Discussion \n\nInterviewing Students in Conferences \n\nTalking with parents \n\nTalking with other teachers \n\nRichard Stiggins \n\nPhi Delta Kappan \n\n1995",
  "theme": "10-creative-writing"
 }
]