[
 {
  "slug": "0-cover-2",
  "title": "0 Cover 2",
  "summary": "(100-200 words):**\nCover page for \"Education Framework\" (referenced as Doc/About/Binder 4), authored by Donald E. M. Glendenning, Charlottetown, PEI, 2024. Indicates companion volume to the About Education binder. Suggests Don developed multiple related education analysis documents exploring different aspects of education systems and reform. This framework document (Binder 4) appears to present structured analysis of education organization and functional requirements, while the About Education binder (Binder 5) provides thematic exploration. The parallel creation of multiple education binders in 2024 demonstrates Don's sustained intellectual engagement with education reform in his final year. Reflects lifelong commitment to education field dating from Holland College presidency and academic background.",
  "content_preview": "Doc/About/Binder\n4\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAN\n\nEDUCATION\n\nFRAMEWORK\n\n\n\n\n\n\n\n\n\n\n\n\nDonald\nE. M. Glendenning\n\n\nCharlottetown,\nPEI\n\n\n2024",
  "theme": "04-holland-college"
 },
 {
  "slug": "00-emerginmtg-9-sd-9-3",
  "title": "00 EmerginMtg 9-SD 9.3",
  "summary": "Education 20/20 Inc. meeting agenda (Apr 2013) outlining programming initiatives: Leaders Series, workshops, skill training, newsletters, governance development, and fundraising. Shows Don's leadership in regional education reform advocacy.",
  "content_preview": "SD-9-3\n\nProgramming\n\nApril30,\n2013\n\nEDUCATION\n20/20 INC.\n\nUnder\nconsideration \n\n\n\n\n\n\n\n\t\n\nLeaders\n\tSeries – proposed for fall of 2013;\n\tpanel or separate presentations by President of UPEI, President of\n\tHolland College, Deputy Minister, President of College d’Acadie,\n\tSuperintendent of English School Board, and superintendent of French\n\tSchool Board. \n\t\n\t\n\nRegional\n\tWorkshop - offer at least one workshop\n\tin neighbouring province  \n\t\n\t\n\n\n\tSkill training\n\t\n\nInformation\n\n\n\t\n\nNewsletter\n\t\n\nOccasion",
  "theme": "04-holland-college"
 },
 {
  "slug": "00-guidelines-2014-10-21t13-40-47",
  "title": "00 Guidelines@2014-10-21T13;40;47",
  "summary": "Guidelines document for Education 20/20 occasional papers, establishing the publication's purpose to fill gaps in publicly available education information. The document identifies Glendenning as the founding President of Holland College and explains that occasional papers will address K-12 education topics for general audiences.",
  "content_preview": "Occasional\npapers\t\t\n    \t\t\t\n\n\n\n\n\n\n\n\n\nOccasional\npaper No. 01\t\t\t\t\t\t\t          February 10, 2014\n\n\n\t\n\n\n\t\n\t\nEducation\n\t20/20 believes that:\n\t\n\t\t\n\n\n\t\tEducation is the most important\n\t\tissue of the day, \n\t\t\n\t\t\n\n\n\t\tOur futures as individuals and as\n\t\ta country will be determined to large degree by the nature and\n\t\textent of the education we offer our citizens. \n\t\t\n\t\t\n\n\n\t\tThere is a shortage of information\n\t\tgeared for the public , especially for parents of children now in\n\t\tschool\n\t\n\t\nOccasional\n\tpape",
  "theme": "04-holland-college"
 },
 {
  "slug": "03-assessing-performance",
  "title": "03 Assessing Performance",
  "summary": "Don critiques competency-based education's failure to develop rigorous performance assessment systems. Using his high school shop class experience (40% theory, 40% practical, 20% attitude), he argues attitudes are undervalued—they're actually the most important employment factor. He rejects averaging theory and practical grades, comparing it to averaging someone's comfort by averaging head-in-freezer and feet-in-oven temperatures. Don proposes performance criteria (Quality, Quantity, Problem-Solving, Leadership, Supervision) with contextual levels derived from real-life occupational standards. His conclusion emphasizes that performance assessment remains education's uncharted territory despite its critical importance.",
  "content_preview": "Assessing Performance\n\n\n\n\nMuch has been said about competency or outcome-based education.  It is one of the major educational issues of our day; it also has its critics.  Many of the criticisms, I find, apply to a version of CBE that is quite different from mine.  Such versions usually suggest a rigid, narrow and mechanical approach.  They are limited to a restricted list of outcomes, or they fail to address the whole area of standards and assessment.\n\nCriteria and approaches for determining com",
  "theme": "04-holland-college"
 },
 {
  "slug": "05-canada-college",
  "title": "05 CANADA COLLEGE",
  "summary": "Don proposes a national \"Canada College\"—not a teaching institution but a credit bank aggregating learning from schools, universities, colleges, work, self-study, and life experience into recognized credentials. He notes BC's Open Learning Agency operates a limited version; New Zealand has established a Qualification Authority. Don advocates a system measuring performance rather than time-based credit, drawing on expertise from certification bodies and competency-based education programs. He humorously suggests applying his own experience (building bridges, installing drainage) as portfolio evidence for a civil engineering credential.",
  "content_preview": "CANADA COLLEGE\n\n\n\n\nSchools no longer have a monopoly on the delivery of education and training.  Employers, labor unions, trade and professional associations, consulting agencies, and many others now deliver courses, workshops, and other training sessions to employees, members and the public at large.  Some agencies deliver a series of courses which result in a credential; other organizations simply deliver stand-alone short courses.  Some large US corporations offer their own degree programs.\n\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "07-potential-presenters-1-2014-12-27t17-02-24",
  "title": "07 Potential presenters-1@2014-12-27T17;02;24",
  "summary": "A list of potential presenters for Education 20/20 Inc. presentations, including senior officials from the Department of Education, university administrators, school board superintendents, and Holland College leadership—reflecting Don's extensive professional network.",
  "content_preview": "EDUCATION 20/20 INC\n\nPresentations – 1\n\n  \n Gaylene Smith\n  \nSandy MacDonald, Deputy Minister, Department of Education, Charlottetown\n  \nCynthia Fleet, Superintendent, English Language School Board, Charlottetown\n  \nDr. Ron MacDonald, Dean, Faculty of Education, UPEI\n  \nDr. Brian Macmillan, President of Holland College\n  \nDr.  President, UPEI\n  \nDonald DesRoches, Presidemt of College D’Acadie\n  \n, Superintendent of Education, French school Board\n  \nHead, Curriculum Development\n  \nHead of Assessm",
  "theme": "04-holland-college"
 },
 {
  "slug": "08-workshop",
  "title": "08 Workshop",
  "summary": "The October 28, 2013 eighth issue reports on Education 20/20's October 21 community workshop on the learning process held in Charlottetown. Led by Alice Taylor (Handle with Care Program), Eileen Conway-Martin (Native Council of PEI Communications Director), and Brenda Goodine (Holland College Early Childhood Education Learning Manager), the workshop engaged participants in exploring memorable learning experiences and their life impact. Don emphasizes that effective learning support requires understanding each learner's unique background, previous experiences, hopes, and expectations. The newsletter highlights People for Education research showing that reading for pleasure matters more for cognitive development than parental education, and that children whose parents read aloud at age 5 perform better in mathematics, vocabulary, and spelling by age 16. Don thanks financial supporters including R. Birt and Associates, Metro Credit Union, Indigo Books & Music, and anonymous donors, demonstrating collaborative community support for Education 20/20's mission.",
  "content_preview": "Open\nEducation\t\t\t\t\t\n\n\n\n08\t\t\t\t\t\t\t\t\t\t        October 28, 2013\n\n\n\n\n\n\nThe\ntask of the modern educator is not to cut down jungles, but to\nirrigate deserts - C.S.\nLewis\n\n\n\t\n\n\n\t\n\t\n\n\tWorkshop\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tAlice\n\tTaylor and Eileen Conway-Martin\n\t\n\n\tpresenters\n\tat workshop on October 21, 2013\n\t\n\n\t\n\n\n\t\n\t\n\n\tA\n\tLearning Framework\n\t\n\n\t\n\n\n\t\n\t\n\n\tGiven\n\tthe centrality of the learner to the education process, Education\n\t20/20 held a community workshop on the learning process in\n\tCharlottetown on Monday even",
  "theme": "04-holland-college"
 },
 {
  "slug": "09-finding-the-key-to-competency-rating",
  "title": "09 Finding the key to competency rating",
  "summary": "Article published in CVA Journal on competency-based education, proposing performance-based criteria for rating competency levels rather than traditional theory/practical breakdowns. Don draws on his high school shop course experience and argues for criteria including quality, quantity, problem-solving, leadership, and dependability. Reflects his influential thinking on competency-based education that shaped Holland College's instructional model.",
  "content_preview": "Finding the key to competency rating\n\n\n\n\nA formula based on an employer’s criteria for doing the job works\n\n\n\n\nMuch has been said about competency-based education.  Criteria for determining competencies have been described and models for undertaking competency analysis are in existence.  Little attention has been given, however, to the rating of competency levels.\n\nWhen I took “shop courses” as part of my high school program, I recall being graded on both theory and practical work.  The theory w",
  "theme": "04-holland-college"
 },
 {
  "slug": "1-brief-bio-introduction",
  "title": "1-Brief bio- Introduction",
  "summary": "Official biographical introduction: Don as Founding President of Holland College, educator since age 17, consulting work in Canada/Africa/Pakistan/China/SE Asia. Articulates his educational philosophy and life trajectory. Foundation for his public legacy.",
  "content_preview": "THINKING\n\tOTHERWISE:\n\t\n\n\tA\n\tCONVERSATION ABOUT EDUCATION\n\t\n\n\tWITH DON\n\tGLENDENNING\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tEducation\n\t20/20 Inc.\n\t\n\n\tWWW,education2020.ca\n\t\n\n\tTel:\n\t902-892-2060\n\t\n\n\tpei@ducation2020.ca\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tDONALD\n\tE. M. GLENDENNING, C.M.\n\t\n\n\tPresident\n\tEmeritis\n\t\n\n\tHolland\n\tCollege\n\t\n\n\t\n\n\n\t\n\t\n\n\tDon\n\tGlendenning grew up on the banks of the Miramichi in New Brunswick.\n\tHe began teaching at age 17 in a o",
  "theme": "04-holland-college"
 },
 {
  "slug": "1-cfpei-proposal-journal",
  "title": "1 CFPEI Proposal Journal",
  "summary": "Proposal letter from Don Glendenning to the Community Foundation of Prince Edward Island requesting $1,000 to establish a journalism award for students writing about education issues. Education 20/20 sought to encourage media coverage and public discourse on education by awarding $1,000 annually to journalism students from Holland College and UPEI who published articles on education in Atlantic Canadian newspapers.",
  "content_preview": "Education\n20/20 Inc.\n\n\n101\nKent St., PO Box 624/rue Kent, BP 624\n\n\nCharlottetown,\nPEI C1A 1M0 Canada\n\n\nTel:\n902-892-2060\n\n\nEmail:\npei@education2020.ca\n\n_____________________________________________________________________________________\n\nJune\n8, 2015\n\nProposal\n\n\n\n\n\n\n\nCommunity\nFoundation of Prince Edward Island\n\nSuite\n105, Queen Square Place\n\n119-121\nQueen Street\n\nCharlottetown,\nPE C1A 4B3\n\n\n\n\n\n\nDear\nSir:\n\nJournalism\nAward\n\n\n\n\n\n\nThis application seeks financial\nsupport in the amount of $1,000 t",
  "theme": "04-holland-college"
 },
 {
  "slug": "1-graduations",
  "title": "1 Graduations",
  "summary": "Don challenges the age-based graduation system, asking why students with different entry levels and learning rates must graduate simultaneously. He proposes competency-based graduation allowing students to earn diplomas upon meeting requirements regardless of time required. Drawing from his experience monitoring self-paced Holland College programs, Don notes that students completing programs early showed no performance degradation. He argues that making time the variable rather than competency would motivate students, benefit those learning quickly, and incentivize achievement. While acknowledging this complicates administration, Don asserts the pedagogical and motivational benefits justify the restructuring.",
  "content_preview": "July 9, 2010\n\n\n\n\nEditor\n\nCharlottetown Guardian\n\nCharlottetown, PEI\n\n\n\n\nDear Sir:\n\nGraduations\n\n\n\n\nI enjoyed the recent insert in the Guardian on student graduations. Congratulations to all\n\ngraduates. The insert brought back many memories. I was one of 12 graduates in the first rural\n\nhigh school built in New Brunswick more years ago than I care to recall.\n\n\n\n\nIt seems odd to me that, in 2010, we still do not have a school system that allows students to\n\ngraduate when they meet the requirements",
  "theme": "04-holland-college"
 },
 {
  "slug": "1-running-notes-3-draft",
  "title": "1 Running notes 3 draft",
  "summary": "Expanded follow-up notes from January 30, 2015, detailing the working group's analysis of the labor market mismatch between available worker skills and employer demands. Documents systematic exploration of demand sources (employers, individuals, institutions, community) and supply sources (schools, postsecondary, private providers, MOOCs, tutoring, experience). Describes Glendenning's specific research activities including reviewing essential skills documents, gathering curriculum outlines, transcribing 1978 Holland College mathematics competencies, and meeting with Lori Johnston from Workplace Learning PEI to develop an employer survey.",
  "content_preview": "EDUCATION\n20/20 INC.\n\nJanuary\n30, 2015\n\nMathematics\nGap\n\n\nNOTE: \tThese running notes focus on concerns of\nIsland youth about their preparedness for employment and will evolve\nas our thinking evolves.\n\nBackground\n\nIt is widely\nrecognized that education is a key factor in determining one’s\nquality of life; in the same way, the collective education of our\ncitizens will determine to a significant degree the future of our\ncommunity and country.  One of the most frequently mentioned concerns\nby Island",
  "theme": "04-holland-college"
 },
 {
  "slug": "1-windsor-proposal-2016-05-15t09-04-44",
  "title": "1 Windsor Proposal@2016-05-15T09;04;44",
  "summary": "Major proposal from Education 20/20 Inc. to The Windsor Foundation requesting $15,550 to develop outcome-based achievement levels for education, using mathematics as a pilot. The proposal addresses issues with current grading systems and proposes creating competency-based rating scales and achievement level frameworks that align with international models; Don Glendenning lists himself as Founding President of Holland College in his credentials.",
  "content_preview": "3-4-1\n\nThe Windsor Foundation\n\nInquiry/Exploratory Request\n\nOutcome based achievement levels\n\n\n\n\nInformation Sheet\n\n\n\n\n  \n    \n      \n        \nRequired information\n      \n      \n        \n\n\n      \n      \n        \nComments\n      \n    \n    \n      \n        \nDate of application\n      \n      \n        \nMay 14, 2016\n      \n      \n        \n\n\n      \n    \n    \n      \n        \nOrganization name\n      \n      \n        \nEducation 20/20 Inc.\n      \n    \n    \n      \n        \nCRA charitable registration number\n  ",
  "theme": "04-holland-college"
 },
 {
  "slug": "10-2014-employers-have-choices",
  "title": "10 2014 Employers have choices",
  "summary": "Don notes that high school diplomas no longer guarantee basic competency in communication and math skills, diminishing their value to employers. He proposes establishing an independent assessment service where individuals could be tested to demonstrate skill levels. References existing services at Holland College and Workplace Learning PEI, noting that some western Canadian employers already require Islanders to test before hiring.",
  "content_preview": "November 24, 2014\n\n\n\n\nEditor, \n\nCharlottetown Guardian\n\nCharlottetown, PEI\t\n\n\n\n\nDear Sir:\n\nAnother option\n\n\n\n\nFor many years employers used high school graduation as a measure when hiring new employees.  Now, however, employers tell me that a graduation diploma doesn’t provide the assurance it once did, especially as a measure of basic communication and math skills; perhaps it never actually did.  \n\n\n\n\nIn view of this, it’s time for an independent assessment service or centre where people, young",
  "theme": "04-holland-college"
 },
 {
  "slug": "100-4-rating-dacum",
  "title": "100-4 Rating DACUM",
  "summary": "DACUM rating scale framework defining six performance levels (0-6) for competency assessment. Provides standardized measurement tool for evaluating capability to perform tasks, ranging from inability to perform satisfactorily through to leadership capability with initiative and adaptability. Used for workforce development and competency-based education assessment.\n- **Key People**: Not mentioned\n- **Key Organizations**: Not mentioned\n- **Tags**: OTHER\n- **Eulogy Relevance**: MEDIUM - Contains educational and systems content relevant to his professional interests.",
  "content_preview": "100-4\n\nDACUM rating scale\n\n  \n    \n      \n        \n\n\n        \nCan perform this task with more than acceptable speed and quality, with initiative and adaptability and can lead others in performing this task.\n      \n      \n        \n\n\n        \n\n\n        \n6\n      \n    \n    \n      \n        \n\n\n        \nCan perform this task with more than acceptable speed and quality and with initiative and adaptability to special problem situations.\n      \n      \n        \n\n\n        \n\n\n        \n5\n      \n    \n    \n    ",
  "theme": "04-holland-college"
 },
 {
  "slug": "100-4leadership-role",
  "title": "100 -4Leadership Role",
  "summary": "Draft editor letter emphasizing core beliefs as foundational to organizational decision-making and operation. Notes Don's unsuccessful search for current comprehensive core beliefs document in PEI education system, though references Holland College's foundational statements from early development. Advocates rewriting outdated (1989) philosophy with tight, measurable guiding principles and identification of government-funded services. Proposes function-based organization with autonomous, accountable front-line staff, learner-centered focus, and life-based curriculum reflecting 2030 realities. References Holland College Board motion (August 1969) authorizing training delivery of any legal, funded kind.",
  "content_preview": "Editor\n\n\n\n\n\n\n\nCore Beliefs\n\nEducation, in fact every organization, needs a set of core beliefs to guide decision-making, and the list should be written and widely quoted.  Such a document can take many forms – a philosophy, mission, mandate or guiding principles,  A properly crafted statement becomes a reference document for the organization, improves communication, increases consistency, supports management, is a development tool,  assures the public that the organization is well run – a set of",
  "theme": "04-holland-college"
 },
 {
  "slug": "100-5-overhauli",
  "title": "100 -5 OverhaulI",
  "summary": "Editor letter addressing changing world creating increased pressure for education services beyond traditional diplomas/degrees. Proposes conceptualizing education services as \"education pharmacy or hospital\" model where individuals seek targeted educational support—paralleling Holland College Board motion (August 1969) authorizing diverse training delivery. Notes provincial historical leadership role (with federal role in education-for-work through agreements) now diminished, leaving education institutions unable to respond to broadened service demands in era of job-changing and gig economy.",
  "content_preview": "Editor-100-5\n\nEducation Needs an Overhaul\n\nIt seems that most weeks produce a new set of educational problems if not issues – math tests for teachers in Ontario, curriculum overhaul in Alberta, math levels of nurses in Manitoba, grade inflation, shortage of construction workers in PEI, high cost of university study, impact of poverty on student performance, and the list goes on.  The gap between education services desired and education services provided continues to grow.   \n\nChanging nature of ",
  "theme": "04-holland-college"
 },
 {
  "slug": "14-swamped-by-portfolios",
  "title": "14 Swamped by portfolios",
  "summary": "Don argues for integration of Prior Learning Assessment (PLA) into teaching and learning rather than as an isolated add-on. He criticizes over-emphasis on portfolio courses, advocates for broader assessment techniques, questions age-appropriateness limitations, and champions combining PLA with Competency-Based Education and Outcome-Based Education for educational innovation. Written with characteristic optimism about reforming education systems.",
  "content_preview": "PLA Swamped by portfolios\n\n\n\n\nCould PLA be defined simply as a “process used by learners and teachers to establish the range and level of previous learning”?\n\n\n\n\nThe PLA initiative is alive and well in Canada.  The recent conference in Ottawa was a bounding success.  I was impressed by the number, energy and commitment of delegates to broader and more effective implementation.  But I also left the gathering with some nagging concerns.  My concerns are shared, I know, by some educators with whom ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2-1-key-skills-math",
  "title": "2-1 Key skills-Math",
  "summary": "Research notes on a practical mathematics survey conducted by Holland College in 1978, with revival attempt documented here. Original study invited 10 islanders to identify key success skills; six surveys returned with five completed. Results showed skill identification ranging from 41-128 skills with average of 78.2. Identified challenges included unclear instructions, spelling errors, and confusion from repeated questions with varied wording. Mathematical functions least understood included trigonometric applications and vector calculations. Notes indicate intention to revise instructions and conduct expanded second survey, demonstrating Don's commitment to understanding fundamental educational competencies.",
  "content_preview": "3-5-1\n\nEDUCATION 20/20 INC.\n\nKey Skills Survey-Math\n\n\n\n\n  \nUsing Practical Mathematics, an analysis undertaken by Holland College in 1978, we invited 10 people to check off skills that “islanders believe are key to success; six surveys were returned; five had been marked and one was left blank.\n  \nComments included: a couple were unclear; enjoyed it, it brought back many memories, made me think of my children’s math; used it to consider skills needed by a new hire; there were some mis-spelling; ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2-2-cont-test-sites-2015-06-27t22-05-57",
  "title": "2,2 Cont Test sites @2015-06-27T22;05;57",
  "summary": "Reference document on continuing education assessment options in Prince Edward Island. Details GED and ABE (Adult Basic Education) testing programs, providers including Holland College and Skills PEI, and eligibility requirements. Relevant to Don's educational policy advocacy and professional expertise in postsecondary assessment and credential recognition.",
  "content_preview": "2.2 Cont\n\nContinuing Education\n\nAssessment\n\n\n\n\nGED:\n\n  \n7 hours\n  \nAccepted as high school equivalent\n  \nCollege and University may ask for more\n  \nTesting offered by Holland College, Skills PEI (several locations), workplace learning, \n\n\n\n\n\nABE:\n\n  \nCovers upgrading\n  \nPerson may take an individual course or a series\n  \nSeparate test from GED\n  \nOffered only at Holland College\n  \nTest open to anyone who wants it\n  \nTests separate from GED",
  "theme": "04-holland-college"
 },
 {
  "slug": "2-2-continuing-test-sites-2015-06-29t12-16-17",
  "title": "2,2 Continuing Test sites @2015-06-29T12;16;17",
  "summary": "A reference document outlining continuing education assessment services available on Prince Edward Island, including GED, ABE (Adult Basic Education), and TOWES testing programs. Lists available assessments, providers (Holland College, Skills PEI, workplace learning), and information/training services, serving as an inventory of existing educational infrastructure.",
  "content_preview": "2.2 Continuing\n\nContinuing Education\n\nAssessment - Services available\n\nASSESSMENT:\n\n\n\n\nGED:\n\n  \n7 hours\n  \nAccepted as high school equivalent\n  \nCollege and University may ask for more\n  \nTesting offered by Holland College, Skills PEI (several locations), workplace learning, \n\n\n\n\n\nABE:\n\n  \nProgram GED students enroll in\n  \nCovers upgrading\n  \nPerson may take an individual course or a series\n  \nSeparate test from GED\n  \nOffered only at Holland College\n  \nTest open to anyone who wants it\n  \nTests ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2-b-some-firsts",
  "title": "2-B Some firsts",
  "summary": "Chronological list of significant church milestones including Don's own baptism on July 20, 1930, his sister Grace's wedding (1936), and various organizational formations at St. Paul's (Sunday School, women's societies, youth groups). Documents Don's pivotal role in the church from infancy and records key family events.",
  "content_preview": "Some firsts:\n\n\n\n\n1926, June 14- Kenneth Glendenning, Norman Glendenning and Roy Watling\n\nbaptized\n\n1926 - \t\tJohn Robertson Women’s Missionary Society formed\n\n1926 - \t\tSunday School established\n\n1926 - \t\tMission Band formed\n\n1928 - \t\tSeptember 30 - Session meeting\n\n1930 - \t\tYoung Peoples Society organized\n\n1930, July 18 - Miramichi Presbyterial met at St. Paul’s\n\n1930, July 18 - St. Paul’s Presbyterian Church formally dedicated\n\n1930, July 20 - regular service of worship conducted Dr. George C. S",
  "theme": "04-holland-college"
 },
 {
  "slug": "2-glossary-1-2015-11-07t21-02-45",
  "title": "2 Glossary-1 @2015-11-07T21;02;45",
  "summary": "A comprehensive glossary of educational terminology prepared for a primer document. Covers key concepts including competency-based education (CBE), assessment, learning outcomes, standards, and evaluation frameworks. Includes definitions and distinctions between related educational terms that reflect Don's work in education and training systems.",
  "content_preview": "August 24, 2015\n\nPrimer11\n\nGLOSSARY & DEFINITIONS\n\nAccountability - answerability and account-giving for actions, products and decisions \n\n\n\n\nAssessment - is a process of gathering information about a person’s performance on a task or \n\nset of tasks for the purpose of making a judgement about the level of achievement.\n\n\n\n\nAssessor - is a person designated to assess a person’s performance.\n\n\n\n\nBenchmark - is a level of performance which is widely recognized by practitioners or the public\n\nat larg",
  "theme": "04-holland-college"
 },
 {
  "slug": "2-minutes",
  "title": "2 Minutes",
  "summary": "Meeting minutes from February 3, 2017, with Don Glendenning, Bill Whelan, Tanya Craig, and Alice Taylor. The executive reviewed and approved governance regulations with minor editorial changes to present to the full Board. The group agreed to publicly recognize Regis Duffy for support of Education 20/20's work and the Excellence in Education Award. They designated the executive committee as the finance committee pending further notice. Katherine McQuaid was asked to chair the nominating committee. A contract with Holland College student Crystal to develop the organization's website for $1,000 was approved, with budget provisions for domain registration and hosting.",
  "content_preview": "EDUCATION\n20/20 INC.\n\nExecutive\nMeeting\n\nMonday,\nFebruary 3, 2017 at 12:00 noon\n\nBattery\nRoom, Stratford Town Hall, Stratford, PEI\n\n\n\n\n\n\nMinutes:  Meeting\nNo. 2\n\n\n\n\n\n\n\t\n\nIn\n\tattendance: Alice Taylor, Bill Whelan,\n\tTanya Craig, and Don Glendenning\n\t\n\nCall to\n\torder:  \n\t\n\t\n\nRegulations:\n\t Members reviewed drafts of the following regulations: Membership,\n\tDirectors, Duties of a Board, Officers, Establishing committees,\n\t(Nominating. Awards, Program and Finance).  Minor editorial changes\n\twere sugge",
  "theme": "04-holland-college"
 },
 {
  "slug": "20-1-1-obe-paper",
  "title": "20-1-1 OBE paper",
  "summary": "Scholarly paper on Outcomes Based Education (OBE) providing comprehensive analysis of this educational movement. Document includes: (1) historical context—OBE emerged alongside competency-based education (CBE) in late twentieth century as response to content-centered traditional education; (2) key theorist William Spady's framework with three premises (all students can learn, successful learning promotes more learning, schools control learning conditions) and four power principles (clarity of focus, expanded opportunity/support, high expectations, design down from outcomes); (3) definitions—OBE as student-centered, results-oriented, standards-referenced system; (4) characteristics including clear outcome statements, high expectations, focused help for learners, demonstrated achievement, multiple instructional strategies, adjusted time and assistance, focus on output; (5) strengths including consistency, accountability, accessibility; (6) weaknesses including confusion between outcomes and levels, lack of standard implementation models, difficulty implementing OBE in time-based school structure; (7) examples of exit outcomes from Saranac Lake, Michigan, and Atlantic Canada. Document shows Don's deep engagement with major educational reform movements and his analysis of implementation challenges. Includes extensive appendices with learning outcome verbs organized by Bloom's Taxonomy.\n- **Key People**: Spady, William (OBE theorist)\n- **Key Organizations**: Abilene Christian University, Atlantic provinces educational system, Saranac Lake Central School District\n- **Tags**: EDUCATION, PROFESSIONAL, HOLLAND_COLLEGE, PHILOSOPHY, MANUSCRIPT\n- **Eulogy Relevance**: HIGH - Scholarly contribution to educational discourse showing Don's intellectual engagement with major educational reform movements and his critical analysis of implementation challenges. Demonstrates his expertise in curriculum theory and educational innovation.",
  "content_preview": "My\nnotes\n\nMarch 11. 2013\n\nSome notes on Outcome\nBased Education\n\nBy\n\nDon Glendenning\n\n\n\n\n\n\n\nNOTE:\tPart of my learning style involves putting ideas and\ninformation on paper; these notes reflect my stage of knowledge and\nthinking about Outcomes Based Education.\n\n\n\n\n\n\n\n\nBackground\n\n\nOutcomes\nbased education (OBE), like competency based education (CBE) seemed\nto be a major  focus of educational conferences during the latter\npart of the twentieth century.   In my own mind, the two are soul\nmates with",
  "theme": "04-holland-college"
 },
 {
  "slug": "200-10-conversation",
  "title": "200-10- Conversation",
  "summary": "Newsletter No. 96 (February 20, 2020) advocating for broader community dialogue on education beyond schools. Don argues current discussions focus narrowly on schools, storms, technology, and classroom matters rather than larger agenda: preparing all Islanders (all ages, interests) for current and future challenges. He emphasizes education as service helping people with learning, though many view it as product delivery (credits, diplomas, degrees). Don proposes mechanisms for dialogue: PEI Board of Education (12-person general oversight, like Washington State or Holland College Board), curriculum advisory committees including students/parents/employers/post-secondary/certification bodies, and community education commons. He emphasizes education involves six life roles, and notes current narrow school focus misses broader service mandate.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 96\t   \t\t\t                                    \n\t   \t                 February 20, 2020\n\t\n\n\tWhen\n\tschools and ministries are managed well, learning happens-World Bank\n\n\n\n\t\n\n\n\t\n\t\n\n\tINFORMATION\n\tAND DIALOGUE\n\t\n\n\tWe\n\tneed to increase dialogue  about education,  not just about schools,\n\tstorm days,  technology,  exams and classroom matters. And not just\n\twith parents, students and teachers. There’s a larger agenda, it’s\n\tabout Islanders – people of all ages and interests, it’s ",
  "theme": "04-holland-college"
 },
 {
  "slug": "200-glossary-2",
  "title": "200 Glossary-2",
  "summary": "Glossary of Terms Occasional Paper No.? January 2, 2016 NOTE: The items in this glossary were gathered over the years and from many sources; I’ve shaped them and they’ve shaped me to the point where they’ve become my working definitions. In sharing them with you, I acknowledge and thank all who did the same for me – Don Glendenning. Assessment - is a process of gathering information about a person’s performance on a task or set of tasks for the purpose of initiating improvement. Benchmark - is a level of performance which is widely recognized by practitioners and the Public at large and which serves as the reference against which others are evaluated. Competency Based Education (CBE) - an approach to organizing and delivering training or education which starts with the identification of the applications of knowledge to be demonstrated. Certification - is a formal document which attests to the...",
  "content_preview": "Glossary\nof Terms\n\n\nOccasional Paper No.?                      \t\t\t                       \n                     January 2, 2016\n\n\n\n\n\n\nNOTE:\t\nThe items in\nthis glossary were gathered over the years and from many sources;\nI’ve shaped them \n\n\n\nand they’ve shaped me to\nthe point where they’ve become my working definitions.  In sharing\nthem with \n\n\n\nyou, I acknowledge and\nthank all who did the same for me – Don Glendenning. \n\n\n\n\n\n\n\n\n\nAssessment\n- is a process of gathering information about a person’s\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "2005-2",
  "title": "2005--2",
  "summary": "Examining the skilled trades shortage, Don distinguishes between licensed and unlicensed skilled workers and questions whether licensing requirements are realistic. He observes that education systems may bias toward prestigious occupations while practical trades lack public advocates. He notes that Holland College at its founding addressed this question—whether provincial resources should support all training regardless of local employment. He proposes recognizing skilled workers' organizations for self-certification, long-term public information initiatives, equal achievement recognition for trades, clear responsibility assignment, and dedicated funding.",
  "content_preview": "Draft\n\n\n\n\nEditor\n\nCharlottetown Guardian\n\nCharlottetown, PE\n\n\n\n\nDear Sir:\n\n\n\n\nSo we have a looming if not actual shortage of skilled workers.  Or is it a shortage of licensed skilled workers?  There’s a difference.  Perhaps we need both.\n\n\n\n\nWhat’s the reason?  Is it opportunity to learn the necessary skills?  Is wage or salary levels?  Is it working conditions?  Is it the image of the occupations where the supply is short?  Is it the life style associated with the field?  Is it because so many ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2007-status-report-2",
  "title": "2007 Status Report 2",
  "summary": "Updated planning checklist dated May 31, 2007 for 2nd Annual US Citizens Day Reception, showing significant planning progress. Assigns specific responsibilities to committee members: Don Glendenning to send letters to committee members, Bruce Garrity managing refreshments and entertainment coordination, Anne Nicholson handling promotion and media relations, volunteers including George Mackay for flowers. Budget details show room rental ($150), entertainment costs ($100 per performer for Alan Rankin, Sheila Mackenzie, Jen McQuaid), and food ($50 per tray). Revenue sources include donations from Bergmark ($250) and Banks ($200), with US Consul potentially contributing wine. Documents meeting scheduled for June 14 at Culinary Institute.",
  "content_preview": "May 31, 2007\n\nCOMMUNITY FOUN DATION OF PRINCE EDWARD ISLAND\n\nUS Citizens’ Day (2007)\n\nChecklist\n\nA  Event:\t\n\nName:\t\t2nd Annual US Citizens’ Day Reception\n\nPurpose:\tTo meet and thank US citizens for their contributions to the Island \n\nand to inform them about work of the Community Foundation\n\nInvitees:\tUS summer visitors and US citizens living in PEI and their guests\n\nType:\t\tReception\n\nVenue:\tLower floor, Culinary Institute of Canada, 4 Sydney Street, Charlottetown, PEI\n\nDate:\t\tWednesday, July 4,",
  "theme": "04-holland-college"
 },
 {
  "slug": "2008-talking-points-3",
  "title": "2008 Talking points 3",
  "summary": "This document contains Don Glendenning's talking points for a Glenway Estates Association discussion regarding property access rights for the McInnis family. Don raises technical concerns about the proposed agreement, including questions about jurisdiction, liability, and unresolved details. His systematic approach demonstrates his methodical leadership style and attention to legal and governance details in community matters.",
  "content_preview": "July 5, 2008\n\n\n\n\nInitial Statement\n\non Request for Access to Glenway Drive\n\n\n\n\nOpening\n\nImportant question, one of the most important we will have\n\nI am quite prepared to deal with it but lack adequate information\n\nI also have concerns about the process and the optics but these remarks only deal with technicalities of the access issue.\n\nWhy are we being dragged into a family squabble; McInnis have the resources to resolve the issue within their own resources?\n\nIssues\n\nAccess by Linda\n\nVerbal agr",
  "theme": "04-holland-college"
 },
 {
  "slug": "2009-04-07-minutes",
  "title": "2009-04-07 Minutes",
  "summary": "Meeting minutes from the US Citizens Day Committee attended by Dr. Glendenning, Garth Staples, Anne Nicholson, and Don MacDonald. Records discussion of venue options (Culinary Institute unavailable, Queen Charlotte Armouries proposed), food service considerations, and decisions to explore multiple potential locations including Confederation Landing Park and HMCS Queen Charlotte.",
  "content_preview": "U.S. Citizens Day Committee Meeting\n\nApril 7, 2009\n\n\n\n\nPresent: Dr. Glendenning, Garth Staples, Anne Nicholson, Don MacDonald\n\n\n\n\nDr. Glendenning welcomed all for their attendance.  In light of last year’s event, the large attendance was not anticipated and consideration of having a celebration consisting of a cake and perhaps some munchies (chips, crackers and cheese) versus a meal was discussed and there is general agreement.  \n\n\n\n\nThe Culinary Institute is not available for July 4th this year",
  "theme": "04-holland-college"
 },
 {
  "slug": "2009-06-26-meeting-notes",
  "title": "2009-06-26 Meeting notes",
  "summary": "Final planning meeting notes from the US Citizens Day Committee attended by Garth, Bruce, John, and Don. Documents event setup tasks, attendance expectations (26 RSVPs recorded), welcome procedures, gift distribution, food arrangements with Culinary Institute donation, photographer assignments, and program logistics for the July 4 reception.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nUS Citizens’s Day Committee\n\nJune 26, 2009\n\n\n\n\n\n\n\nPresent: \tGarth, Bruce, John and Don.  Regrets from Brian and Anne; my apologies to Joyce for leaving her name off the list.\n\n\n\n\nNotes:\n\nOnly 26 responses to date\n\nCommittee members are asked to arrive at 3:00 pm arrange facilities\n\nCommittee members to fill in where needed and generally circulate among guests\n\nBruce will distribute “dual” pins to guests with priority to visiting choir members.\n\nDonni",
  "theme": "04-holland-college"
 },
 {
  "slug": "2009-16-annual-events",
  "title": "2009-16 Annual Events",
  "summary": "Dated May 29, 2009, Don reviews CFPEI's annual signature events: July 4th receptions for US citizens, summer lecture series, and fundraising dinners at the Roma Historic Site. He provides detailed historical context and evaluates effectiveness, noting positive feedback and donor conversion from early events. Don credits sponsors and the Culinary Institute for enabling low financial drain on CFPEI. He suggests evaluating all events against mission alignment and proposes four alternatives: continuing US reception with fees, combining summer lecture with fundraising, partnering with the Culinary Institute for donor receptions, or merging US reception and summer events into an \"Abegweit Society\" with membership.",
  "content_preview": "SD-2009-16\n\n\n\n\nDate:\t\tMay 29, 2009\n\n\n\n\nSubject:\tAnnual Events\n\n\n\n\nPrepared by:\t Don Glendenning\n\n\n\n\nHistory;\tCFPEI currently holds the following events each year:\n\n:\n\nJuly 4 Reception for US citizens\n\n\n\n\nThe purpose of the US reception is twofold: to recognize the contributions of US citizens and to promote CFPEI as a cause but also as a mechanism to contribute to causes of interest.  We have now organized four receptions, two at the Havilland Club and two at the Culinary institute of Canada.  A",
  "theme": "04-holland-college"
 },
 {
  "slug": "2009-1c-constitution",
  "title": "2009-1C Constitution",
  "summary": "This draft constitution for Glenway Estates Association Inc. was written by Don Glendenning to establish governance structure for a cottage development purchased in 1970 by the MacCuaig, Glendenning, and Galloway families. Don proposes amendments to clarify membership, director authority, and decision-making processes, advocating for greater consultative governance. The document demonstrates Don's continued civic engagement in community organizations and attention to proper governance principles even in retirement.",
  "content_preview": "Draft 1\n\n\n\n\nGLENWAY ESTATES ASSOCIATION INC.\n\n\n\n\n\n\n\nBACKGROUND     \n\n\n\n\nThe land for the summer cottage development known as Glenway was purchased in 1970 by the MacCuaig, Glendenning and Galloway families with the first lot being sold and cottages erected by 1971.  During the first 25 years, road maintenance was provided by the original owners with contributions from lot owners.  By 2006, waterfront lots were individually owned and, in 2008, the centre section was subdivided into separate and i",
  "theme": "04-holland-college"
 },
 {
  "slug": "2009-usoe",
  "title": "2009 USOE",
  "summary": "Letter to U.S. Office of Education presenting the same educational separation thesis as the McGuinty letter. Don introduces himself as founding President of Holland College and references connections to Professor Robert Norton at Ohio University who promotes Holland College's practices internationally. He proposes establishing qualification authorities independent of schools to separate teaching from assessment functions. Demonstrates his international advocacy for competency-based education models and willingness to engage policy makers across borders.",
  "content_preview": "Date \n\n\n\n\n\t\t\t\t62 Queen Elizabeth Drive\n\nCharlottetown, PE  C1A 3A9\n\n\n\n\n\n\n\n\n\n\nU.S. Office of Education\n\nWashington, D. C\n\nUSA\n\n\n\n\n\n\n\nDear Secretary:\n\n\n\n\nBy way of introduction, let me say that I was the founding President of Holland College in Prince Edward Island, Canada, in 1969 – a community college that pioneered a flexible, competency based approach to organizing and delivering career education.  In  the USA, Professor Robert Norton Ohio University, Columbus Ohio. Is also very familiar with ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2011-holland-college",
  "title": "2011 Holland College",
  "summary": "Don's June 2011 commencement address at Holland College sharing his teaching origin story (Kouchibouguac, 1947) and career in vocational/technical education. Discusses the exciting postwar period in Canadian technical training and his foundational insights into teaching and learning theory. Emphasizes education's importance to individual and community futures.",
  "content_preview": "HOLLAND COLLEGE\t\t\t\t\t\n\nSpeaking notes\n\nJune 18, 6:00 pm\n\n\n\n\n\n\n\nThank you for invitation and for the kind words of welcome\n\nHonoured to be here\n\nDelighted to be here\n\nAlso fortunate to be able to be here\n\n\n\n\n.Commend  Graduates  \n\nSuccessful completion of another component of your formal education\n\nImproves your skills as a teacher\n\nResults in a better community for all of us\n\nMine also was a sandwich education\n\n\n\n\nSpent my life in education\n\nImportant\n\nKey to future of  both  individuals and our ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2013-a-probus-rev-douglas",
  "title": "2013 A Probus -Rev Douglas",
  "summary": "Don's presentation notes about Rev. Harvey Douglas Smith (1912-) to a Charlottetown women's club outline Smith's role establishing MRHS and founding Holland College institutions (Culinary Institute, Atlantic Police Academy, School of Visual Arts). The notes list Smith's clerical appointments (1936 Rothesay, 1937 Bay du Vin, 1940 Nova Scotia, 1946-47 MRHS Principal, 1955 Spokane) and emphasize Smith's educational philosophy. The document reveals Don's admiration for Smith and suggests Don may have given this presentation, positioning him as an institutional historian of both MRHS and Holland College.",
  "content_preview": "Charlottetown Women’s Probus Club\n\nJanuary 16, 2013\n\nRev. Harvey Douglas Smith\n\n1912 - \n\n\n\n\nThank you\n\nDelighted to be here\n\n\n\n\nDilemma as to what one says when speaking to a group of friends\n\n\n\n\nMy first reaction was to talk about education\n\n  \nMost important issue of our time, more important than energy or global warming\n  \nKind of education we provide today will determine, to a large extent, our future both as individuals and as a country\n  \nDefinition\n  \nLife roles\n  \nWhat you can do with wh",
  "theme": "04-holland-college"
 },
 {
  "slug": "2013-notes-in-support-of-application-1",
  "title": "2013-Notes in support of application-1",
  "summary": "Brief February 1, 2016 letter to Corporations Canada requesting amendment of Articles of Incorporation to align with CRA recommendations. Includes check for $200 filing fee. Dated incorrectly (2016 instead of 2013) in filename; simple administrative correspondence showing procedural follow-up.",
  "content_preview": "February\n1, 2016\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCorporations Canada\n\n9th\nfloor, Jean Edmonds Towers south\n\n365 Laurier Avenue\nWest\n\nOttawa\n\nONTARIO K1A OC8\n\n\n\n\n\n\n\n\n\n\n\nDear\nSir:\n\n\n\n\n\n\n\nArticles of Amendment\n\n\nCorporation 822339-4\n\n\n\n\n\n\n\n\n\n\n\n\nEnclosed\nplease find a request to amend our articles of incorporation to align\nwith the recommendations of the Canada Revenue Agency; I also enclose\na cheque in the amount of $200.\n\n\n\n\n\n\nIf\nyou need any further information, please do not hesitate to let me\nknow\n\n\n\n\n\n\nSin",
  "theme": "04-holland-college"
 },
 {
  "slug": "2014-00-masthead-2014-10-06t16-41-04",
  "title": "2014 00 Masthead@2014-10-06T16;41;04",
  "summary": "Media release announcing Education 20/20's presentation to the English Language School Board advocating for formalized credit-by-examination (challenge exam) policies. Notes that PEI is the only province without such alternatives and cites PLAR (Prior Learning Assessment Recognition) programs at Holland College, UPEI, and College Acadie as models for recognizing learning outside traditional classrooms.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\nDate\n\n\n\n\n\n\n\n\nChallenge for Credit\n\n\n\n\n\n\n\n\nLearning\ntakes place everywhere but credit for what has been learned is\nlimited to what is studied in schools.    Education 20/20 believes\nlearning outside schools is also worthy of credit and urges schools\nto be more flexible in how credits are granted.  \n\n\n\n\n\n\n\n\n\nThat\nwas the nub of a presentation by Education 20/20 to the English\nLanguage Scho",
  "theme": "04-holland-college"
 },
 {
  "slug": "2014-10-challenge-for-credit",
  "title": "2014-10 Challenge for Credit",
  "summary": "Media release advocating for flexible credit granting in schools through a challenge process. Education 20/20 presented to the English Language School Board, requesting formal evaluation procedures allowing students to earn high school credit by challenging courses, regardless of prior enrollment. The release notes that eight external agencies already provide school credits (including Dance Umbrella, Royal Canadian Naval Reserve), and that postsecondary institutions like Holland College and UPEI employ Prior Learning Assessment Recognition (PLAR). Don advocates extending PLAR to high school level, supporting student agency and recognizing diverse learning pathways.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nPublished in Guardian October 28\n\n\n\n\n\n\n\n\nFor immediate release\n\n\nDate: October 6, 2014\n\n\n\n\n\n\n\n\nChallenge for Credit\n\n\n\n\n\n\n\n\nLearning\ntakes place everywhere, but credit for what has been learned is\nlimited to what students study in schools.    Education 20/20\nbelieves learning outside schools is also worthy of credit and urges\nschools to be more flexible in how credits are granted.  \n\n\n\n\n\n\n\n\n\nThat\nwas the thrust",
  "theme": "04-holland-college"
 },
 {
  "slug": "2014-year-end-2015-10-29t19-03-54",
  "title": "2014- year end@2015-10-29T19;03;54",
  "summary": "Detailed 2014 report showing Don's executive leadership role in Education 20/20, including chairmanship of framework learning workshop, coordination of \"Preparedness\" workshops, award program administration, and publication of occasional papers on educational issues. Document illustrates Don's continued advocacy for educational reform and community engagement beyond his Holland College retirement.",
  "content_preview": "Activity\nReport\n\nDecember\n31, 2014\n\n\n\n\t_____________________________________________________________________________________\n\n\n\n\n\tExisting Objectives\n\t\n\t\t\n\nTo promote\n\t\teducation and educational opportunity for every Canadian\n\t\t\n\nTo exercise\n\t\tleadership in the improvement in all facets of education\n\t\t\n\n3 To foster\n\t\tcooperation between and among all stakeholders\n\t\t\n\n4 Undertake\n\t\tand support research and innovation\n\t\t\n\n5 improve\n\t\tpublic understanding of the education system\n\t\n\t\n \n\t\n\t\nActivitie",
  "theme": "04-holland-college"
 },
 {
  "slug": "2015-committee-2014-10-28t13-09-57",
  "title": "2015 committee@2014-10-28T13;09;57",
  "summary": "Awards Committee membership list for Education 20/20, identifying Don Glendenning as a committee member listed as \"College President, Retired\" (892-5859). Other members include Donald DesRoches (College Acadie I.P.E. President), David McCabe (School Superintendent, Retired), and Peter Russell (Wealth Advisor, Nesbitt Burns). Indicates Don's continued involvement in educational leadership and community service after retirement from Holland College.",
  "content_preview": "Prowkshp\n\nEDUCATION 20/20 INC.\n\n\n\n\nAwards Committee Membership\n\n\n\n\nDonald DesRoches\t436-4881\tCollege Acadie I.P.E. President\n\n\n\n\nDon Glendenning\t892-5859\tCollege President, Retired\n\n\n\n\nDavid McCabe\t\t569-5349\tSchool Superintendent, Retired\n\n\n\n\nPeter Russell\t\t629-2034 \tWealth Advisor, Nesbitt Burns",
  "theme": "04-holland-college"
 },
 {
  "slug": "2015-mf-question-11-8",
  "title": "2015 MF Question 11 8",
  "summary": "\"Question 11-a\" response documenting Education 20/20's purposes and objectives. Describes workshops (December 4, 2012 on Community Engagement with Alice Taylor; October 21, 2013 \"Framework for Learning\" chaired by Don as President Emeritus of Holland College; October 22, 2014 \"From a Learner's Perspective\" with youth panel). Notes January 21, 2014 (typed as 2017 in one instance) \"Dialogues with Educators\" at Haviland Club with Dr. Tammy Hubley-Little. Discusses webinars featuring Donald Glendenning as presenter with colleagues from Holland College. Covers employer engagement addressing \"preparedness gap\" (survey of 200+ young people by Community Foundation in 2013), other education provider collaboration, assessment/certification alternatives, newsletter \"Open Education,\" website, conversations/dialogues, formal presentations to school boards and Standing Committee on Education and Innovation (September 30, 2014), community engagement initiatives including Excellence in Education Award, and supplemental educational services (study centres, emerging fields like coding/robotics, imagine experiences, research support). Demonstrates comprehensive, holistic approach to educational improvement.",
  "content_preview": "-8e\n\nQUESTION 11A -PURPOSES AND ACTIVITIES \n\nFor application to CRA for charitable status\n\n\n\n\nAPPROVED PURPOSES\n\nThe purposes of Education 20/20 Inc. as included in our incorporation documents are as follows:\n\n1 To promote education and educational opportunity for every Canadian\n\n2 To exercise leadership in the improvement in all facets of education\n\n3 To foster cooperation between and among all stakeholders\n\n4 Undertake and support research and innovation\n\n5 improve public understanding of the ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2015-oct-transmission-sheet-to-whelan",
  "title": "2015 Oct transmission sheet to Whelan",
  "summary": "Transmittal memo to Bill Whelan summarizing documentation sent to Revenue Canada regarding Education 20/20 Inc.'s charitable status application, including communications with legal counsel and CRA officials. Shows Don managing organizational compliance and regulatory matters in his post-Holland College roles.",
  "content_preview": "Education 20/20 Inc.\n\nDocuments  to Bill Whelan\n\nOctober 21, 2015\n\n\n\n\n  \nCommunication with Richard Bridge, a Nova Scotia lawyer who specializes in charitable organizations\n  \nEducation 20/20 Inc. goals; originals goals taken from incorporation documents and proposed goals included in actual submission in March, 2015 \n  \nCopy of submission sent to CRA in March 2015\n  \nQuestions raised by and discussed with Mezaun Baksh, CRA, in early October, 2015; \n  \nLetter received about October 16 confirming",
  "theme": "04-holland-college"
 },
 {
  "slug": "2015-pres-report",
  "title": "2015 Pres. Report",
  "summary": "President's Report for Education 20/20 Inc. for year ending December 31, 2015, submitted by Don Glendenning. The organization published monthly \"Open Education\" newsletter in both official languages and established social media presence through blog, Facebook, and Twitter with Tom White-Hassler's leadership. Public presentations included Gerry Seaward on Adult Basic Education at Holland College and Dave Cormier on teaching in complex worlds. Occasional papers were published on Eight Year Study, Call for Action, and Learning Path. The organization awarded $2,500 to Prince Street Elementary School for values education. Don and Bill Whelan met with Education Minister Hal Perry and Deputy Minister to discuss education issues. Don notes that his age limited his ability to recruit young directors, suggesting others be involved in recruitment process.",
  "content_preview": "Gov/annual\n\nEDUCATION 20/20 INC.\n\nPresident’s Report\n\nFor the Year ending December 31, 2016\n\n\n\n\nI am pleased to present the following report of Education 20/20 Inc. for the year ending December 31, 2015.\n\n  \nNewsletter: Open Education, one-page electronic newsletter published monthly in both official languages  \n  \nSocial media: blog, Facebook and twitter account thanks to Tom White-Hassler with assistance of Maureen Kerr\n  \nWorkshops:\n\n\n  \nPublic presentation on September 30, 2015 by Gerry Seaw",
  "theme": "04-holland-college"
 },
 {
  "slug": "2015-question-11-6",
  "title": "2015 Question 11 6",
  "summary": "CRA registration application highlighting Education 20/20's educational programs and community linkages. Records Don Glendenning as President Emeritus of Holland College chairing \"A Framework for Learning\" workshop and presenting learning framework webinars. Demonstrates his continued educational leadership post-Holland College through initiatives addressing education-community partnerships and learner preparedness.",
  "content_preview": "QUESTION\n11A -PURPOSES AND ACTIVITIES -6\n\nFor\napplication to CRA for charitable status\n\n\n\n\n\n\nAPPROVED PURPOSES\n\nThe purposes of\nEducation 20/20 Inc. as found in our documents of incorporation are\nas follows:\n\n\n1 To promote education and educational opportunity for every Canadian\n\n2\nTo exercise leadership in the improvement in all facets of education\n\n3\nTo foster cooperation between and among all stakeholders\n\n4\nUndertake and support research and innovation\n\n5\nimprove public understanding of the ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2015-seaward-media",
  "title": "2015-Seaward Media",
  "summary": "February 2015 press release announcing Education 20/20's September 30 session on Holland College's basic education programs. Gerry Seaward, Program Manager of Adult and Community Education, will discuss programs offering high school credit upgrading at multiple Island locations. Program addresses readiness gaps revealed in the 2013 Community Foundation survey, caused by dropouts, failed courses, lack of institutional information, and changing requirements. Holland College programs funded by the Department of Workforce Development and Higher Learning, offered full and part-time. Session at Stratford Town Hall (4:30 pm) targets public awareness of bridging education opportunities.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor\nimmediate release\n\n\n\t2015-2\n\n\n\n\n\n\n\n\nA\nbridge to new careers\n\n\nPeople\nwho lack high school graduation credits or want to upgrade existing\nschool marks may do so through basic\neducation courses offered in a number of centres across Prince Edward\nIsland; the\npublic can learn more about one such opportunity at a session being\norganized by Education 20/20 at the Stratford Town Hall on\nSeptember30.\n\n\nGaps\nin read",
  "theme": "04-holland-college"
 },
 {
  "slug": "2016-10-adams",
  "title": "2016-10 Adams",
  "summary": "Don's tribute to Bob Adams, a Nova Scotia colleague who introduced Holland College to DACUM (Developing A Curriculum) methodology during its foundational year. Don recounts Holland College's initial traditional delivery model and deliberate search for better alternatives through institution visits and innovation research. He credits DACUM's simplicity, analytical rigor, single-page competency presentation, and rating system as transformative to the college's mission, and notes its international adoption, though sometimes diverging from Adams' original vision.",
  "content_preview": "Dear Editor:\n\n\n\n\nA friend of Holland College\n\n\n\n\nYesterday I learned that a former colleague had died; he was living in Dartmouth, Nova Scotia.  Few readers would have met him but many readers would have felt his impact.  You see, Bob Adams introduced Holland College to DACUM charts.  Employers may remember the three- day brainstorming sessions; students will likely remember the large sheet identifying the competencies of their chosen career.  \n\n\n\n\nAlthough Holland College operated on a traditio",
  "theme": "04-holland-college"
 },
 {
  "slug": "2016-background-3",
  "title": "2016 Background-3",
  "summary": "Policy analysis document addressing the erosion of high school diplomas as educational/employment screening devices. Documents that employers (Greater Charlottetown Chamber of Commerce, Summerside Chamber of Commerce) and institutions publicly express concerns about graduates' basic skills levels. Reviews admission requirements across Holland College (Grade 12 with general-level credits), UPEI (Grade 12 exam completion with 70%+ average), and employers (varying from diploma requirements to skills descriptions). Explores underlying issue: high school graduation no longer reliably signals adequate basic education. Proposes Education 20/20 research questions: school roles, employer perspectives on gaps, prior documentation, individual cases, student options, and alternative assessment strategies. Document articulates the central policy problem Don sought to address through his research and advocacy work.",
  "content_preview": "Prog/Prep\n\nProficiency\nlevels\n\n\n\n\n\n\n\nHaving\na high school graduation diploma has been a filter to assure the\npublic at large, employers and postsecondary institutions that the\nholder had a level of basic education needed to function in their\nnext life role; users of this filter are reporting that this is no\nlonger the case.  \n\n\n\n\n\n\n\nAs\npart of a survey Island youth in late 2013 by The Community\nFoundation of Prince Edward Island (CFPEI),  young\npeople identified   “preparedness\ngaps with regard ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2016-small-projects",
  "title": "2016=Small Projects",
  "summary": "Planning document describing small community-level projects ($2,000-5,000 range) for PEI, including book clubs for kids, education navigator programs, Handle With Care parent training (with kids' literacy components), and after-school STEM programs. References successful programs like Pathways to Education and Holland College STEP, reflecting Don's commitment to community-based educational innovation aligned with organizational advocacy.",
  "content_preview": "Planning\n\n Small Projects\n\n\n\n\nAfter our annual meeting concluded last Wednesday, we spoke about potential funding for small projects, the example was a possible project in Eastern PEI, perhaps the Souris Area, in the range of $2-5.000. Here is a summary of responses to date: \n\n\n\n\n  \nBook Club for Kids\n\n\nA reading club for kids and their parents; New York Times of July 24, 2016\n\nhttp://www.nytimes.com/2016/07/24/opinion/sunday/the-right-way-to-bribe-your-kids-to-read.html?emc=edit_th_20160724&nl=",
  "theme": "04-holland-college"
 },
 {
  "slug": "2017-7a",
  "title": "2017-7A",
  "summary": "This July 2017 report documents late-spring activities including Newspaper Links distribution (1-2 per month with feedback received), scheduled Transition discussion for July 18, Executive meeting planning, Souris discussion paper development by Alice and Don, website approaching operational status, Education Award presentation to Amber Jadis for STEAM work scheduled for July 19 at 4:45 pm in Room 214 at Holland College (Directors welcome), and coordination with Tom on polls and surveys.",
  "content_preview": "Activity Update-\n2017-7A\n\n\nJuly 12, 2017\n\n\nActivities:\n\t\n\n\n\n\n\n\t\n\t\n\t\t\n\nNewspaper\n\t\tLinks – try to send i-2 per month; receiving some feedback\n\t\t\n\nTransition\n\t\t–\n\t\tAnother discussion booked for July 18 \n\t\t\n\t\t\n\nExecutive\n\t\tmeeting being planned \n\t\t\n\t\t\n\nSouris\n\t\t– Next meeting planned for July 25, Alice and I are working on a\n\t\tdiscussion paper.\n\t\t\n\nWebsite\n\t\t– Looking forward to having new website operational soon \n\t\t\n\t\t\n\nEducation\n\t\tAward\n\t\twill be presented to Amber Jadis, STEAM, on Wednesday, \n\t",
  "theme": "04-holland-college"
 },
 {
  "slug": "2017-glendenning-poster",
  "title": "2017-Glendenning poster",
  "summary": "Event poster advertising Dr. Don Glendenning, identified as Founding President of Holland College and retired educator, presenting \"The Pulse of Island Youth\" on May 1, 2014, at Access Centre in Souris, PEI. Includes roundtable discussion with Education 20/20 organization details.",
  "content_preview": "Share your views!! \n\n\n\n\n\n\n\n\n\nAbout Education\n\n\nwith \n\n\n\nDr. Don Glendenning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDr. Don Glendenning:\nFounding President of Holland College\n\n\n retired educator,\nPresentation:\t“The Pulse of Island Youth”:\n\n\n \t\n\n\n\n\n\n\n\n\n              Round table\ndiscussion to follow\n\n\n\n\n\n\n\n\nDate:\t\tThursday,\nMay 1, 2014\n\n\n                 \n\n\n\nTime:\t\t12-1:00 pm \n\n\n\n\n\n\n\n\n\nLocation: \tAccess Centre\n\n\nSouris, PEI\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor further information:\n\n\n\n\n\n\n\nEducation\n20/20 Inc.\n\n101\nKent St., PO Box 624 / 101, ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2017-mcinnis",
  "title": "2017 McInnis",
  "summary": "Don provides a reference letter supporting Kenneth F. McInnis's nomination as a distinguished alumnus of Holland College. He notes McInnis's progression from student in architectural technology to instructor, emphasizing the College's formative role in McInnis's career. The letter reflects Don's ongoing connection to the institution he founded.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown, PE \n\n C1A 3A9\n\n\n\n\n\n\n\nMay 4, 2017\n\n\n\n\n\n\n\nTo Whom It May Concern:\n\n\n\n\n\n\n\nKenneth F. McInnis\n\n\n\n\nI’ve been asked to provide a letter of reference in support of Kenneth McInnis who is being nominated as a distinguished alumnus of Holland College.\n\n\n\n\nI have known Ken for many years, first as a student in architectural technology and later as an instructor.  I have followed his career with interest and am certainly aware of his community involvement including ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2018-1-history-first-in-its-class",
  "title": "2018-1 History First in its class",
  "summary": "The first version of \"Miramichi Rural High School: First in its Class,\" edited by Don in 2019. This collection compiles memorabilia documenting the school's history and includes sections on Rev. Douglas Smith, A. T. Patstone's account of the first rural school, trustees, staff, students, and photographs. Don notes this is from his personal collection as a former student before donating to the New Brunswick Archives, serving as a historical record and tribute to the school's founders.",
  "content_preview": "First in\nits Class:\n\n Miramichi\nRural High School:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEDITOR\n\nDonald E.\nM Glendenning\n\nCharlottetown,\nPEI\n\n2019\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe\nMiramichi Rural High School deserves its own book, \n\n\nbut\nthis is not it; \n\n\ninstead,\nyou are reading items from memorabilia  \n\n\ncollected\nby Don Glendenning, a former student. \n\n\nBefore\nhis file goes to the New Brunswick Archives, \n\n\nhe\npulled together this booklet as a way of sharing the school’s\nstory.\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "2018-4-proposal-2018-2",
  "title": "2018-4  Proposal 2018-2",
  "summary": "Detailed proposal documenting the transition process as applied to mathematics in PEI. Cites CMEC statement on transition as critical measure of education system success. Analyzes the fragmentation of math instruction across public schools, UPEI, Holland College, SkillsPEI, Collège de l'Île, and private schools. Identifies key problems: inconsistent curriculum frameworks, conflict between instruction and grading functions, lack of agreed-upon definitions, absence of overarching educational philosophy, no coordination mechanism, inconsistent assessment criteria, varying content descriptions. Recommends standard definitions for skills and competencies, common math outcomes list as basis for instruction, and establishment of independent assessment body. The proposal demonstrates Don's systematic diagnostic approach to institutional problems.",
  "content_preview": "Mathematics\nInstruction\n\nin\n\nIn\nPrince Edward Island\n\n\nTrans/2018-2\n\n“A\nstudent’s ability to transition from secondary school to\npost-secondary education and the labour market is a key measure of\nthe education system’s success for students” – CMEC, July 2016\n\n\n\n\n\n\nThe above statement\nby the Council of Ministers of Education Canada (CMEC) highlights an\ninterest and concern that is shared by many educators, employers,\ncertification agencies and the community at large.   The issue, as it\napplies to",
  "theme": "04-holland-college"
 },
 {
  "slug": "2018-ideas-2",
  "title": "2018-IDEAS-2",
  "summary": "An analysis of educational services and opportunities in Souris, a declining port community (population 1,053, declining 10% since 2011) in Eastern PEI with lower median household income ($42,368 vs. $61,163 provincial average) and higher proportion of seniors (28.6% vs. 19.4%). Documents existing educational infrastructure (early childhood, K-12 schools, Holland College courses, continuing education) and identifies gaps. Project ideas proposed include technology demonstrations, hands-on skills training modules (sketching, tools, woodworking, metalworking, IT, robotics, customer service), and a demonstration project for small-community education delivery.",
  "content_preview": "SOURIS EDUCATION\n\nResults\nof brain storming sessions\n\n\n2018-2\n\n\nSouris is a year-round port in Eastern PEI with a population of 1,053\n(Statistics Canada, 2016 Census), a decline of 10% from the 2011\nCensus. Compared to PEI as a whole, Souris has a smaller proportion\nof residents under age 15 (13.8% vs. 15.9%) and age 15 to 64 (57.6%\nvs. 64.7%) and a higher proportion of residents age 65 and older\n(28.6% vs. 19.4%). Souris also had a much lower median total\nhousehold income ($42,368) compared to ",
  "theme": "04-holland-college"
 },
 {
  "slug": "2019-party-leaders-invite",
  "title": "2019-Party Leaders- invite",
  "summary": "Formal invitation to party leaders for education discussion, establishing Don as accomplished education leader with Holland College presidency, teacher/principal experience, and international OECD work background.",
  "content_preview": "Gentlemen:\n\nAn invitation\n\n\n\n\nWe are pleased to invite you, as leader of your Party, along with leaders of other official Parties, to a conversation on the matter of public education on Prince Edward Island.  We extend this invitation because of the importance of the subject and the key role played by the Provincial Government in bringing about change.  \n\n\n\n\nThe conversation, we suggest, should focus on a framework for organizing and managing educational services in the 21st century.  While open",
  "theme": "04-holland-college"
 },
 {
  "slug": "21-1-benchmarks",
  "title": "21-1 Benchmarks",
  "summary": "Working notes on educational benchmarks and purpose statements. Don surveys Atlantic provincial education benchmarks: New Brunswick (full potential development), Nova Scotia (healthy society and economy), Newfoundland (leadership), PEI (student success opportunities), Ontario (multiple purposes). Discusses education context importance, particularly in career/technical courses, noting Holland College was founded by Premier Campbell as \"alternative to university,\" profoundly influencing staffing, programs, and standards. Advocates clarity of purpose and consistent decision-making derived from that purpose. Includes definitions distinguishing standards from benchmarks and notes relationship to performance measurement and organizational change.",
  "content_preview": ":\n\nBENCHMARKS\n\n\n\n\nGenerally, education authorities  have a foundational statement about what they  are trying to \n\naccomplish through their education system.  I view such a statement as a benchmark in that Such a statement is important because, everything we do in education  flows from the purpose - I raise the issue because I believe that educational services, organization and standards flow from a statement of purpose\n\nA  quick review of our Atlantic neighbours ewveals:\n\nNew Brunswick is focus",
  "theme": "04-holland-college"
 },
 {
  "slug": "21-4-annual-workshop",
  "title": "21-4  Annual Workshop",
  "summary": "Concept outline for proposed annual \"Education Thinkers Conference\" to convene educators discussing consequential educational issues. Don envisions three-day gatherings including public presentations, elected chair, discussion papers, and reports. Proposes Holland College as host and September/October timing with endowment at Community Foundation of PEI. Emphasizes futuristic, thought-provoking, provocative themes. Sketches administrative structure with design committee and annual organizing committee. Document remains conceptual with limited operational detail.",
  "content_preview": "EDUCATOPN THINKERS CONFERENCE\n\n21-4\n\n\n\n\n PURPOSE: \tto convene (annual?) conference of educators to review/consider/discuss a \t\t\t\tconsequential issue in education\n\n\n\n\nCONCEPT:\t\n\nInvite panel/participants:\n\n  \nthree days of discussion\n  \ninclude free public presentation\n  \nElect chair\n  \nPrepare apaper for discussion or a report distribute summary\n  \nHolland College to organize and host\n  \nSeptember or October each year\n  \nEstablish endowment  at CFPEI\n  \nFuturistic\n  \nThought-provoking/Provocativ",
  "theme": "04-holland-college"
 },
 {
  "slug": "3-6-budget-2015-08-12t19-29-14",
  "title": "3-6 budget@2015-08-12T19;29;14",
  "summary": "Lists the project management team for the Preparedness initiative, identifying Don Glendenning as Project Manager and Founding President of Holland College, along with Steve McQuaid (Community Foundation President), Regis Duffy (Diagnostic Chemicals founder), Joan MacDonald (HR Director), and Dr. Tess Miller (UPEI Mathematics Professor).",
  "content_preview": "Preparedness-2\n\n\n\n\nProject Management Team:\n\n  \nDon Glendenning, Project Manager, Founding President of Holland College\n  \nSteve McQuaid, President, Community Foundation of Prince Edward Island\n  \nRegis Duffy; Founding President of Diagnostic Chemicals\n  \nJoan MacDonald, HR Director,\n  \nDr. Tess Miller, Professor of Mathematics and, UPEI\n  \nOthers with relevant experience may be added as needed.",
  "theme": "04-holland-college"
 },
 {
  "slug": "3-some-institutions",
  "title": "3 Some Institutions",
  "summary": "A comparative analysis of challenge for credit policies across Canadian educational institutions including Holland College, UPEI, Colonel Grey High School, and provincial systems in Manitoba, British Columbia, and New Brunswick. The document excerpts policy language and institutional guidelines showing how various schools recognized prior learning and allowed students to bypass courses through demonstrated competency. Holland College's involvement indicates Don's direct knowledge of implementation at this institution where he served as founding president.",
  "content_preview": "Prog/challenge-3\n\nQuotations\n\n\n\n\nChallenge:  A formal process in which a student co\n\n\n\n\nHolland College, Institute for Adult and Community Education\n\nCourses offered via challenge for Credit\n\n\n\n\nCourses offered via Challenge for Credit\n\nAcademic Grade 12 courses can be challenged in this\n\nmanner. The courses listed here are available courses for\n\nChallenge for Credit at this time. This combination of\n\ncourses provides sufficient credentialing for recognition in\n\nmost post secondary institutions.",
  "theme": "04-holland-college"
 },
 {
  "slug": "38-2016-03-25-no-38-operating-schools",
  "title": "38 2016-03-25 - no. 38 - Operating Schools",
  "summary": "States position that provincial governments should exit school operations while retaining quality assurance and fairness monitoring roles. Argues government involvement in administration compromises oversight capability. Identifies systemic needs: updated mission/mandate statements aligned with contemporary education, functional organizational analysis resolving form-function misalignment, and explicit role descriptions for educators and administrators. Highlights precedent from Sydney Catholic Schools (Australia) where principal positions may become private-sector roles. Advocates for similar structural innovation in PEI. Reports 2016 Excellence in Education Award nominations. Discusses competency-based education adoption in health professions. Announces upcoming presentations on adult competency assessment (PIAAC) program and directs readers to Ron Srigley's education article in The Walrus.",
  "content_preview": "Open\n\tEducation\t\t\t\t\t\n\n\t\n\n\t38\t\t\t\t\t\t\t\t\t\t          March 25, 2016\n\n\n\n\n\t\n\n\n\t\n\t\n“They\n\tare sick of pretend solutions that address the politics of our\n\tproblems rather than \n\t\n\t\nthe\n\tproblems themselves.” – McKinnon and Galston\n\n\n\n\t\n\n\n\t\n\t\nA\n\tbold move in Australia\n\t\n\n\t\n\n\n\t\n\t\n\n\tI\n\tam on the record as saying that Provincial Governments should get\n\tout of the business of operating schools. They have not shown, at\n\tleast to my satisfaction that they are up to the task, but not only\n\tthat, their involvemen",
  "theme": "04-holland-college"
 },
 {
  "slug": "39-2016-04-23-no-39-curriculum",
  "title": "39 2016-04-23 - no. 39 - Curriculum",
  "summary": "Compares three curriculum development models: Outcomes-Based Education (OBE), Curriculum Outcomes (subject conversion), and Competency-Based Education (life skills identification). Identifies critical gaps in Canadian schools' adopted middle approach: missing provincial overarching goal connections, absent life-relevance linkages, and disconnected student engagement. Questions Western and Northern Canadian Protocol curriculum dependency, advocating consideration of alternative frameworks or provincial development reflecting PEI's specific needs. Clearly distinguishes effectiveness (achieving intended outcomes) from efficiency (reducing resource costs), illustrating with Ontario reading specialists and PEI administrative restructuring as efficiency without guaranteed effectiveness gains. Announces PIAAC results presentation regarding adult competency assessment. Publishes photo of Don Glendenning and Tom White-Hassler continuing curriculum discussion, indicating collaborative policy development approach.",
  "content_preview": "Open\n\tEducation\t\t\t\t\t\n\n\t\n\n\t39\t\t\t\t\t\t\t\t\t\t          April 23, 2016\n\n\n\n\n\t\n\n\n\t\n\t\n\n\t“If\n\tyou want to change student learning then change the methods of\n\tassessment” – Chuckett and Sutherland\n\t\n\n\t\n\n\n\n\n\t\n\n\n\n\t\n\n\n\t\n\t\nCurriculum\n\talignment \n\t\n\t\n\n\n\n\t\n\t\n\n\tCurriculum\n\tis at the heart of school operations; from time to time it needs\n\treview and probably realignment.  That’s not unusual but it should\n\tnot be left untended.  \n\t\n\t\n\n\t\n\n\n\t\n\t\nThere\n\tare a number of approaches to developing outcome-based curriculum:\n\t",
  "theme": "04-holland-college"
 },
 {
  "slug": "5-don-2019-brochure-2",
  "title": "5 Don 2019 brochure 2",
  "summary": "A companion brochure from Education 20/20 Inc. (2019) presenting Don as President Emeritus of Holland College under the theme \"Thinking Otherwise: A Conversation About Education.\" Emphasizes his education philosophy: helping people learn new attitudes, skills, and knowledge to thrive; advocating for learner-centered, flexible, and transparent systems. Details his career trajectory from one-room schoolhouse teaching at age 17 to founding president of Holland College. Lists educational credentials: Miramichi Rural High School, Teachers College Fredericton, New Brunswick Institute of Technology, University of London, Bradley University, and Indiana University degrees. Notes post-retirement consulting in Canada, Africa, Pakistan, China, and Southeast Asia. Written for external distribution, not original composition by Don.",
  "content_preview": "THINKING\n\tOTHERWISE:\n\t\n\n\tA\n\tCONVERSATION ABOUT EDUCATION\n\t\n\n\tWITH DON\n\tGLENDENNING\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tEducation\n\t20/20 Inc.\n\t\n\n\twww,education2020.ca\n\t\n\n\tTel:\n\t902-892-2060\n\t\n\n\tpei@education2020.ca\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tDONALD\n\tE. M. GLENDENNING, C.M.\n\t\n\n\tPresident\n\tEmeritis\n\t\n\n\tHolland\n\tCollege\n\t\n\n\t\n\n\n\t\n\t\n\n\tDon\n\t Glendenning grew up on the banks of the Miramichi in New Brunswick.\n\tHe began teaching at age 17 in a one-room school and ended up as the",
  "theme": "04-holland-college"
 },
 {
  "slug": "5-governance-consolidated-2",
  "title": "5 Governance- consolidated 2",
  "summary": "Extensive May 18, 2013 treatment of school governance reflecting Don's long-standing interest dating to his influential role shaping Holland College's unicameral governance model in 1969. Don defines governance as \"who makes what decisions, and in what manner.\" He identifies underlying confusions between education/schooling and credentials/qualifications. The paper extensively documents that research shows direct relationship between school autonomy and student performance (citing OECD PISA data). Don emphasizes teachers should serve as \"educational family doctors\" with accountability for learner outcomes. He proposes clear decision-making assignments: learners/parents select schools and programs, teachers make professional decisions for assigned learners, principals focus on instructional leadership, trustees/superintendents operate schools, Deputy Ministers ensure quality education for all Islanders. Includes detailed Albertan school board decision examples and PEI trustee responsibilities. Advocates for immediate changes: consolidate educational responsibilities, delegate administrative decisions, clarify principal roles, assign student decisions to teachers, establish independent qualification authority. Later \"Thoughts on School Governance\" section dated May 25, 2012 emphasizes governance model could remove change barriers when combined with professional freedom and accountability. Don notes government role should be leadership, planning, standards-setting, certification, funding, monitoring—not school operation.",
  "content_preview": "Book\n\n\nMay 18, 2013 \n\n\n\nSchool Governance \n\n\n\n\n\n\n\nMy introduction to\ngovernance included the following assignment many years ago by\nProfessor Gibson at Indiana University: \"Propose a university\ngoverning structure based on the writings of Emmanuel Kant\".\nThat project\nprovided a foundation for my interest in the subject but also for a\nnumber of important turns in my educational career. These notes\nsimply reflect that interest, my reading on the subject, and both my\npersona! experience and philoso",
  "theme": "04-holland-college"
 },
 {
  "slug": "5-innovation-series-2015-11-01t19-18-28",
  "title": "5 Innovation Series  @2015-11-01T19;18;28",
  "summary": "Describes an \"Invitational Lecture Series on Education\" proposal to profile and recognize innovative individuals and organizations in PEI education. The initiative features no monetary awards but offers public recognition through presentations, membership in the PEI Educational Innovators Society, and documentation in occasional papers. Examples of innovators include Holland College advisors, Grace Christian School, and community learning centers.",
  "content_preview": "Prog/Prop/5\n\nInvitational\nLecture Series\n\nOn\n\nEducation\n\n\n\n\n\n\n\n\n\n\n\nBackground:\n\n\t\n\n\n\tPromotes\n\tinnovation\n\t\n\n\n\tRecognizes\n\tindividuals\n\t\n\n\n\tBuilds\n\ta cadre of innovators on PEI\n\n\n\n\n\n\n\nProposal:\n\tTo profile Island individuals and organizations who demonstrate\ninnovation\n\n\n practices\nin education.\n\n\n\n\n\n\nCharacteristics:\n\n\t\n\n\n\tRecognition\n\tnot an award\n\t\n\n\n\tNo\n\tmonetary value\n\t\n\n\n\tInnovators\n\twill be invited to make a public presentation\n\t\n\n\n\tThose\n\tselected will automatically become members of the",
  "theme": "04-holland-college"
 },
 {
  "slug": "500-beyond-knowledge",
  "title": "500 Beyond Knowledge",
  "summary": "Don reflects on his journey toward competency-based education, tracing influences from S.R. Laycock's learning models through his experience in vocational training and curriculum planning. He articulates the progression from traditional textbook-driven instruction to work-based, competency-focused approaches. Central to his vision is Benjamin Bloom's taxonomy and his observation that public schools remain stuck at the comprehension level rather than advancing students through analysis, synthesis, and evaluation. Don argues that vocational programs excel precisely because they clearly define performance levels in workplace-relevant language, distinguishing them from academic programs.",
  "content_preview": "Beyond Knowledge\n\n\n\n\nIn hindsight, I had been seeking a competency based approach to education for many years. Perhaps the stage was set by the learning model found in a text book by S. R. Laycock, a professor of Education at the University of Saskatchewan; his description of the learning process impressed me and stayed with me.  Later as my interests and studies moved beyond grades and subjects to education, the need for a more meaningful way to organize instruction became even more evident\n\n\n\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "500-college-and-university",
  "title": "500 College and University",
  "summary": "Don recounts the founding context of Holland College during PEI's \"Unholy War\" university merger controversy in the late 1960s. He explains his conviction that PEI needed a technical college distinct from university education, one providing training for occupations both within and beyond the island. This essay defines the philosophical differences between colleges and universities: colleges emphasize applied knowledge, intensive specialty study, field-derived content, employment success metrics, integrated theory and practice, and industry partnerships. Don argues against subordinating college curriculum to university transfer requirements, maintaining that quality college programs should prioritize relevance to employment and community needs rather than university credit transfer.",
  "content_preview": "College and University\n\n\n\n\n\n\n\nI was still living in Ottawa during “The Unholy War that rocked Prince Edward Island’ in the late 1960’s.  Reaction to the merger of the two universities was noisy; as for a technical college, I am told that educators saw no pressing need.  As I understand it, it was felt that the addition of a few courses at the Provincial Vocational Institute, or even the addition of diploma courses at the local university, would be more than adequate.  Given the latter view, expe",
  "theme": "04-holland-college"
 },
 {
  "slug": "500-continuous-intake",
  "title": "500 Continuous Intake",
  "summary": "Don criticizes traditional education's time-based administrative system where learners must begin and end on fixed schedules regardless of learning progress. He argues schools should operate more like hospitals, keeping students under care until they reach acceptable performance levels. At Holland College, Don experimented with continuous or staggered entry and exit, allowing students to begin programs when spaces became available rather than on rigid semesters. He acknowledges implementation challenges, particularly with small one- or two-instructor programs, but maintains the concept's validity. The essay reflects tension between administrative convenience and pedagogical effectiveness.",
  "content_preview": "Continuous Intake\n\n\n\n\n\n\n\nElsewhere in these my musings, I referred to the fact that education is driven by an out-dated administrative system where time on task is the constant and performance the variable.  The system focuses on groups not individuals and forces learners to begin and end studies, not based on learning progress but at the sound of a bell.  Teachers are required to fashion their teaching to fit available time rather than the system accommodating the needs of students. Learning th",
  "theme": "04-holland-college"
 },
 {
  "slug": "6-possible-projects-questions",
  "title": "6 Possible projects Questions",
  "summary": "Project ideas and initiatives for education reform in PEI, including surveys of education levels, research reviews on mathematics competencies, community-based education organization, and curriculum development models. Suggests bringing in speakers and implementing Holland College-style achievement records. Reflects Don's vision for systemic education improvements.",
  "content_preview": "Ideas/projects\n\n6 -Don’s Notes\n\n  \nLevels of education – Macmillan, McCabe, Stratton, Russell. Hall,Barb McNutt, Taylor, Minister, DM, Alice etc; Level 1 end of public shool; education or school system, survey of industry needs\n  \nReview of Research\n  \nCommission someone to do paper on Math\n  \nMath – competencies, applicable to public schools, plus post secondary; how to account for context, platform, pilot project, math teachers group, \n  \nCommunity based education organization\n  \nBring in spea",
  "theme": "04-holland-college"
 },
 {
  "slug": "69-rating-scales",
  "title": "69 Rating scales",
  "summary": "Open Education No. 69 (October 21, 2018), authored by Don Glendenning examining emerging performance-based rating scales. The article emphasizes that ratings must measure knowledge application in context, using criteria consistent between school and workplace, allowing progressive skill development. Don provides a detailed example of performance criteria: quality (consistency), quantity (speed), problem-solving, leadership, and dependability. He distinguishes between knowledge acquisition and performance demonstration, arguing knowledge matters only as it increases performance capacity. The bilingual publication includes parallel French content (\"Pédagogie Ouverte\"), and personal nostalgia about the first Holland College \"Monday Letter\" (August 4, 1969) provides biographical context for Don's institutional leadership history.",
  "content_preview": "Open\n\tEducation                           \n\t\n\n\t\n\n\tNo. 69\t\t\t\t\t\t\t   \t\t\t   October 21, 2018\n\t\n\n\n\n\t\n\t\n“The\n\tschool of tomorrow is not a school building, it is a capacity of\n\tculture development”\n\t\n\n\t\n\n\n\t\n\n\n\n\tRATING\n\tSCALES\n\t\nThe\n\timportance of rating scales is finally being recognized; they are\n\tdescribed as a scale that attaches a numerical value to  discernable\n\tlevels of performance. I intend to take a closer look at them but\n\trecent ones seem quite dynamic.\n\t\n\n\n\n\t\n\t\n“Rating\n\tof performance must ",
  "theme": "04-holland-college"
 },
 {
  "slug": "7-rating-scale-writing",
  "title": "7 Rating Scale - Writing",
  "summary": "A six-point rating scale for evaluating written work, ranging from 1 (disorganized with many errors) to 6 (creatively written with acceptable standards). Emphasizes grammar, sentence structure, organization, and vocabulary. Scale level 5 includes precise vocabulary and some creativity, while level 4 focuses on organization with few errors. This practical assessment tool reflects educational standards of the 1990s and likely informed Holland College's writing competency framework.",
  "content_preview": "tively written while observing a\n\nRATING SCALE FOR WRITING\n\n6\tCreatively written while observing acceptable \n\nstandards of grammar, sentence structure and \n\norganization. \n\n\t5 \tVery well organized showing precise and wide \n\nvocabulary, good sentence structure and appropriate \n\ngrammar and some creativity. \n\n\t4 \tOrganized with few errors in grammar and sentence \n\nstructure. \n\n\t3 \tOrganized with acceptable sentence structure, \n\ngrammar and vocabulary. \n\n\t2 \tGenerally organized but uses limited voc",
  "theme": "04-holland-college"
 },
 {
  "slug": "7-school-autonomy",
  "title": "7 School autonomy",
  "summary": "A letter advocating for increased school autonomy in PEI. Don references Holland College's deliberate approach to operational autonomy during the drafting of the Holland College Act (where Don served as founding president), arguing public schools deserve similar autonomy. He cites OECD PISA testing research showing students in autonomously operated schools perform better, and references Mathieu Bedard's Montreal Economic Institute paper (2015) supporting school autonomy with accountability. Don expresses one caution: schools need access to current educational research to inform their decision-making. This letter connects his personal Holland College experience to education policy advocacy, showing how his institutional leadership informed his reform vision.",
  "content_preview": "Dear Editor:\n\nSchool autonomy\n\nI was asked recently about the lack of autonomy in our school system. \n\nAs readers may know, among community colleges, Holland College was known for the degree of autonomy in operational matters.  That was a deliberate action taken by the College Planning Committee during the drafting of the Holland College Act. A similar level of autonomy should be given to public schools.\n\nThe OECD, who administers PISA tests, tells us that students from schools with autonomy in ",
  "theme": "04-holland-college"
 },
 {
  "slug": "78-a-misnomer-autorecovered",
  "title": "78 A Misnomer (AutoRecovered)",
  "summary": "Open Education newsletter No. 78 (July 20, 2019). Don reframes the \"math problem\" in schools as an education problem, arguing math is a tool requiring real-world relevance and proper fluency development. The article notes Sharon Cameron became President of Education 20/20 Inc. with Don as Past President, marking his continued leadership in education advocacy post-Holland College. References Australian HSC/VCE exports and Sackville Schools 2020 transition to official nonprofit status.",
  "content_preview": "Open\n\tEducation\n\t\n\n\t\n\n\n\t\n\t\n\n\tNo. 78\t\t\t\t\t\t   \t\t\t                        July\n\t20, 2019\n\t\nWe\n\tshouldn’t treat teachers as interchangeable widgets on a\n\tproduction line - Anon\n\n\n\n\t\n\n\n\t\n\t\n\n\tA\n\tMISNOMER\n\t\n\n\tPractically\n\tevery day an article comes to my attention about the importance of\n\tmath in our daily lives and the gap between what students learn and\n\twhat they need; I also hear it regularly from grandparents and\n\temployers.  Improvement in pan-Canadian and international tests  do\n\tnot seem to cor",
  "theme": "04-holland-college"
 },
 {
  "slug": "84-communication",
  "title": "84 Communication",
  "summary": "Don critiques communication gaps in PEI's education system, identifying three main concerns: (1) Department conflates \"education\" with schooling, creating terminology confusion; (2) Department's narrow role limits delivery to youth while other populations lack leadership and quality monitoring; (3) Communities feel forgotten despite education's responsibility to serve residents and communities. Uses construction worker shortage as example. Advocates for clearer language in media releases. Reports on Melrose, Massachusetts' competency-based education (CBE) program attempting to \"fundamentally rethink traditional schooling.\" Notes students appreciate freedom but teachers struggle with loss of control. Recommends Melrose and Hanover High School (NH) as \"must see\" examples. Discusses Common Core State Standards and need for better instructional support materials and student-responsive learning design.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 84\t\t\t   \t\t\t                                  \n\t     \tJanuary 20, 2020\n\t\n\n\tEducation\n\t- Any experience that has that has a formative effect on the way a\n\tperson thinks, feels or acts\n\t\n\n\t\n\n\n\t\n\n\n\n\tCOMMUNICATION\n\t\n\n\tEducation\n\tis a complex subject; It includes large numbers of people, young and\n\told, spread over a large territory, with a great variety of\n\tinterests and needs.  Communication is crucial; I must confess some\n\tuncertainty about the following: \n\t\n\t\n\n\t\n\n\n\t\n\t\n\t\t\n\n\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "85-grading",
  "title": "85 Grading",
  "summary": "Don clarifies three assessment purposes: diagnosing (a teaching function), determining performance level (not teaching), and ranking (not teaching). He argues strongly against including grading in teacher duties. Literature review findings: grading isn't essential to instruction, serves different purposes requiring different methods, is inherently subjective, has reward value but not punishment value, should reference learning criteria, harms peer relationships, and increases cheating. Notes schools adopting competency-based programming often have benefits neutralized by traditional grading policies. Reports EdCan Network survey showing most Canadians underestimate graduation rates; 46% of respondents thought a 1% graduation increase saved $2.8 million annually (actual: $7.7 billion). Discusses educational reform approaches and Don's positive experience with school self-evaluation visitation teams, carried forward during Holland College service.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 85\t\t\t   \t\t\t                                  \n\t     \tFebruary 20, 2020\n\t\n\n\tEvaluation\n\t- aa overall judgement of what has been learned\n\t\n\n\t\n\n\n\t\n\n\n\n\tNOT\n\tA SCHOOL FUNCTION\n\t\n\n\tThere\n\tare three reasons for assessing students: to diagnose, determine\n\tlevel of performance/achievement and to rank.  Only one is a\n\tteaching function – that of diagnosing; the others should not be\n\texpected of teachers. I’m not against grading but believe strongly\n\tthat grading should not be inclu",
  "theme": "04-holland-college"
 },
 {
  "slug": "87-schools-without-walls",
  "title": "87 Schools without walls",
  "summary": "Don recounts visiting Philadelphia's \"School Without Walls\" in the 1970s, inspired by a Life magazine advertisement. The school located classes throughout the city in libraries, galleries, churches, and available spaces rather than in traditional buildings, with teachers' first task being to secure meeting space. Don reflects that while interesting then, schools without walls are now more feasible given internet information access, competency-based education, performance assessment, computers, and individual learner management systems. He proposes two implementation scenarios: apprenticeship programs using competency analyses with learning managers (unlike teachers, more akin to physicians) who identify needs, create learning plans, secure opportunities, and provide feedback. The learning manager contracts specialized instruction and arranges apprenticeship testing and placement with employers. Similar models could work for mathematics, communication, history, art, and music.",
  "content_preview": "87-Schools Without Walls\n\nv.;j\n\n\n\n\n~ v-<-\"' Feb 19,2004 19-5CHOOLS WITHOUT W7LS /'\n\n\n\n\n~\n\nReaders who r member wRerrLif~gazine ~'Pt~heg weekly~ may also recall some <.-Rtf the striking advertisements carried therein. One that I recall vividly, and one that always intrigued me was the one promoting -.\"SchooF\"Without Walls\". As I recall, it was an academic high school following the regular schoQI curriculum and located in the city of Philadelphia. '\n\n\n\n\nBack in the 1970's, I was at a conference in",
  "theme": "04-holland-college"
 },
 {
  "slug": "88-10-overhaul",
  "title": "88 -10 Overhaul",
  "summary": "Open Education No. 88-8 (June 4, 2020). Comprehensive critique of PEI education: provincial responsibility but lacking vision, mismatch between learner needs and system delivery, narrowly cognitive focus, and embedding in political structure limiting effectiveness. Don proposes clear vision statement with principles, services definition, standards, and organization reflecting tasks. Advocates professional educator independence from political filter. Calls for education overhaul addressing systemic structural problems. Represents culmination of his post-Holland College reform advocacy, emphasizing autonomy, accountability, and systems thinking.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 88-8\t\t   \t\t\t                                 \n\t      \t               June 4, 2020\n\t\n\n\tQuality:\n\t a customer’s perception of the value of a supplier’s work\n\toutput  - New Zealand \n\t\n\n\n\n\t\n\n\n\t\n\t\nEDUCATION\n\tAND GOVERNMENT\n\t\n\n\n\n\t\n\t\nIn\n\tCanada, education is a provincial responsibility; Provinces not only\n\tfill a leadership role, they direct deliver practically all\n\teducational services with  their own staff..  Doing so may explain\n\tsome of education’s major shortcomings..\n\t\n\n\n\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "9-focus",
  "title": "9 Focus",
  "summary": "Don compares PEI's education department (focused on \"delivering curriculum\") with other provinces' broader mandates focused on developing lifelong learners and productive citizens. He argues for organizational structure based on subject fields (mathematics, arts, languages, science) rather than grade levels, and criticizes the interchangeability of \"school\" and \"education\" as contributing to system confusion. This critical analysis reflects his concerns from Holland College presidency.",
  "content_preview": "No. 8\n\nRole of PEI Department of Education\n\nThe Department of Education describes its role as one of “developing and delivering curriculum to youth”. My conversations with Islanders suggests that they expect more.\n\nOther dscriptions include:\n\n  \nNB – Helping citizens gain attributes needed to be lifelong learners\n  \nAlberta – skills needed to be successful in a rapidly changing  economy and society\n  \nAnon – help people navigate life and contribute to society\n  \nAnon – encourage, support and reg",
  "theme": "04-holland-college"
 },
 {
  "slug": "90-math-rating-scale",
  "title": "90 Math rating scale",
  "summary": "Don presents the \"Citizen Math Map\" identifying 74 skills Islanders use daily in six categories: estimate/calculate whole numbers, measurement, fractions/decimals/percentages/ratios/rates, spatial reasoning, patterns/relationships, and statistical interpretation. First panel of Island residents identified these citizen-focused skills. Second panel established universal rating criteria applicable across all learners: accuracy/quality, assistance needed, speed/completion time, and consistency across tasks. The newsletter includes draft rating scale from \"Can perform task with more than acceptable speed and quality, with initiative, adaptability and leadership\" down to \"Limited knowledge of math facts.\" Scale notes apply to all learners and are based on community standards. This represents practical implementation of Don's philosophical commitment to competency-based education and community-relevant assessment standards.",
  "content_preview": "333333\t\t\tOpen Education\n\nNo. 90\t   \t\t\t                                        \t                \t July 20, 2020 _____________________________________________________________________________________\n\n…redesign subject syllabuses so students could progress at their own pace – Masters, Australia\n\n\n\n\n\n\n\nUNIVERSAL RATING SCALE\n\nA few weeks ago, I circulated a Citizen Math Map; skills were identified by a panel of Islanders with the help of a skilled facilitator. Panelists were asked about skills used ",
  "theme": "04-holland-college"
 },
 {
  "slug": "a-2-cbe",
  "title": "A-2 CBE",
  "summary": "Educational document on Competency-Based Education (CBE) explaining the shift from content-focused to learner-focused education. Defines CBE, identifies key characteristics and benefits including consistency, accountability, and deeper learning. Includes recent references and discussion of how CBE accommodates individual learning styles. Central to Don's educational philosophy and reform initiatives.",
  "content_preview": "About\nEducation\n\nCompetency\nBased Education\n\n\nNo.\n2-1                     \t\t\t         \t\t\t\t\t\tAugust\n\n\n\n\n\n\n\nBackground\n\n\nTraditionally\nschools focused on content to be learned, whether it be in the arts,\nliterature, sciences, business or technology.  For the purpose of\nteaching and learning, fields were divided into subjects, courses,\nunits, lectures or lessons; assignments and assessment followed suit.\n One’s education, at least the part experienced in school, became\nthe study of a series of disc",
  "theme": "04-holland-college"
 },
 {
  "slug": "admission-to-post-secondary-2015-07-04t09-41-34",
  "title": "Admission to Post secondary@2015-07-04T09;41;34",
  "summary": "Planning sheet for an Education 20/20 Inc. workshop on postsecondary admissions and curriculum development processes in PEI. Intended as a team presentation involving UPEI Registrar Kathleen Kielly, Holland College representatives, and College Acadie IPE, with Derek McEwen and colleagues presenting on Department of Education curriculum initiatives. Open to the public and designed to inform participants about admissions requirements and educational pathways.",
  "content_preview": "r\n\n                                 PLANNING\nSHEET     \n\n\n1-3\n\n______________________________________________________________________________\n\nTitle:\t\n  \tThe next step; access to post secondary studies- TBA\t\n\nPurpose:\n  \tA presentation on the curriculum PEI development process \t\n\n\n\n\n\n\n\n\nDescription:\n\n\n\n\n\n\n\n\nFormat: \tTeam:\n\n\t\n\nUPEI:\n\tKathleen Kielly, Registrar; kkielly@upei.ca;\n\t(902) 566-0628\n\t\n\nHC:\n\t          566-9517\n\t\n\n\n\tCollege Acadie IPE:\n\n\n\n\n\n\n\n Host:\t\t\n\n\nInvitees: \tOpen\nto the public\n\n\n\n\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "anticipaed-changes",
  "title": "Anticipaed Changes",
  "summary": "Comprehensive list of anticipated education changes for PEI covering purpose clarification, autonomy/oversight separation, curriculum documentation, competency-based education, learning guides, student/family advisors, community service centres, and authentic assessment. Reflects Don's vision for systemic education transformation.",
  "content_preview": "About\nEducation\n\nGlendenning notes\n\n\n  CHANGES\n-2\n\n\t\n\nDocument\n\tleaning process\n\t\n\nReview\n\tpurpose\n\t\n\nSeparate\n\t“operations and “oversight” \n\t\n\t\n\nRole\n\tof Department\n\t\n\nIncrease\n\tschool autonomy\n\t\n\nIssue\n\tcommunity education newsletter \n\t\n\t\n\nRestructure\n\tDepartment around education functions\n\t\n\nClarify\n\taccountabilities\n\t\n\nDocument\n\tcurriculum development model\n\t\n\nReplace\n\tlesson plans with learning guides\n\t\n\nDocument\n\tlearning model\n\t\n\nProfiles\n\tinstead of grades\n\t\n\nIdentify\n\tand offer services",
  "theme": "04-holland-college"
 },
 {
  "slug": "app-3-ministers",
  "title": "App. 3 Ministers",
  "summary": "Comprehensive chronological listing of ministers serving St. Stephen's Presbyterian Church (1834-1926) and St. Paul's Presbyterian Church (1926-2003). Documents religious leadership across 170 years of the congregation's history, including Rev. Wallace Whyte who conducted Don's wedding in 1958.",
  "content_preview": "APPENDIX 3\n\n\n\n\nPRESBYTERIANS IN BLACK RIVER\n\n\n\n\nMINISTERS\n\n\n\n\nSt. Stephen’s Presbyterian Church\n\n\n\n\nl\n\nRev. Simon Fraser\t\t1834-1840\n\nRev. Angus McMaster\t\t1842-1845\n\nRev. John Turnbull\t\t1848-\n\nRev. Demster Wallace\n\nRev. Stevenson\t\t\t1854-\n\nRev. Forbes\n\nRev. James Fowler\t\t1857-\n\nRev. Robert Faulkner\t\t1860-1863\n\nRev. Frederick Holme\n\nRev. A Glendenning\n\nRev. Samuel Russell\t\t1873-1876\n\nRev. William Fogo\t\t1876-1877\n\nRev. John Robertson\t\t1877-1904\n\nRev. A. J. W. Myers\t\t1905-1909\n\nRev. George Grant\t\t191",
  "theme": "04-holland-college"
 },
 {
  "slug": "budget",
  "title": "Budget",
  "summary": "A financial document for the DACUM commemorative event project, detailing revenue sources including volunteers, honorariums for experts ($100 for Don as former Holland College President), Canada 150 funding ($921), and cash donations ($200). Expenditure categories cover catering, photocopying DACUM charts for display, room rental at Haviland Club, purchasing Adams' seminal DACUM book for Holland College, and promotional materials. The budget totals approximately $925, reflecting careful planning for a modest-scale event. The inclusion of Don's name as a key expert contributor ($100 honorarium) underscores his prominent role in DACUM implementation and the professional respect he commanded.",
  "content_preview": "DACUM Budget\n\n\n\n\nRevenue\n\n  \nVolunteers: 20 hours @ $15 = \t\t\t\t\t\t$300\n  \nHonorarium to Experts for day of public event:  Lawrence Coffin,\n\n\nInternationally recognized DACUM Analyst; Jack Sorenson, \n\nExperienced instructor in DACUM system; Mike Chapman,\n\n Consultant on competency analysis; Don Glendenning former\n\nPresident of Holland College @ $100\t\t\t\t\t$400\n\n  \nHonourarium for Resource persons: Tom Jones, former Director of Nova Scotia \n\n\nNewStart Corporation; Austen Bowman, Director of New Start ",
  "theme": "04-holland-college"
 },
 {
  "slug": "cbe-model-systems",
  "title": "CBE Model-systems",
  "summary": "Detailed systems model for competency-based education with six major phases and component details: (1) Assess Needs—review trends, examine jurisdictions, consult stakeholders, determine service levels, identify gaps; (2) Establish Standards—identify competencies, performance criteria, evaluation frameworks, benchmarks; (3) Plan Resources—establish policies, learning models, identify staff/facility/instructional requirements, arrange funding; (4) Implement Program—promote services, register learners, assess learning, counsel learners, monitor progress; (5) Certify Achievement—assess achievement, award certificates, institute warranty; (6) Manage System. This comprehensive framework demonstrates sophisticated understanding of CBE program development suitable for college-level implementation.",
  "content_preview": "SYSTEMS MODEL FOR COMPETENCY BASED EDUCATION \n\n\n\n\n  \n    \n      \n        \nConruct Needs \n      \n      \n        \n\n\n      \n    \n    \n      \n        \nAssessment \n      \n      \n        \n- \n      \n    \n    \n      \n        \nReview Trends \n      \n      \n        \n\n\n      \n    \n    \n      \n        \nExamine \n      \n      \n        \nOther \n      \n      \n        \n\n\n      \n    \n    \n      \n        \nJurisdictions \n      \n      \n        \n\n\n      \n    \n    \n      \n        \nReview \n      \n      \n        \n\n\n      ",
  "theme": "04-holland-college"
 },
 {
  "slug": "ceremony-president",
  "title": "Ceremony-President",
  "summary": "Don's thank-you letter (February 2006) to Dr. Brian MacMillan, Holland College President, for the honor of Glendenning Hall naming. Expresses gratitude to board and college community, notes pleasure at informal ceremony and family attendance, and appreciates professional organization.",
  "content_preview": "62 Queen Elizabeth Drive\n\n\t\t\t\t\t\t\t\tCharlottetown, PE C1A 3A9\n\n\n\n\n\t\t\t\t\t\t\t\t                February 22, 2006\n\n\n\n\n\n\n\n\n\n\nDr. Brian MacMillan, President\n\nHolland College\n\n140 Weymouth St\n\nCharlottetown, PE\n\nC1A 4Z1\n\n\n\n\n\n\n\nDear Dr. MacMillan:\n\n\n\n\nThank you for your generous words at the ceremony giving the name, Glendenning Hall, to the new Holland College residence.  It was an honour, indeed and somewhat overwhelming.  Also, please extend my thanks and appreciation to the Board of Governors and the la",
  "theme": "04-holland-college"
 },
 {
  "slug": "cheating",
  "title": "Cheating",
  "summary": "Published as Education 20/20 Issue article, this piece analyzes rising academic cheating and proposes competency-based education as a solution. Glendenning documents various cheating trends—plagiarism software arms races, file-sharing mentality, test anxiety, grade inflation—and identifies systemic causes: poor teaching, lack of rapport, and emphasis on grades over learning. He argues that traditional subject-based testing is vulnerable to cheating, while competency-based programs, which assess observable real-world performance over multiple occasions, make cheating nearly impossible. The document reveals Don's ability to connect educational philosophy to practical behavioral issues.",
  "content_preview": "EDUCATION \t\t\t\t\t\t\tIssue No.\n\n20/20  \tYOU MAY CHEAT ON SUBJECTS\n\n\t\tBUT NOT ON EDUCATION       _______________________________________________________________________A scan of items on cheating in The New York Times over the past few weeks, reveals that:\n\n\n\n\ncheating continues to be a problem; it may be on the upswing or it may be that we catch more cheaters\n\nSome schools require students to have their papers checked by a “plagiarism program”\n\nSome cheating may be attributed to the widespread pract",
  "theme": "04-holland-college"
 },
 {
  "slug": "credits",
  "title": "Credits",
  "summary": "Credits for a slide-tape presentation introducing Holland College's STEP (Self Training and Evaluation Program) in September 1970. Don is listed as \"Historian.\" The document credits include Sandy Carruthers (Graphics), Matt Rainnie (Narrator), Terrence McGaughey (AV Services), Sandi White (Coordinator), Henry Purdy (Consultant), and others. This artifact demonstrates Don's early involvement in shaping and documenting Holland College's identity and educational approach.",
  "content_preview": "Opening\n\nIn September xx, 1970\n\nHolland College introduced \n\nSTEP\n\nSelf Training and Evaluation Program\n\n\n\n\nPart of the orientation for students\n\nwas a slide-tape presentation\n\nproduced by the staff of the day.\n\n\n\n\nThis re-creation is based on surviving \n\nblack and white print copy \n\nand a few original colour visuals \n\n\n\n\nCredits\n\nSandy Carruthers, Graphics\n\nMatt Rainnie, Narrator\n\nTerrence McGaughey, AV Services\n\nSandi White, Coordinator\n\nDon Glendenning, Historian\n\nHenry Purdy, Consultant\n\nAsh",
  "theme": "04-holland-college"
 },
 {
  "slug": "curriculum-5-references",
  "title": "Curriculum-5 References",
  "summary": "Curated bibliography of contemporary educational research and initiatives supporting competency-based and mastery-based learning approaches. References span 2016-2017 innovations in New Hampshire performance-based assessments, New York mastery-based classrooms eliminating grades and failure, competency-based education models, and student satisfaction research. Includes references to provincial initiatives in Newfoundland and Labrador, Alberta curriculum overhaul, Ontario mathematics score concerns, and MPHEC (Maritime Provinces Higher Education Commission) competency frameworks. Emphasizes emerging trends moving away from standardized testing toward performance-based assessment and competency demonstration, aligning with Don's educational philosophy.",
  "content_preview": "Page1\n\t\n\n\n\t\n\n\nAbout Education\t\t\t\t\t\t\t\t\t\n\n\nCurriculum\nReferences\n\n\n\t\t\t\t\t\t\t\t\t\n                          About-Curric-2\n\n\n\n\n\n\n\n\n\n\n\n\n\nCurriculum\nreferences\n\n\n\n\n\n\n\t\n\n\n\t\n\tNYTimes:\n\tA New Kind of Classroom: No Grades, No Failing, No Hurry;\n\thttps://www.nytimes.com/2017/08/11/nyregion/mastery-based-learning-no-grades.html?smid=nytcore-ipad-share&smprod=nytcore-ipad\n\n\n\n\n\n\n\n\n\t\n\n\n\tTest\n\tDrive: New Hampshire teachers build new ways to measure deeper\n\tlearning\n\n\n\nSchools\nacross the country are watching as som",
  "theme": "04-holland-college"
 },
 {
  "slug": "curriculum-platform-2",
  "title": "Curriculum Platform=2",
  "summary": "Refined platform framework document (About-Curric-2) presenting a universal curriculum platform for competency-based education. Defines key terms (curriculum, platform, competency, multi-level) and outlines platform components including competency analysis, performance criteria, rating scales, and benchmarks. Emphasizes principles of stakeholder accessibility, learner-centered language, and practitioner engagement to serve as a versatile base for instructional service provision.",
  "content_preview": "About\nEducation\t\t\t\t\t\t\t\n\t\t\n\n\nA\nUniversal Curriculum Platform\n\n\n\t\t\t\t\t\n                          About-Curric-2\n\n\n\n\n\n\n\n\n\n\nOBJECTIVE:\nto\ndevelop a platform for presenting competencies in support of\ncompetency-based education.\n\n\n\n\n\n\n\n\nDEFINITIONS\n\n\n\n\t\n\n\n\tCurriculum\n\t– experiences\n\tplanned in support of learning\n\t\n\n\n\tPlatform\n\t–\n\ta base on which applications, processes or technologies may be\n\tdeveloped or mounted\n\t\n\n\n\tUniversal\n\t–\n\tapplicable in all fields \n\t\n\t\n\n\n\tCompetency\n\t–\n\ta statement of observa",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-2014-education-moving-outside-school",
  "title": "D 2014 Education moving outside school",
  "summary": "Published July 12, 2014, Don discusses the TOWES Test (Test of Workplace Essential Skills) developed at Bow Valley College, which assesses nine competencies including reading, numeracy, communication, and computer skills—areas employers frequently cite as deficient in graduates. He notes usage at Holland College and possibly other programs but absence from public schools. The test provides proficiency levels rather than rankings, addressing employer needs for meaningful competency verification. The letter reflects his pragmatic approach to bridging school-to-work transitions and finding market solutions to credential gaps.",
  "content_preview": "July 12, 2014\n\n\n\n\nEditor, Charlottetown Guardian\n\nCharlottetown, PEI\t\n\n\n\n\nDear Sir:\n\nEducation moving outside school \n\n\n\n\nEmployers need employees who can read and write but having a high school graduation diploma doesn’t provide that information; a copy of transcripts probably won’t tell either.  But there is a new tool on the market that may help; it’s called a TOWES Test; it’s worth having a look.\n\n\n\n\nTOWES (Test of Workplace Essential Skills)  was developed at Bow Valley College in Alberta a",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-2020-chancs-of-change",
  "title": "D-2020-chancs of change",
  "summary": "An analysis of prospects for education improvement in PEI, concluding chances are \"slim\" based on several observations: limited autonomy in school boards, hesitancy shown by adding \"Lifelong Learning\" terminology, youth-focused programming missing dynamics of education, lack of transparency in departmental structure, and absence of unifying beliefs or goals. Don suggests possible interventions: visiting Melrose, Massachusetts to examine educational practices, piloting competency-based education across the island, establishing a PEI Education Association, and separating professional from administrative/political functions.",
  "content_preview": "Who checks quality of education?\n\nDear Editor:\n\nChances of change in education\n\nSpending too much time thinking about what’s wrong\n\nNeed to propose action\n\nHavent jeard anyone say they want to improve education\n\n\n\n\nGo into seclusion for a few days and produce a five page paper on education for PEI\n\nTake a car load of people  to Melrose, Mass to examin what they ar doing\n\nPerhaps stop on new Hampshire\n\nRun a pilot math  CBE across Island to include PS< YP and hc.\n\nEstablish/support a PEI Educ ass",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-3-school-autonomy",
  "title": "D-3 School autonomy",
  "summary": "Don draws from his Holland College experience to argue that schools should have autonomy similar to what made community colleges successful. He cites OECD/PISA research showing that schools with greater autonomy over curriculum and assessment, combined with public accountability measures, achieve better student performance. This letter is brief but significant, applying his institutional knowledge to current policy debates and supporting evidence-based educational reform.",
  "content_preview": "Dear Editor: \n\nAUTONOMY AND ACCOUNTABILITY\n\n\n\n\nOne of the hallmarks of Holland College among community colleges in Canada was its degree of autonomy in the day-to-day operation; the writer is of the view that a similar level of autonomy and accountability should be extended to public schools.  The OECD, who gives us PISA  agrees.\n\nAccording to the OECD\n\n  \nIn countries where schools have greater autonomy over what is taught and how students are assessed, students tend to perform better.”\n  \nin c",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-4-a-primer-2015-07-28t16-24-18",
  "title": "D-4-A Primer @2015-07-28T16;24;18",
  "summary": "Substantial occasional paper (D-4-A) presenting Don's comprehensive educational framework. Addresses education as societal responsibility, defining key terms, outlining components of quality education systems, and discussing concerns about current practice (social promotion, age-based credentials, lack of consultation). Reflects his extensive thinking on education policy informed by his Holland College experience.",
  "content_preview": "About\neducation\t\n\n\nA\nPrimer \n\n\n\n\n\n\n\n\n\nOccasional\nPaper D-4-A\t\t                        \t\t\t         \t\t\tMarch 28, 2015\n\n\n\n\t\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nBackground:\n\t\n\n\n\n\t\n\t\nIt\n\tis widely recognized that education is a key factor in determining\n\teach citizen’s quality of life; in the same way, the collective\n\teducation of our citizens will determine to a significant degree the\n\tquality of the community in which we live. \n\t\n\t\n\n\n\n\t\n\t\nThe\n\tresponsibility for a person’s education rests first with family\n\tand later",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-8-extended-year",
  "title": "D 8  Extended year",
  "summary": "This proposal establishes the Better Education Fund to support improvements in public education by making strategic grants. Don articulates his core educational philosophy: standards should be set with flexible time rather than fixed time with flexible standards. He references Holland College's early secretarial program operating year-round, where students completed training between 16-20 months. The pilot proposes offering 20 students who received B or below grades in mathematics or communication a chance to earn an A through additional instruction and individualized learning plans. The proposal emphasizes accountability, cost-effectiveness, relevance, standards alignment, flexibility, and choice in education.",
  "content_preview": "E\n\nBETTER EDUCATION FUND\n\nPurpose:\t\n\n\n\n\nBackground:\t\n\n\n\n\nProposal:\t\n\n\n\n\nEducation  is important\n\nKey to a good life\n\nSchools need our support\n\nWell being of our community\n\n\n\n\nEconomic survival\n\n\n\n\nDifficult for schools to keep up\n\n\n\n\nEquipment, books, resource materials, technology,\n\n Students arrive hungry\n\nStill drop out before high school completion\n\n\n\n\nRoles people play\n\n\n\n\nAll need help at some point\n\n\n\n\nSchools operate for a set number of days each year and students are encouraged to learn",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-an-opportunity",
  "title": "D An opportunity",
  "summary": "Don positions PEI's move to a single school board as an opportunity to implement governance reform. He argues schools shouldn't be run by government, advocating instead for delegation to teachers as professionals (comparable to doctors and lawyers), school autonomy, and closer decision-maker-to-stakeholder relationships. He references Holland College's 1969 Board of Governors model as successful precedent for delegated governance. The letter demonstrates Don's belief that structural governance changes enable operational improvements and his institutional knowledge from college leadership.",
  "content_preview": "July 18, 2012\n\n\n\n\nEditor, The Guardian\n\nCharlottetown, PEI\n\n\n\n\nDear Sir:\n\nA Leadership Opportunity\n\n\n\n\n\n\n\nThe Editorial in the Guardian on Saturday, July 14 and Tom Connor’s letter of July 19 address the need for new thinking and new approaches in education.  Today, as I write, my inbox contains a new message linking quality performance and local budget control.  Delegation not only reflects good management but also sends a signal to the community that their views are being heard. \n\nThe decision",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-better-edu-starts-in-the-home",
  "title": "D Better Edu-Starts in The Home",
  "summary": "Don welcomes a governance review and outlines diverse delivery system options: private schools, teacher-led schools, charter schools, the Edmonton model, crown corporations, or PEI-specific approaches. He references Alberta's educational diversity and consistent high test results as potential model. He advocates for school board freedom and teacher autonomy, and explicitly references Holland College's Board of Governors governance as a precedent PEI should consider for public schools. The comprehensive position paper demonstrates Don's systematic thinking about institutional design and his accumulated experience.",
  "content_preview": "ImJuly 9, 2011\n\n\n\n\nEditor \n\nGuardian\n\nCharlottetown, PEI\n\n\n\n\nDear Sir:\n\nBetter Education: Starts in the Home\n\n\n\n\nI am an advocate of change in the way we deliver education and, therefore, welcome the Minister’s announcement that a review of school governance is planned.  Needs are diverse and the delivery system should encourage, and be able to accommodate, a variety of providers.    \n\n\n\n\nGovernment’s role is to provide leadership, standards and resources – and then get out of the way.  The Prov",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-birt-roger-numeracy-2019",
  "title": "D Birt Roger-Numeracy 2019",
  "summary": "Fundraising letter to Roger Birt requesting financial support ($1,000-$2,000) for a numeracy initiative. Despite rising PEI math test scores, Don notes that practical shop-floor math skills remain unchanged, indicating a gap between testing and real-world application. He proposes conducting a two-day brainstorming analysis of Islanders' actual math needs, drawing on his experience with similar techniques at Holland College. The analysis costs $15,000 and would inform development of numeracy programs addressing practical application of mathematics skills.",
  "content_preview": "February\n20,  2019\n\nMr.\nRoger Birt, President\n\nR.\nBirt and Associates\n\n27\nBrackley Point Road\n\nCharlottetown,\nPE  C1A 6Y1\n\n\n1-1-2\n\n\n\n\n\n\nDear\n\nMath\non PEI\n\n\n\n\n\n\nAlthough\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen wondering why.\n\n\n\n\n\n\nIslanders\nneed math; citizens may not need a  high level but they need to be\nable to measure, sort, calculate, group and estimate numbers, space,\ntime  distance, etc.  and th",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-freedom-to-act",
  "title": "D Freedom to act",
  "summary": "A substantial letter arguing that bureaucratic constraints represent the primary barrier to education improvement. Don advocates for increased autonomy at school and teacher levels, greater flexibility in scheduling and staffing, and local decision-making authority. He references his Holland College experience as evidence that organizational freedom enables quality improvement. He calls for an Education Council with broad community representation and revised Schools' Act to delegate greater autonomy. This piece synthesizes his core conviction that systemic improvement requires structural freedom combined with accountability.",
  "content_preview": "November 16, 2012\n\n\n\n\n\n\nEditor\n\n\n\nGuardian\n\nCharlottetown,\nPEI\n\n\n\n\n\n\nDear\nSir:\n\n\n\n\n\n\nThe\nfreedom to act, or alternatively an oppressive bureaucracy, is\nperhaps the distinguishing feature of most education systems in\nCanada today, and is a major barrier to educational improvement.  The\nemphasis on time, content, conformity and batch processes are out of\nsync with the twenty first century.  Most people I talk with, both\ninside and outside the education system, know this and are frustrated\nby it, b",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-functional-analysis",
  "title": "D-functional analysis",
  "summary": "Don addresses the \"culture of fear\" reportedly pervasive in PEI public education, citing Donald Savoie's \"What Government is Good At\" for context. While he personally hasn't experienced pressure to silence his views, he's encountered government-dependent contractors reluctant to engage with Education 20/20 Inc. due to fear of professional repercussions. He parallels this to Holland College's founding: the 1968-69 College Planning Committee recommended unicameral boards for community colleges rather than provincial creatures of government, resulting in colleges able to focus mission rather than feed bureaucracy. He advocates functional analysis showing that provincial direct operation of schools creates the problems; provinces should instead adopt support and encouragement roles. Proposes management consulting intervention to broaden departmental mandate from operational control to leadership functions.",
  "content_preview": "January 20, 2016\n\n\n\n\nEditor,\n\nCharlottetown Guardian\n\nCharlottetown, PEI\t\n\n\n\n\nDear Sir: \n\nA culture of fear\n\n\n\n\nPeople often mention a “culture of fear” in public education; if that’s so, we should do something about it.  Having read Donald Savoie’s recent book, What Government is good at, I have a better understanding of that concern.  Personally, I’ve not encountered any pressure to withhold my point of view.  On the other hand, I have encountered people who, because they depend upon governmen",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-incentive",
  "title": "D incentive",
  "summary": "2008 proposal for an Educational Incentive Fund to drive systemic education change. Don identifies structural weaknesses including accountability dispersal, rising costs without productivity gains, discipline-based content delivery, vague standards, and lost flexibility. Proposes a fund encouraging schools to innovate with outcomes-based approaches, staffing flexibility, and cost accountability. Management involves the Community Foundation of PEI, private sector advisors, and education professionals. Includes Don's biographical summary highlighting his background as Founding President of Holland College, educational consultant, and international development expert with projects across Africa and Asia.",
  "content_preview": "Feb 12, 2008\n\nIMPROVEMENT INCENTIVE FUND\n\n\n\n\nA Draft Proposal\n\n\n\n\nBACKGROUND: \n\n\n\n\nEducation is under considerable scrutiny and pressure to reform. Some of the criticism is valid; some is not. Provincial governments have responded in a number of ways including  restructuring school boards, lengthening the school day, encouraging charter schools, increasing teacher qualifications, specifying learning outcomes, introducing external examinations and providing teacher aides.  \n\n\n\n\nThese changes shou",
  "theme": "04-holland-college"
 },
 {
  "slug": "d-the-math-mountain",
  "title": "D The Math mountain",
  "summary": "Using mountain climbing as an extended metaphor, Don argues that mathematical learning should not be described or assessed by student age. Just as mountain climbers progress at individual rates with appropriate guides and base camps, math learners need varied pacing and support structures. He questions whether we can identify root causes of post-secondary rejection or employment barriers, suggesting deficiencies might stem from age-based rather than competency-based educational approaches. The letter invites reader perspectives on this fundamental educational design question.",
  "content_preview": "July 10, 2014\n\n\n\n\nEditor, The Guardian\n\nCharlottetown, PEI\n\n\n\n\nDear Sir:\n\nDescribing the math mountain \n\n\n\n\nPeople of all ages climb mountains; mountains are described in terms of elevation but there are other features and factors come into play.  The height reached may result, at least in part by features of the mountain but also may be the result of persona goals, insufficient prior experience.   Mountain operators help one climb the mountain in a safe amanner  as far as I know, do not limit  ",
  "theme": "04-holland-college"
 },
 {
  "slug": "dew-letters",
  "title": "DEW Letters",
  "summary": "A detailed explanation of Holland College's \"DEW Letters\" (Distant Early Warning letters), which alerted students early if they were at risk of not meeting learning objectives—inspired by the Cold War-era DEW radar line. Don explains the rationale: students needed immediate feedback, not just at mid-term, as part of the teaching-learning process. This innovative early intervention system exemplifies Holland College's student-centered approach under Don's leadership and his integration of Canadian cultural references into educational practice.",
  "content_preview": "DEW Letters\n\n\n\n\nOld timers will remember the DEW line – a series of radar stations positioned across northern Canada to provide a “Distant Early Warning” of incoming enemy aircraft and missiles.  They were very much a product of my time and are well known in PEI because of the pioneering aviation work of Carl Burke, the founder of Maritime Central Airlines, in delivering men, equipment and goods to Canada’s north.\n\n\n\n\nWe, at the College, were of the view that students in danger of not reaching t",
  "theme": "04-holland-college"
 },
 {
  "slug": "diosces-article-january-2013-by-twila-buttimer",
  "title": "Diosces article -- January 2013 by Twila Buttimer",
  "summary": "Comprehensive two-part diocesan archives article by Twila Buttimer documenting Rev. Harvey Douglas Smith's role founding MRHS. Part One (1912 birth in Saint John, Kings College B.A. 1934, ordained 1936-1938) describes Smith's 1937 arrival at Bay du Vin and his grassroots educational initiative with 8 students in the rectory study, expanding to 67 by September 1939. Part Two recounts Smith and Fred Fowlie's successful lobbying for provincial funding, the school board (chaired by Smith, with A.M. Cameron, Harrison T. Smith, Ian MacNaughton), construction completion January 1940, curriculum including weaving courses, and Smith's 1946-47 return as principal attempting a residential program for scholarship boys. Smith's later career (Montreal 1948, Spokane 1955) and 1969 death in Wolfville are documented. The article credits Don as a primary source (\"Dr. Don Glendenning of Charlottetown (a student of the Rev. H. Douglas Smith), who told the archives of this story\"), confirming his role in preserving Smith's legacy.",
  "content_preview": "THE REV. HARVEY DOUGLAS SMITH  -  MAKING A DIFFERENCE ON THE MIRAMICHI\n\nPART ONE \n\nWhen Archbishop Richardson appointed a young deacon named Harvey Douglas Smith to serve St. John’s Church in Hardwicke, it is doubtful that he knew the positive life changes this appointment would bring to many young Miramichiers.    Smith is credited with being the founder of Miramichi Rural High School, the first rural high school in NB, the story recounted here.  Where possible, H. D. Smith’s own words are used",
  "theme": "04-holland-college"
 },
 {
  "slug": "don-s-note-to-quentin-2014-12-03t04-26-10",
  "title": "Don's note to Quentin@2014-12-03T04;26;10",
  "summary": "Draft version of Don's note to Quentin on educational assessment and preparedness gaps, documenting concerns about PEI youth's basic mathematics and literacy skills based on PISA, Vital Signs survey, Chamber of Commerce, and employer feedback. Don advocates for Chamber engagement with the Department of Education and exploration of third-party assessment services through Holland College and Workplace Learning to help employers identify qualified candidates.",
  "content_preview": "Dec.\n2, 2014\n\nAssessment\n  \n\n\nEDUCATION\n20/20 INC.\n\nSkill\nlevel  of Island youth\n\nBackground\n\nConcerns\nabout literacy levels of Islanders have been widely reported: PISA\nresults, CFPEI survey, Charlottetown Area chamber, Home and School,\nEducation 20/20 workshops, Employers concerns, PEI Literacy Alliance\n\n\n\n\n\n\n\nDon\n\nMy\nconcerns stem fro the findings of the survey. Vital Signs, by the\nCommunity Foundation of Pfrince Edward Island and, in particular, the\n“preparedness gap” in terms of preparation",
  "theme": "04-holland-college"
 },
 {
  "slug": "editor-ron-baker",
  "title": "Editor- Ron Baker",
  "summary": "An editor's letter from Don expressing sympathy for Dr. Ronald J. Baker, founding president of UPEI, who passed away. Don notes their parallel arrivals on PEI and their collaboration on institutional boards, highlighting Baker's experience from founding Simon Fraser University and BC's regional colleges system.",
  "content_preview": "Editor\n\nCharlottetown Guardian\n\n\n\n\nDear sir:\n\nI am sorry to hear of  the recent passing of Dr. Ronald J. Baker, Founding President of the University of Prince Edward Island.   \n\nWe arrived on PEI within months of each other. he was a  member of the Board of Governors of Holland College during its founding years and I sat on the University Board.  Ron brought a unique experience to our Board in that he had been intimately involved with the founding of Simon Fraser University as well as the system",
  "theme": "04-holland-college"
 },
 {
  "slug": "educ-improvement-fund",
  "title": "Educ Improvement Fund",
  "summary": "Comprehensive proposal by Don Glendenning for establishing a CFPEI Education Improvement Fund to address systemic education challenges. Document analyzes criticisms of education (accountability, cost, relevance, standards, flexibility) and identifies priority areas for improvement. Proposes endowment-based grantmaking to support education reform projects while distinguishing foundation's role from direct project implementation. Details fund governance through advisory committee and competitive grant process. Demonstrates Don's deep commitment to education quality and strategic philanthropy, likely connecting to his 18 years as Holland College's first president.",
  "content_preview": "Draft May 10, 2003\n\n\n\n\n\n\n\n\n\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nEDUCATION IMPROVEMENT FUND\n\n\n\n\nBACKGROUND:\n\n\n\n\nEducation is under considerable scrutiny and pressure to reform. Much of the criticism revolves around accountability, cost, relevance, standards and flexibility.  Some of the criticism is valid; some is not.\n\n\n\n\nProvincial governments across the country have responded in a number of ways including:\n\n\n\n\nrestructuring school boards\n\nlengthening the school day\n\nencouragin",
  "theme": "04-holland-college"
 },
 {
  "slug": "educ-or-schooling",
  "title": "Educ or schooling",
  "summary": "A comprehensive document containing multiple essays on foundational educational concepts. It includes a detailed elaboration of the schooling-education distinction using George Bernard Shaw and Bud MacDougall quotes; an analysis of \"vocational education\" arguing that medicine, law, and accounting are equally vocational as trades; discussion of the cultural divide between school expectations and workplace realities; reflections on Holland College's distinctiveness as a technical institution separate from universities; a profound statement that \"If the learner hasn't learned, the teacher hasn't taught\"; and extended discussion of the teaching-learning process, advocating learner-centered approaches. This document showcases Don's philosophical breadth and his capacity to connect educational theory to lived experience.",
  "content_preview": "Some\n\tViews\n\n\n\n\n\n\n\n\n\n\n\n\n\nGoing to School or Getting\nan Education\n\n\n\n\n\n\n\n\n\n\n\nRecently\nmy wife mentioned that a daughter of a friend had difficulty finding\nemployment, especially well paid employment.  This puzzled my wife\nand she added that the young lady in question” had a good\neducation”.  I asked “How do you know?”  My wife replied, “She\nhas a master’s degree from…” and she named a university.  “That\ntells me about her schooling,” I said, “but how do you know that\nshe has a good education?”  \n",
  "theme": "04-holland-college"
 },
 {
  "slug": "education-reaching-for-a",
  "title": "Education-Reaching For A",
  "summary": "A persuasive proposal authored by Don arguing for supplemental instruction to help high school graduates improve their grades. Drawing on his experience with Holland College's year-round Secretarial Arts program, Don advocates for offering additional instruction days to students who earned B grades or lower, enabling them to achieve A-level performance. He contrasts schools' time-fixed approach with real-world standards where quality is paramount. The proposal addresses the Community Foundation's Better Education Fund and seeks financial support for a pilot project. This document exemplifies Don's pragmatic approach to educational reform grounded in his institutional experience.",
  "content_preview": "Reaching for an “A” \n\n\n\n\nSchools operate for a set number of days each year and students are encouraged to learn as much as they can in the time available.  In the world they are about to enter, the reverse holds true; standards are set with time to reach the standard being the variable.  \n\n\n\n\nCan you imagine a patient being turfed out of a hospital because the standard recovery time was exceeded?  Or having your car returned with only three of the four brake pads replaced because the mechanic h",
  "theme": "04-holland-college"
 },
 {
  "slug": "findings-and-conclusions-3",
  "title": "Findings and conclusions 3",
  "summary": "November 2024 conclusions on PEI education system written by Don after extensive reading and conversations. Key findings: PEI has a school system not education system; Department of Education lacks education definition; government confuses curriculum delivery with helping people learn; needs increased transparency and collaboration. Document shows Don remained actively engaged with education analysis until end of life, addressing persistent systemic issues from his perspective as founding Holland College president.",
  "content_preview": "About Education\n\nGlendenning notes\n\nFINDINGS AND CONCLUSIONS – 3\n\n\n\n\nBased on my reading and conversations, PEI;\n\n  \nHas a school system rather than an education system\n  \nHas a Department of Education without a definition of education\n  \nHas both education and lifelong learning in its title thereby suggesting that lifelong learning is not  part of education\n  \nSees it’s role as one of delivering curriculum rather than helping others learn\n  \nSeems to confuse education with going to school\n  \nSe",
  "theme": "04-holland-college"
 },
 {
  "slug": "gap-dm",
  "title": "Gap DM",
  "summary": "Strategic memo to Department of Education officials (Cameron and Wilson) detailing findings on the basic skills gap, including duplication between high school and Holland College ABE programs. Don notes that the province is \"paying twice for the same service\" and suggests a review of secondary-to-postsecondary transitions. Proposes bringing stakeholders together to address coordination issues between government departments.",
  "content_preview": "1-3-2-A\n\n\n\n\n\n\nBasic\nEducation\n\nLetter\nCameron and Wilson\n\n\n\n\n\n\nIn\nlate 2013, The Community Foundation of Prince Edward Island (CFPEI)\nundertook a survey of over 200 Island youth to identify issues that\ndirectly affect them; the report, Taking\nthe Pulse of Island Youth,\navailable on the Foundation’s\nwebsite at www.cfpei.ca,\nprovides a snapshot of the findings.  On\nthe subject of education and learning, young people expressed\nconcerns about their readiness for the next stage of life including\nthe ",
  "theme": "04-holland-college"
 },
 {
  "slug": "governance-autonomy-performance",
  "title": "Governance Autonomy & performance",
  "summary": "\"Enabling Change in Education\" - Don's newsletter piece analyzing the PEI Commission on School Governance report. Argues directly for school board autonomy based on OECD research showing positive correlation between autonomy and student performance. Advocates delegating operational responsibility to schools, with authority over hiring, budgeting, curriculum, and assessment. Cites Ron Renchler's ERIC Digest on new governance patterns. Concludes each school board should operate with autonomy similar to private schools while accommodating all learners. Shows Don's active engagement in PEI education policy discussions.\n- **Key People**: Don Glendenning (author/editor); Ron Renchler; OECD\n- **Key Organizations**: PEI Commission on School Governance, ERIC Digest, OECD\n- **Tags**: PROFESSIONAL, EDUCATION, HOLLAND_COLLEGE, COMMUNITY\n- **Eulogy Relevance**: HIGH - Demonstrates Don's continued leadership in education policy after Holland College presidency, engagement with provincial governance issues",
  "content_preview": "Enabling Change\n\nIn education\n\nMay 1, 2012\t\t\t\t\t\t\t\t\t\t\t    No. 1\n\n\n\n\nRestructuring the School System\n\n\n\n\nThe recent report of the PEI Commission  on School Governance recommended  that much of the operational responsibility for schools be delegated to school Boards.  There are sound reasons for that recommendation.  Simply stated, there is a direct relationship between school performance and school autonomy.  In the words of the OECD Report (1911):\n\n  \n“In countries where schools have greater auto",
  "theme": "04-holland-college"
 },
 {
  "slug": "governance-presentation-on-governance",
  "title": "Governance Presentation on Governance",
  "summary": "Notes for presentation to PEI Education Governance Commission reflecting on Holland College governance model relevance to public schools. Opens with concern about imprecise language—commission uses \"education,\" \"education system,\" and \"school system\" interchangeably while excluding colleges, universities, private schools, faith schools, early childhood, business training. Don cautions against oversimplified \"partnerships\" concept; school leadership involves delegation but not partnership between minister, trustees, teachers, or students. Advocates for professional teacher partnerships instead. Draws directly on Holland College experience: 1969 planning committee chose Board of Governors over provincial management model (unlike most Atlantic sister institutions). After 40 years, Don concludes College \"would have been quite a different institution\" with provincial model—demonstrates governance model importance. Emphasizes key to improvement is learner-teacher interaction quality; every recommendation should ask \"How will this improve learner experience? How do I know?\" Advocates for clear written operating principles. Recommends Alberta's diversity model (private schools, teacher-led schools like Palmer Park Detroit, charter schools, Crown corporation, unique models) as examples. Proposes considering Board of Governors model for public schools. Concludes with Ainley-McKenzie research on governance.",
  "content_preview": "Notes for a\n\nPresentation to the \n\nPEI EDUCATION GOVERNANCE COMMISSION\n\n\n\n\n  \nOpening comments\n\n\n\n\n\n  \nMy reading of the discussion paper left me somewhat unclear as to the precise focus of the study.  Just because I am confused doesn’t mean that others are confused, however, I believe in something as important as this clarity is important  Commission documents use the term education, education system and school system as though they were one and the same. On examination, however there was no me",
  "theme": "04-holland-college"
 },
 {
  "slug": "grades-and-grading",
  "title": "Grades and grading",
  "summary": "Detailed analysis of assessment, grading, and ranking in education systems. Don distinguishes assessment (feedback-focused) from grading (standardized achievement measurement). Notes that most developed countries except US and Canada separate teaching and grading functions. Proposes that grades should reflect competency achievement, inform students and parents, represent individual achievement, and motivate improvement. Emphasizes that grading standards should vary by competency and purpose. Argues that ranking is not an education function and that established qualification authorities (like those in other developed nations) better communicate education results. Reflects his experience with Holland College's competency-based education systems.",
  "content_preview": "Grades and grading-1\n\nD-22-\n\nAssessment, sometimes called analyses and feedback, is at the heart of teaching and learning and involves the give and take between teacher and learner about what happened or should happen during the learning process; assessment focuses on learning, teaching, outcomes, competencies, skills or even the acquisition of knowledge. Assessment results are useful to both learner and teacher as they reflect on their next steps\n\n\n\n\nGrades and grading, on the other hand, ar an",
  "theme": "04-holland-college"
 },
 {
  "slug": "guide-1c",
  "title": "Guide 1C",
  "summary": "Learning activities section of the Time Management Competency guide, providing 11 optional activities for skill development. Activities progress from self-assessment (estimate time, keep time logs) through exploration (identify time management techniques and time wasters) to application and reflection (practice techniques, create schedules, interview efficient people). Demonstrates Holland College's learner-centered approach allowing flexible, individualized learning pathways while maintaining competency standards.",
  "content_preview": "LEARNING ACTIVITIES \n\nApply Time Management Techniques \n\nThe following learning activities are intended to assist you in the development \n\nof the above mentioned skill. \n\nThey are suggested activities only. You may wish to undertake alternative \n\nlearning activities. If so, you should consult the Resource Person listed at the \n\nend of this Learning Guide. \n\nEstimate the time required to complete this skill. \n\nEstimate the time required to complete other tasks you are \n\nundertaking. \n\nMaintain a ",
  "theme": "04-holland-college"
 },
 {
  "slug": "holland-college",
  "title": "Holland College",
  "summary": "Glendenning documents key decisions and practices at Holland College, including documentation systems, learning models, curriculum development, rating scales, in-service training, advisory committees, and self-rating protocols. Reflects his administrative innovations at the institution including biweekly rating reviews, community engagement through newsletters, and professional development initiatives.",
  "content_preview": "About Education\n\nGlendenning\n\n\nKey\ndecisions\n\n\nAT\nHOLLAND COLLEGE\n\n\n\n\n\n\n\n5/binder\n5\n\nDocumentation\n\n\t\n\n\n\tLearning\n\tmodel\n\t\n\n\n\tCurriculum\n\tdevelopment\n\t\n\n\n\tCurriculum\n\tmaps\n\t\n\n\n\tLearning\n\tguides\n\t\n\n\n\tRating\n\tscale\n\t\n\n\n\tIN\n\tStep brochure\n\n\n\n\n\n\n\nEvents:\n\n\t\n\n\n\tIn-service\n\ttraining days\n\t\n\n\n\tCVA\n\tattendance\n\t\n\n\n\tBiweekly\n\trating review by Registrar\n\t\n\n\n\tEnd\n\tof day coffees\n\t\n\n\n\tOccasional\n\tnewsletter\n\t\n\n\n\tIn\n\tresidence sessions\n\t\n\n\n\t\n\n\nOther:\n\n\t\n\n\n\tAdvisory\n\tcommittees\n\t\n\n\n\tSelf\n\trating\n\t\n\n\n\tFrequent",
  "theme": "04-holland-college"
 },
 {
  "slug": "intro",
  "title": "Intro",
  "summary": "Introduction by Don Glendenning to \"The Glendenning Letters\" (April 15, 2014) describing his educational background as a \"sandwich education\" spanning 20 years with alternating layers of study and teaching, supplemented by summer schools. He details his career progression through elementary, secondary, and principal roles, teacher training, and federal government positions before becoming founding president of Holland College. Don explains his choice to write letters to editors rather than academic journals, believing systemic education change comes from citizen and parent pressure rather than internal system reform. He collected 62 published letters and notes many unpublished drafts. The introduction emphasizes public discourse over traditional academic publishing as his contribution to education debate.",
  "content_preview": "Dear Reader:\n\n\n\n\nThe Glendenning Letters\n\n\n\n\nMine was a sandwich education spread over 20 years after high school graduation. A layer of\n\nStudy, perhaps a year or two, followed by a layer of teaching, then another layer of study and so\n\non, all seasoned with endless summer schools. As a result, I ended up with experience as a\n\nteacher in both the elementary and secondary levels, a principal, six years a teacher\n\ntrainer and the same as a training specialist with the Federal government. During th",
  "theme": "04-holland-college"
 },
 {
  "slug": "inverting-the-pyramid",
  "title": "Inverting the pyramid",
  "summary": "A slightly revised version of Don's inverted pyramid essay, adding context about his observations in England comparing US and UK educational structures. Don details his role during Canada's 1960s technical and vocational expansion, describing how this led to critical decisions at Holland College. The refined version emphasizes that his analysis identified two variables—organization of knowledge versus learning experience—that don't produce identical pyramids. He maintains the inverted pyramid advantages: leveraging student interests, reducing first-year dropout, and providing employment skills. The essay concludes educators should offer both approaches.",
  "content_preview": "INVERTING THE PYRAMID\t402\n\n\n\n\n\n\n\nYears ago, while studying in England, I recall discussions about the education system in the UK versus that in the North America.  The consensus then, and that was many years ago, was that schooling in the USA provided a broad base that narrowed as  the student progressed through  first, second and third degrees.  UK students, on the other hand, started with a narrower base that broadened with later studies.  Consensus at the time was that both were roughly equiv",
  "theme": "04-holland-college"
 },
 {
  "slug": "irving-challenge-letter",
  "title": "Irving Challenge letter",
  "summary": "March 2008 solicitation letter from Don Glendenning to Robert Irving (Irving Group, Moncton) seeking $500K to fund Community Challenge Initiative. Personal opening references 20-year relationship from Holland College days, establishing trust and shared values. Details CFPEI accomplishments: $1M+ endowment in 40 funds, $150K anonymous donor grants to 60 charities, $800K arts project, scholarship programs, and Summer Islanders outreach. Proposes new matching-grant model with enhanced 1:3 donor leverage ratio targeting $2M in community endowments within five years. Showcases Don's networking, fundraising acumen, and ability to mobilize substantial resources for community development.",
  "content_preview": "March 31, 2008\n\n\n\n\nMr. Robert Irving, President\n\nIrving Group – Moncton\n\n100 Midland Drive\n\nDieppe, NB\tE1A 6X4\n\n\n\n\nDear Mr. Irving:\n\nCommunity Challenge Initiative\n\n\n\n\nFirst a personal greeting; although it is more than 20 years since we met at Holland College, I still recall and treasure that association.  Since then, I have been closely associated with the Community Foundation of Prince Edward Island and it is in that connection that I write.\n\n\n\n\nFirst a brief background on the Foundation.  Th",
  "theme": "04-holland-college"
 },
 {
  "slug": "jamieson",
  "title": "Jamieson",
  "summary": "Don nominates Howard Jamieson for an honorary degree from UPEI, emphasizing Jamieson's critical role in managing Holland College's 1976 expansion when adult education programs transferred to the college. Don credits Jamieson's expertise and integrity as central to the successful integration of diverse programs and facilities, illustrating key institutional transformations during Don's tenure.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown, PEI\n\nC1A 3A9\n\nOctober 1, 2018\n\n\n\n\n\n\n\nTo Whom it May Concern:\n\n\n\n\nHoward (Howie) Jamieson\n\n\n\n\nI am pleased to support the nomination of Howie Jamison for an Honourary Degree from the University of Prince Edward Island. \n\n\n\n\nWhile I am aware of his efforts in support of a single university, his leadership in student affairs at UPEI and his identification as a “comer” in his work with the PEI Government, I will focus my comments on the critical role he playe",
  "theme": "04-holland-college"
 },
 {
  "slug": "journalism",
  "title": "Journalism",
  "summary": "Press release announcing $400 journalism award sponsored by Education 20/20 for articles about education. Targets Holland College and UPEI journalism students, encouraging coverage of post-secondary education challenges including pandemic impacts, funding issues, and delivery model changes. Demonstrates Glendenning's commitment to public discourse and media engagement on education. Award deadline November 15, 2021. Shows his belief in journalism's role in public education advocacy and his investment in next-generation communicators on education issues.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAWARD FOR JOURNALISM\n\n\nJournalists are invited to write about\neducation.  Students enrolled in the journalism program at Holland\nCollege and UPEI are invited to submit copies of their published\narticles for consideration. The award, valued at $400,  is sponsored\nby Education 2020 Inc., an education group active in Prince Edward\nIsland.  \n\n\n\n\n\n\n\n\n\nEducation is an important com",
  "theme": "04-holland-college"
 },
 {
  "slug": "learning-partnership",
  "title": "Learning partnership",
  "summary": "(160-200 words):** This document is a PEI press release from November 2015 titled \"Learning as a Pillar to Prosperity,\" announcing a provincial learning partnership initiative. The document reformats and reprints an official government press release promoting education as central to economic and social development in Prince Edward Island. The initiative emphasizes collaborative approaches to learning across educational institutions and government bodies. While dated after Don's primary professional period, it reflects the ongoing institutional and policy context in which Holland College operates. The partnership approach aligns with values Don likely championed—viewing education as transformative for individuals and communities. The document demonstrates how PEI continues to position education and institutions like Holland College as key to provincial prosperity and development.",
  "content_preview": "PEI Learning Partnership\n\nReformatted and reprinted\n\nPEI Press release\n\nNovember, 2015\n\nLEARNING AS A \n\nPILLAR TO PROSPERITY \n\n\n\n\nNovember 2015 \n\nPrince Edward Island will position learning as the pillar to advance prosperity and quality of life for all. We will engage Islanders in all aspects of learning and education. Together, we will ensure that all partners are focused on achieving the same goal: for our learners to achieve excellence. \n\n\n\n\nLEARNING ON PRINCE EDWARD ISLAND \n\nLearning is a l",
  "theme": "04-holland-college"
 },
 {
  "slug": "levels-8",
  "title": "Levels-8",
  "summary": "This Education 20/20 Inc. document proposes a competency-based curriculum map in mathematics, building on findings from the 2013 Community Foundation of Prince Edward Island survey of Island youth. The CFPEI report identified bright spots (community sense, entrepreneurship, volunteerism, postsecondary offerings) and concerns (job scarcity, low wages, educational deficiencies, substance abuse). Youth expressed preparedness gaps for postsecondary study and employment. Education 20/20 organized discussions and identified a need to clarify preparation gaps. The organization has focused on \"basic skills\"—foundational competencies for all citizens—and noted they lack consistent definition and priority. Don discovered a competency-based analysis of Practical Mathematics from Holland College and proposes using DACUM methodology to develop a mathematics curriculum map serving teachers, students, curriculum developers, employers, and credentialing bodies, with an externally-referenced rating scale.",
  "content_preview": "About-levels\n\nEducation\n20/20 Inc.\n\nCurriculum\nmap-mathematics\n\nIntroduction:\n\nIn\nlate 2013, The Community Foundation of Prince Edward Island (CFPEI)\nundertook a survey of over 200 Island youth to identify issues that\ndirectly affect them; the report, Taking\nthe Pulse of Island Youth,\navailable on the Foundation’s\nwebsite at www.cfpei.ca,\nprovides a snapshot of the findings.  Bright\nspots include a positive sense of community, emerging entrepreneurial\nspirit, volunteerism and new postsecondary o",
  "theme": "04-holland-college"
 },
 {
  "slug": "literacy",
  "title": "Literacy",
  "summary": "Extensive document providing literacy definition (\"ability to understand and use printed information at home, at work, community to achieve goals and develop knowledge and potential\"), components (prose, document, numeracy, oral communication, computer skills, working relationships), and assessment criteria (phonemic awareness, fluency, vocabulary, reading comprehension, rapid automatized naming). Cites PEI demographics showing 30% of adults have very low literacy rates, average adult literacy below level 3, and 43% of Islanders unable to manage newspapers/telephone books. Identifies issues: continuity of funding, divided jurisdictions, lack of specialized diagnosis, stigma attached to \"literacy,\" insufficient help for parents, inconsistent reporting/standards. Proposes \"modest proposal\" including: commending Department's reading emphasis, identifying reading as separate subject, ensuring qualified reading teacher per school, sharpening outcomes/standards, establishing reading clinic outside schools, supplementing library staff for tutoring, establishing public membership-driven reading association. Surveys current PEI providers: School system, Holland College (estimated 90% of adult literacy training), Department of Technology and Advanced Education, PEI Literacy Alliance (30 institutional members), and lists 25 other participant organizations. Includes detailed reading assessment criteria, skills lists, literacy benchmarks (Level 3 = reading daily newspaper and conversing about articles), and project implementation guidance with 10 considerations including clear focus, measurable objectives, family support, competency clarity, documentation, 3-5 year timeframe, evaluation, partnerships, minimal bureaucracy, decision-making authority, replicability.",
  "content_preview": "MY 200 WORDS\n\n\n\n\n\n\n\n\nLiteracy\n\n\n\n\n\n\nDid\nyou know that thirty\npercent of\nIslanders have low levels of literacy? That means that many Islanders\nwould have great difficulty in finding jobs in many fields especially\nemerging ones.  Worse still, the rate has not improved in the past\ndecade.    \n\n\n \n\n\nPeople\nthink of literacy as the ability to read; it is that, but it is much\nmore.  At least by some definitions, literacy includes the ability to\nuse numbers, solve problems, communicate orally, use a co",
  "theme": "04-holland-college"
 },
 {
  "slug": "lternatives",
  "title": "lternatives",
  "summary": "Comprehensive list of proposed educational reforms including competency-based education, learning guides vs. lesson plans, school autonomy, restructured department roles, and community education initiatives. Demonstrates Glendenning's systematic vision for transforming PEI's education system beyond traditional schooling models.",
  "content_preview": "About Education\n\nGlendenning notes\n\nBRANCHES/FIELDS\n\nCompare duaion wih at d:\n\n  \nHealth\n  \nJustice\n\n\n\n\n\n  \nDirectors of services rather \n  \nIncrease school autonomy\n  \nPublish:\n\n\n  \nLearning model\n  \nPublic curriculum development models\n  \nLearning guides rather than lesson plans\n  \nPlanning document\n\n\n  \nFamily advisors equivalent to family doctors\n  \nCompetencies rather than outcomes\n  \nCompetency based reporting\n  \nArea  Directors\n  \nSouris experience\n  \nCommunity education centres\n  \nBetter",
  "theme": "04-holland-college"
 },
 {
  "slug": "macdonald-brothers-notes",
  "title": "MacDonald Brothers Notes",
  "summary": "Working notes on Donald and David MacDonald of Kinross, PEI, including biographical details (both over 90, David lost eye in WW2, farmed). Includes a formal letter Don sent November 22, 2007, introducing himself as first President of Holland College and volunteer at CFPEI, offering to discuss charitable giving opportunities without obligation. Shows Don's direct outreach approach and personal introduction strategy.",
  "content_preview": "INACTIVE\n\n\n\n\n\n\n\n1\tMacdonald, David and Donald, brothers, \n\nKinross  PEI\tC0A 2E0\tCivic 3051\tPh.651 2532\n\nDonald farmed, David Lost eye in WW2\n\nProbably both over 90\n\nNext door neighbour looks after them – originally from Nfld, Channel?\n\nLand farmed by Vos\n\nTurn left beyond Orwell and they live on right\n\nSpoke with Wilbur MacDonald on Nov 16, 2007\n\nLetter and visit\n\nWonder about interest in renovating Stanley Barn, scholarship for students from area, \n\nLetter  sent Nov 22, 2007\n\nCalled to make app",
  "theme": "04-holland-college"
 },
 {
  "slug": "macmillan",
  "title": "MacMillan",
  "summary": "A nomination letter supporting Dr. Brian Macmillan for the Order of Canada, highlighting his leadership as president of Holland College and his initiatives in cultural programming including partnerships with Confederation Centre of the Arts and the Florence Simmons Performing Arts Centre. This document illustrates how Don championed his successor's achievements.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown, PE  \n\nC1A 3A9\n\n\n\n\n\n\n\nDr.Jordan Cicalo, Analyst\n\nOffice of the Secretary to the Governor General \n\n1 Sussex Drive, Ottawa\n\n\n\n\nDear Sir:\n\n\n\n\nI am pleased to provide a letter of support for the nomination of Dr. Brian Macmillan to the Order of Canada.\n\n\n\n\nDr. MacMillan has served education in a number of capacities including the public school system in PEI, Mount Allison University and currently as President of Holland College.  It is in the latter position ",
  "theme": "04-holland-college"
 },
 {
  "slug": "mailing-list-nov-2017",
  "title": "Mailing list Nov 2017",
  "summary": "A comprehensive 2017 mailing list for the Open Education newsletter showing Don Glendenning's extensive professional network across Prince Edward Island, Canada, and beyond. The list includes 5 categorized distributions: List 1 (education professionals, administrators, directors at Holland College, UPEI, Department of Education), List 2 (additional education practitioners), List 3 (business leaders, entrepreneurs, community members), List 5 (select professionals), MLAs (provincial legislators), Municipal leaders, Off-Island contacts (including academics and media), and Media outlets. Notable contacts include Brian Glendenning (Don's son), Janet Glendenning, Roberta Glendenning, and major PEI institutions. The list demonstrates Don's role as a connector of educational stakeholders and his influence across PEI society.",
  "content_preview": "MAILING LIST\n\nNovember 6, 2017\n\n\n\n\nList 1\n\nAlaina Roach-O'Keefe (alroachokeefe@edu.pe.ca); Alan McIsaac (jamcisaac@gov.pe.ca); Alice Taylor (amt44cwt38@gmail.com); Anastasia DesRoche (coord3@ssta.org); Andrew Daggett (adaggett@montaguepei.ca); Arsenault Gilles (gxarsenault@edu.pe.ca); Barb Thompson (morellandareaelc@gmail.com); Belinda Woods (belinda@peianc.com); Bernadette Allen (ballen@thecompetencygroup.com); Bernard Gillis (bgillis@metro.creditu.net); Bill Whelan (wwhelan@upei.ca); Brenda Go",
  "theme": "04-holland-college"
 },
 {
  "slug": "map-description",
  "title": "Map description",
  "summary": "Proposal document for developing comprehensive mathematics competency mapping in PEI. Observes that every PEI educational institution teaches mathematics but most base curriculum on outcomes-based or competency-based approaches, despite appearing unique in their analysis. Claims differences in educational achievement rest primarily on two factors: range of competencies demonstrated and level of achievement per competency. Proposes establishing comprehensive competency list spanning grades and age groups, where students select or are assigned competencies with differences only in achievement levels. Documents conversations with UPEI, Holland College, Department of Education, employers, and community members showing interest in exploration. Notes similar systems practiced in Ontario and other jurisdictions through \"qualification authorities.\" Argues PEI would benefit from master competency list and matching rating scale. Proposes Education 20/20 lead development role benefiting from improved quality, reduced costs, better communication, and provincial leadership positioning.",
  "content_preview": "Transition\n\n\nCurriculum/outcome MAP\n\n\n\n\n\n\n\n\nBackground\n\n\nTo\nsome degree, every educational institution and training organization\nin PEI teaches math.; most base curriculum on a form of outcomes\n(Outcomes Based Education   Curriculum Based Outcomes and Competency\nBased Education).  All agencies seem to undertake the analysis\nprocess as though what they are doing is unique to them.  I’ve\nlooked at a number of outcomes and find that the differences are\nmostly one of level of specificity.\n\n\n\n\n\n\n\n\nFu",
  "theme": "04-holland-college"
 },
 {
  "slug": "math-map-2019",
  "title": "Math map 2019",
  "summary": "Comprehensive 2019 proposal for math skills mapping explicitly connecting to Holland College's early years approach of practitioner-based analysis. Emphasizes curriculum development should begin by asking Islanders about everyday math needs rather than subject analysis. Proposes community engagement including employer consultation for dual profiles (general citizens and employment entry-level). Budget of $14,250 reflects Don's continued advocacy for competency-based education grounded in real-world application.",
  "content_preview": "MATH FOR EVERY-DAY LIVING\n\nMathMap-2019\n\n  \n    \n      \n        \nOrganization \n      \n    \n    \n      \n        \nName \n      \n      \n        \nEducation 20/20 Inc\n        \n\n\n      \n    \n    \n      \n        \nMission / Mandate\n      \n      \n        \nA quality education for every Canadian\n      \n    \n    \n      \n        \n  Address \n      \n      \n        \n101 Kent Street, Box 624, Charlottetown, PE C1A 1M0\n      \n    \n    \n      \n        \nContact Name \n      \n      \n        \nDon Glendenning\n      \n   ",
  "theme": "04-holland-college"
 },
 {
  "slug": "meeting-1-c-notes",
  "title": "Meeting-1-c  Notes",
  "summary": "Meeting agenda and stakeholder list for Education 20/20's preparedness gap roundtable on November 25, 2013, at Birt and Associates. Don Glendenning listed as participant representing Education 20/20 Inc. Includes representatives from Department of Education, Holland College, UPEI, employers, and community organizations. Focus on brainstorming education gaps and identifying next steps for addressing youth preparedness issues. Shows Don's collaborative leadership in educational initiatives.",
  "content_preview": "1-3-2-C\n\nPreparedness\nGaps\n\nStakeholders\nMeeting-1\n\n\n\n\n\n\n\nSubject:\n \tPreparedness gaps experienced by Island youth\n\nEvent:\t\tEducation\nround table\n\nLocation:\tWednesday,\nNovember 25, 9:00 am, Board Room, Birt and Associates, \n\n\n\n2nd\nFloor, 27 Brackley Point Road\n\nPurpose:\tTo\nexplore issues facing young Islanders in their transition \n\n\n\nfrom high school to work or further study\n\n\n\n\n\n\nBackground:\tAttached\npaper on Preparedness\npublished by Education 20/20 Inc. April, 2014\n\n\n\n\n\n\nParticipants:\n\n\t\n\nDer",
  "theme": "04-holland-college"
 },
 {
  "slug": "meeting-1-minutes",
  "title": "Meeting 1 Minutes",
  "summary": "Official minutes from the November 25, 2015 stakeholder meeting chaired by Don Glendenning, attended by representatives from Holland College, UPEI, the Department of Education, employers, literacy advocates, and community members. Key discussion points: confirmation that education's purpose includes preparing citizens; acknowledgment that the \"preparedness gap\" is poorly defined, with employers identifying specific deficits in customer service, reading cursive, mathematics, and numeracy; Don's observation that no master list of required mathematics and communication skills exists; recognition that both academic and soft skills gaps exist; estimated 15-20% of young people experience the gap; discussion of systemic constraints (teacher training, class size/composition, socioeconomic factors). The meeting demonstrates Don's facilitation skills and systematic problem-framing approach.",
  "content_preview": "Preparedness-2\n\nMinutes\n\nNovember\n25, 2015\n\n\n\n\n\n\n\nParticipants:\n\n\n\tAmanda\n\tBeazley, PEI Literacy Alliance, ED \n\t\n\t\n\n\tDerek\n\tMcEwen – Department of  Education, \n\t\n\t\n\n\tDon\n\tGlendenning, Education 20/20 Inc., \n\t\n\t\n\n\tElizabeth\n\tCosta-Department of Education, \n\t\n\t\n\n\tJeniene\n\tPeake, community member\n\t\n\n\tUqing\n\tGong, UPEI \n\t\n\t\n\n\tRoger\n\tBirt, Employer\n\t\n\n\tShelly\n\tBradley – Holland College*\n\t\n\n\tSteve\n\tMcQuaid, President, CFPEI\n\t\n\n\tTerri\n\tMacAdam, ELSB \n\t\n\t\n\n\tTom\n\tDavies, CFPEI Director  \n\t\n\t\n\n\tTom\n\tWhite",
  "theme": "04-holland-college"
 },
 {
  "slug": "minutes-consolidated",
  "title": "Minutes-consolidated",
  "summary": "Comprehensive minutes from Education 20/20 Inc.'s Fourth Annual Meeting held June 15, 2016 at Haviland Club, with Dr. Glendenning presiding. Present were Amber Jadis, Maureen Kerr, Anne Miller, and Alice Taylor. Dr. Glendenning welcomed new members and distributed the agenda. President's report highlighted comfort with newsletter authorship, ongoing \"Bridging the Gap\" initiative, awards to Prince Street School, and new award direction recognizing educational opportunities in communities. Discussion covered expanding membership, leveraging social media, partnering with Canadian Parents for French for translation services, updating website with Holland College computer science students. Board composition and organizational effectiveness were discussed, with suggestions to establish learning partnerships. Meeting was prorogued and reconvened June 28 for budget and officer elections.",
  "content_preview": "EDUCATION 20/20 INC.\n\n                                                              Fourth Annual Meeting\n\n                                                   Wednesday, June 15, 2016 at 4:00 pm\n\n                                                 Haviland Club, 2 Haviland Street, Charlottetown\n\n\n\n\nPresent:  Amber Jadis, Maureen Kerr, Anne Miller, Alice Taylor Dr. Glendenning\n\nRegrets:  Bill Whelan, Tom Hassler-White, Tanya Craig, \n\n\n\n\nAGENDA:     \n\n  \n Call to Order:   \n\n\n     Meeting called to ord",
  "theme": "04-holland-college"
 },
 {
  "slug": "mtg-1-board-minutes",
  "title": "Mtg 1 Board minutes",
  "summary": "Executive board minutes for Education 20/20 Inc. (formerly Education First Canada Inc.) showing Don Glendenning's leadership role. Documents organizational initiatives including name change, awards program development, and public panel on early childhood education featuring Don in opening remarks. Reflects his continued professional engagement and educational advocacy after retirement from Holland College.",
  "content_preview": "Education First Canada Inc\n\nExecutive Meeting, November 08, 2012\n\nCanadian Red Cross Board Room\n\nTime: 9;30 to 11:00 am\n\n\n\n\nMinutes\n\n\n\n\nPresent:\tAlice Taylor\n\n\t\tDon Glendenning\n\n\t\tEileen Conway-Martin –(Absent but consulted immediately before and after)\n\nBusiness:\t\n\n  \nFunction on December 4 to be held at Haviland House, 2 Haviland St., Charlottetown on Tuesday, December 4 at 7:00 pm.  (Revised program attached).  Don to arrange for cheese tray; anticipate 25 people including participants in pas",
  "theme": "04-holland-college"
 },
 {
  "slug": "mtg-10-minutes",
  "title": "Mtg 10 Minutes",
  "summary": "Board minutes recording Don Glendenning as President leading a strategic planning discussion. Notes show the board's commitment to thinking outside traditional education models, focusing on learning not just schooling, and leveraging partnerships. Reflects Don's continued influence on educational thinking in PEI after his Holland College presidency.",
  "content_preview": "EDUCATION 20/20 INC.\n\nBoard Meeting\n\nTuesday, June 4,  2013 at 12:00 noon \n\nRoom 2L, Royalty Centre\n\nMINUTES:  Meeting No. 10\n\n\n\n\nPresent:\tAlice Taylor, Eileen Conway-Martin, Don Glendenning, :  Bernadette Allen, Bill Whelan, Owen Parkhouse and Norman Finlayson\n\n\n\n\n\n\n\nAgenda\n\n  \nCall to Order\n  \nWelcome new Directors – President welcomed the following new Directors:  Bernadette Allen, Bill Whelan, Owen Parkhouse and Norman Finlayson\n  \nMinutes of meeting No.9 –moved by Bernadette, seconded by No",
  "theme": "04-holland-college"
 },
 {
  "slug": "next-steps",
  "title": "Next steps",
  "summary": "Action plan listing twenty-nine proposed education system changes: post key definitions, clarify and post purpose, refocus Department from schools to education, update Department role, increase school autonomy, launch community education newsletter, restructure Department around functions, clarify accountabilities, document curriculum and learning models, replace lesson plans with learning guides and grades with competency profiles, identify and offer services, facilitate informal education discussions, establish education system, replace outcome-based with competency-based education, establish community education service centers, improve documentation, establish PEI education association, introduce choice, eliminate advanced degree payments, increase staff development and collaboration, reduce silos, establish advisory committees, extend community collaboration, initiate local education projects. Dated October 22, 2024.",
  "content_preview": "About\nEducation\n\nGlendenning notes\n\nPROPOSED\nCHANGES -2\n\n\t\n\nPost\n\tkey definitions\n\t\n\nClarify\n\tand post purpose\n\t\n\nRefocus\n\tDepartment from schools to education\n\t\n\nUpdate\n\trole of Department\n\t\n\nIncrease\n\tschool autonomy\n\t\n\nIssue\n\tcommunity education newsletter \n\t\n\t\n\nRestructure\n\tDepartment around education functions\n\t\n\nClarify\n\taccountabilities\n\t\n\nDocument\n\tcurriculum development model\n\t\n\nReplace\n\tlesson plans with learning guides\n\t\n\nDocument\n\tlearning model\n\t\n\nProfiles\n\tinstead of grades\n\t\n\nIden",
  "theme": "04-holland-college"
 },
 {
  "slug": "notes-3",
  "title": "Notes-3",
  "summary": "Meeting notes from March 15, 2017 at Haviland Club (Don, Larry, Jack, Mike) followed by a conference call with CVA (Canadian Vocational Association) Executive on March 16. Don documents communications from R. Lance Hogan at Eastern Illinois University and outlines early curriculum development history including models like POET, Technical Education Research Centre work, and others that informed Holland College's eventual choice of DACUM. The notes record CVA's interest in the initiative, their ability to promote via website and newsletter, and questions about Holland College's response, timing, and funding sources. This document demonstrates Don's strategic stakeholder engagement and his ability to navigate institutional relationships while maintaining project focus. His awareness of DACUM's international reach and historical context shows scholarly depth.",
  "content_preview": "DACUM: A CANADIAN ACHIEVEMENT\n\nNotes-3\n\n\n\n\nDiscussion at Haviland Club on Wednesday, March 15, 2017: Larry, Jack, Mike and Don; Missed you, Deborah:\n\n\n\n\n  \nDon shared two letters from Lance Hogan, Eastern Illinois University and mentioned that he would be joining a conference call with CVA Exec on Thursday\n  \nAgreed that, Ideally, we would like to have both CVA and Hogan as part of our activities\n  \nConfirmed that HC first developed a set of guiding principles and then went looking for a model t",
  "theme": "04-holland-college"
 },
 {
  "slug": "numeracy-proposal-2019",
  "title": "Numeracy Proposal-2019",
  "summary": "A major 2019 proposal document outlining Don's philosophy on numeracy versus mathematics. Don draws on the Scottish Department of Education and PEI's Early Numeracy Intervention Program to argue that practical application matters more than abstract mathematical theory. He proposes a \"map of numeracy skills\" and provides extensive budget details (total $13,790). This reflects Don's ongoing commitment to learner-centered, practice-based education—a philosophy consistent with his Holland College vision.",
  "content_preview": "=\n   \n\n\t\t\n           NUMERACY\nMAP-11\n\n\nProposal\n -3\n\n\n---------------------------------------------------------------------------------------------------------------------------------------\n\n\n\n\n\n\n\n\nMission/purpose of organization:\n\n\n\n\n Education 20/20 Inc. is a federally\nincorporated, independent, broad based, charitable education\norganization, located in Charlottetown, PEI and is governed by a\nvolunteer Board of Directors.  Our mission is to encourage and\nsupport a quality education for every C",
  "theme": "04-holland-college"
 },
 {
  "slug": "outcomes",
  "title": "Outcomes",
  "summary": "This comprehensive document explores Don's core educational philosophy through the lens of outcomes. He begins with foundational concepts of teaching and learning, distinguishing between schooling and education based on Good's Dictionary definitions. Don identifies six life roles as essential starting points for educational planning and criticizes the gap between parent/taxpayer expectations and professional educator priorities. He argues that clear, unambiguous, measurable outcomes are essential for effective educational planning and that outcomes should prepare graduates for life and work, not just further academic study. Don provides detailed characteristics of educational outcomes (drawn from community, observable/measurable, clear/unambiguous, performance-based assessment) and contrasts them with curriculum-based outcomes. He includes recommendations for outcome development, reporting structures, and cites John Burke's work on competency-based education.",
  "content_preview": "EDUCATION OUTCOMES\n\n\n\n\n\n\n\n\nOutcomes - what is\nexpected at a given stage along a journey\n\n\n\n\n\n\n\nWhile\ndisposing of memorabilia recently, I came across, and actually\nreread, a number of papers on education.  Most of the critical\narticles express concerns\nthat the education system cannot adequately prepare students for life\nand work in the 21st Century.\nI am concerned about that issue also.  The rereading, together with a\nscan of the internet and my own experience in the education field,\nconfirmed ",
  "theme": "04-holland-college"
 },
 {
  "slug": "outside-the-box-today",
  "title": "Outside the box today",
  "summary": "Don addresses three major challenges to educational reform. First, he advocates for continuous intake programs where students enter/exit based on achievement rather than fixed calendar periods, contrasting rigid time-based systems with outcome-based approaches like those at Holland College. He argues that staggered enrollment supports diverse learning rates and real-world employment patterns. Second, Don discusses Prior Learning Assessment (PLA), emphasizing it should be integrated into ongoing teaching rather than treated as separate gatekeeping. He warns against portfolio-heavy approaches that isolate PLA from the curriculum. Third, he proposes a \"Record of Achievement\" as an alternative to traditional transcripts—a comprehensive document recording significant skills, knowledge, and attitudes demonstrated throughout schooling, addressing employer expectations beyond university entrance requirements. He also outlines AQUA (Atlantic Provinces Qualification Authority) concept and includes detailed information on New Zealand's national qualifications framework and the Canadian Restructured School Plan (CRSP) model.",
  "content_preview": "Outside the Box Today\n\n\n\n\nContinuous Intake\n\n\n\n\n\n\n\nElsewhere in these my musings, I referred to the fact that education is driven by an out-dated administrative system where time on task is the constant and performance the variable.  The system focuses on groups not individuals and forces learners to begin and end studies, not based on learning progress but at the sound of a bell.  Teachers are required to fashion their teaching to fit available time rather than the system accommodating the need",
  "theme": "04-holland-college"
 },
 {
  "slug": "overhaul-1",
  "title": "Overhaul -1-",
  "summary": "Comprehensive system reform proposal emphasizing conceptual clarity, distinguishing between education and schooling, and restructuring organizations around services rather than clients. Draws parallels to Holland College's autonomy and accountability model as a Canadian best practice for community colleges.",
  "content_preview": "About\nEducation\n\nGlendenning Notes\n\nOVERHAUL-1\n\nINTRODUCTION\n\n\n\n\n\n\nEducation\nis complex; information plays a key role.  Learners have different\ninterests, experiences, capabilities and needs; they also fill a\nvariety of life roles. Those who teach, or otherwise serve learners,\nmust be very clear in their communication. Conceptual clarity\nheightens our understanding of key words and concepts; lack of\nclarity is a significant issue for public education. Lack of clarity\ncould signal conflicting ide",
  "theme": "04-holland-college"
 },
 {
  "slug": "press-before",
  "title": "Press- before",
  "summary": "Pre-event press release announcing the October 21, 2013 Education 20/20 workshop on learning. Dr. Don Glendenning, President Emeritus of Holland College, was to chair the session featuring Alice Taylor, Eileen Conway-Martin (Native Council of PEI), and Brenda Goodine (Holland College). Includes comprehensive organization mandate and educational beliefs emphasizing learner-centered, outcomes-based education.",
  "content_preview": "Press\nRelease  \n\n\n\n\n\n\n\n\n\n \n\n\n\nWorkshop\non Learning\n\n\nA\nframework for making decisions about learning will be the subject of\na workshop on October 21.  The workshop, sponsored by Education\n20/20, will be held at the Quality Inn in Charlottetown starting at\n7:00 p.m. and will include a presentation by Alice Taylor, PEI\npartner of Handle with Care Program, Eileen Conway-Martin,\nCommunications Director, Native council of PEI, and Brenda Goodine,\nLearning Manager, Early Childhood Education, Holland C",
  "theme": "04-holland-college"
 },
 {
  "slug": "program-c-2016-01-05t00-22-23",
  "title": "Program C  @2016-01-05T00;22;23",
  "summary": "Event program for \"Most Likely to Succeed\" screening with Education 20/20 board information and corporate/individual sponsors listed. Shows Don Glendenning as President and highlights partnerships with Holland College, UPEI, and other PEI institutions. Demonstrates his continued influence in post-Holland College era and commitment to education advocacy.",
  "content_preview": "Welcome\n\tto\n\t\n\n\t\n\n\n\t\n\t\n“Most\n\tlikely to succeed”\n\t\n\n\n\n\t\n\t\nThe\n\tfilm \n\t\n\t\nbased\n\ton a book of the same name, is produced by philanthropist Ted\n\tDintersmith documents project based learning at High Tech High in\n\tSan Diego, California.  The screening will be followed by a\n\tdiscussion led by Bill Whelan and …\n\t\n\n\n\n\t\n\t\nAbout\n\tyour host: \n\t\n\t\nEducation\n\t20/20 Inc. is an independent, not-for-profit education\n\torganization, dedicated to  serving the cause of education on PEI;\n\tits activities include a m",
  "theme": "04-holland-college"
 },
 {
  "slug": "providers",
  "title": "Providers",
  "summary": "A comprehensive catalog of literacy service providers in Prince Edward Island, detailing the four major institutional providers (school system, Holland College, Department of Technology and Advanced Education, PEI Literacy Alliance) and listing 25+ additional organizations providing literacy support. The document emphasizes that Holland College provides approximately 90% of formal adult literacy training through the PEI Labour Market Fund, while other providers offer more ad hoc, grant-dependent services. This inventory served as Don's reference for understanding the fragmented landscape he sought to coordinate.",
  "content_preview": "Current PEI Activities/offerings\n\n\n\n\nLiteracy training is provided by a variety of organizations and, as a result and each agency seems to do its own thing.  There is not a single agency tasked with either planning or implementing literacy activities; this makes the gathering of statistics almost impossible.  The major providers and funders in the literacy field are:\n\n  \nSchool system – focused on literacy training within the public school system and has a number of pilot projects under way.\n  \n",
  "theme": "04-holland-college"
 },
 {
  "slug": "purdy-2",
  "title": "PURDY -2",
  "summary": "A brief nomination letter supporting Henry Purdy, describing him as a founding member of Holland College, valued instructor, creative director of the School of Visual Arts, board member, and generous community volunteer. Don characterizes Purdy as the most creative person he knows, demonstrating the depth of their professional relationship.",
  "content_preview": "z\n\nHenry Purdy\n\n\n\n\nHenry was a Founding member of Holland College, he was highly valued instructor, energetic and creative Director of the School of Visual Arts, a member of the first Board of Governors and trusted voice of and for colleagues.   Over the years, he has given  given tirelessly of time and talent to to community activities .Henry is a widely known, respected and recognized artist and, without doubt, the most creative person I know; I am honoured to support this nomination.\n\n\n\n\nDona",
  "theme": "04-holland-college"
 },
 {
  "slug": "pyramid",
  "title": "Pyramid",
  "summary": "Don compares two curriculum models using metaphor of an inverted pyramid. He reflects on early carpentry work at Chatham Air Base (summer 1948) where employees learned through immediate immersion in real tasks, progressing from simple to complex skills. Holland College adopted this \"spiral curriculum\" approach—students begin with field-specific interest courses rather than foundational prerequisites. This inverted model capitalizes on learner interests, reduces first-year dropout rates, equips early departures with employable skills, and reflects actual work-world experience. Don contrasts this with traditional approach of loading first-year with general subjects (mathematics, physics, chemistry, communications). He argues the inverted pyramid better suits older workers who gained work experience before formal education and took courses opportunistically throughout their careers.",
  "content_preview": "Inverting the Pyramid\n\n\n\n\n\n\n\nDuring the summer of 1948, I found work as a carpenter with a company building houses at the Chatham Air Base.  I appeared at the gate about 7:30 one morning looking for work; by 8:00 o’clock I was assigned to a crew framing a new house.  A couple of days later, I was cutting rafters and shortly thereafter the foreman assigned me to fitting trim around windows and doors.\n\n\n\n\nForty years later at Holland College, we designed programs with that employment practice in m",
  "theme": "04-holland-college"
 },
 {
  "slug": "record-of-achievement",
  "title": "Record of achievement",
  "summary": "Don Glendenning's comprehensive reflection on his tenure as the first president of Holland College (1969-1987). He reflects on conditions for success, early beginnings, operations, and personal notes about the college's development. Written in 2010, this document provides insights into the college's innovative programs including the Culinary Institute of Canada and Atlantic Police Academy.",
  "content_preview": "As\nI Remember:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHolland\nCollege :\n\nViews\nand Vignettes \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald E. M. Glendenning\n\n\nCharlottetown, PEI\n\n\n2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAs\nI Remember:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHolland\nCollege: Views and Vignettes \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald E. M. Glendenning\n\n\nCharlottetown, PEI",
  "theme": "04-holland-college"
 },
 {
  "slug": "reestrructturng-june-28",
  "title": "Reestrructturng June 28",
  "summary": "Don provides extensive analysis of structural issues in the PEI education system dated June 28, 2022. Addresses terminology, purpose, structure, autonomy, accountability, standards/grading, access, assessment, and benchmarks. Reflects his lifelong expertise in education, advocating for clarity in purpose statements and citing OECD and World Bank perspectives. His analysis demonstrates continued engagement with education policy in his later years, drawing on decades of experience establishing Holland College.",
  "content_preview": "June 28, 2022\n\nRestrutuing June 28\n\nIt is widely recognized that education is a key factor in determining each citizen’s quality of life; in the same way, the collective education of our citizens will determine to a significant degree the quality of the communities in which we live. Government support is justified for two reasons, one to support personal growth and development for every citizen and (2) to ensure the common good. Educating is a complex matter made so by the fact that each person ",
  "theme": "04-holland-college"
 },
 {
  "slug": "reference-4",
  "title": "Reference 4",
  "summary": "Extensive bibliography covering school-to-work transitions, pan-Canadian education initiatives, math education reform, assessment rubrics, literacy evaluation, and education system design from international sources. Includes OECD, World Bank, Canadian Council of Ministers of Education publications, academic researchers, and education think tanks. One notable reference mentions PEI and Holland College collaboration on practical mathematics (1978), connecting to Don's Holland College presidency.",
  "content_preview": "About\nEducation\n\nGlendenning\n\nREFERENCE-\n4\n\n\n8\t\t\t\t\t\t\t\t\t\tDoc 5\n\n\n------------------------------------------------------------------------------------------------------\n\n\t\n\nTilleczek,\n\tKate and Bruce Ferguson, Transitions\n\tand Pathways from Elementary to Secondary School: A review of\n\tSelected Literature,\n\t2007, Ontario Ministry of Education\n\t\n\nBowlby,\n\tGeoff, The\n\tschool-to-work transition, Perspectives,\n\tStatistics Canada  Spring 2000-\n\t\n\nCMEC,\n\tCMEC moves forward\n\ton pan Canadian initiatives,\n\t",
  "theme": "04-holland-college"
 },
 {
  "slug": "request-for-comments",
  "title": "Request for comments",
  "summary": "Don's request letter seeking recollections from community members about St. Paul's Presbyterian Church for his church history project. Includes sample format showing how memories would be presented and provides Don's contact information in Charlottetown. Demonstrates his initiative in preserving local church history and engaging with his community.",
  "content_preview": "I’m writing a brief history of St. Paul’s, Presbyterian Church in Black River and would like to hear from you.  Tell us something that you remember – a word or two or a few paragraphs.  Send by email, by mail or even phone.  Pass the request along to others.  Send one or a number; I’ll try to include them all.\n\n\n\n\nSend them to me at:\n\n\n\n\n62 Queen Elizabeth Drice\n\nCharlottetown PEI, C1A 3A9\n\nTel:\t902-892-5859\n\nEmail: don@glendenning.net\n\n\n\n\nHere’s what they’ll look like!\n\n\n\n\nMEMORIES\n\n\n\n\nThe writ",
  "theme": "04-holland-college"
 },
 {
  "slug": "roger-hogan-1",
  "title": "Roger Hogan-1",
  "summary": "Correspondence from Don to Roger Hogan regarding DACUM's 50th birthday celebration and a potential book project about Bob Adams and the DACUM process. Don discusses Holland College's early adoption of competency-based education and invites Hogan to visit PEI to meet original practitioners. He offers to arrange a public presentation on outcome-based and competency-based education, notes the college's current status regarding DACUM implementation, and expresses his understanding that while competencies remain in use, formal DACUM analysis has been discontinued. The letter reflects Don's continued connection to educational reform networks and institutional memory.",
  "content_preview": "Dear Lance:\n\nThanks for your follow up letter; I have been reminiscing with some colleagues and put pen to paper, so expect to keep my promise to send some notes.  In the meantime, I’ll mail a copy of a book on Holland College published in 2008.\n\nA number of interests appear to be converging; let me share some thoughts:\n\n  \nDACUM will soon be celebrating a 50th birthday.  We are planning to purchase a copy of your book, DACUM: The Seminal Book, to present to Holland College in Bob’s memory. \n  \n",
  "theme": "04-holland-college"
 },
 {
  "slug": "rreading-shrt-r",
  "title": "RReading shrt r",
  "summary": "Short letter to editor by Don on evolving teacher roles. References discussion from early Holland College days about teachers as either \"Sage on the Stage\" or \"Guide on the Side,\" noting contemporary pedagogy has added \"Meddler-in-the-Middle\" role. Brief reflection on changing educational pedagogy and innovation in teaching approaches.",
  "content_preview": "Dear Editor:\n\nTeacher roles updated\n\nTeacher roles are changing. Early Holland College members may recall discussions about the role of teachers of the era as either a “Sage on the Stage” or  “A Guide on the Side”.  Today I learned the role has been updated to include a “Meddler-in-the-Middle”.\n\nAccording to the article, “the teacher in the middle doesn’t need to stand at the front of the class to impart their wisdom, and students don’t come to class just to listen.” Also, by the way, student  “",
  "theme": "04-holland-college"
 },
 {
  "slug": "school-autonomy",
  "title": "School Autonomy",
  "summary": "Research-based analysis of the relationship between school autonomy and student performance, citing OECD's PISA in Focus report. Documents that schools with greater autonomy over curriculum, assessment, resource allocation, and hiring show better performance when combined with public accountability. Autonomy variations include control over resources, staffing, budgets, and curricula. This reflects progressive educational leadership philosophy emphasizing institutional freedom and accountability—central to Glendenning's approach at Holland College.",
  "content_preview": "School\n\tAutonomy and performance\t\n\t\nAn OECD report,\n\tPisa in Focus, shows a direct link between PISA test results and\n\tschool autonomy;   Citation \n\t\n\t\n\n\n\n\t\n\t\nSimply stated,\n\tthere is a direct relationship between school performance and school\n\tautonomy.  In the words of the OECD Report:\n\t\n\t\t\n\n\n\t\t“In countries where schools have\n\t\tgreater autonomy over what is taught and how students \n\t\t\n\t\n\t\n\n\tare assessed, students tend to perform better. \n\t\n\t\n\t\t\n\n\n\t\tIn countries where schools account\n\t\tfor the",
  "theme": "04-holland-college"
 },
 {
  "slug": "school-governance",
  "title": "School Governance",
  "summary": "Reflective essay by Don on organizational governance, drawing from a university assignment decades earlier to read Kant and develop an organization chart for a small university. Don notes he later used this model as basis for organizing Holland College. Reflects on how governance principles from Dr. Gibson's class still apply to questions about PEI's public education system organization. Discusses governance models at various Canadian institutions (NBIT, NSIT, SAIT) and their influence on Holland College's founding. Key anecdote revealing Don's intellectual foundations for Holland College's institutional design.",
  "content_preview": "School Governance\n\n\n\n\nThe assignment was a simple one “Read Kant and develop an organization chart for a small university”. I did as instructed, presented and defended my model, received my credit.  Ten years later I dusted off my paper and used my proposal as the basis for organizing Holland College.  Thanks Dr. Gibson.  In recent weeks, I’ve been musing about the organization of the PEI our system of public education.  From what I’ve learned about our system and remember of that long-ago class",
  "theme": "04-holland-college"
 },
 {
  "slug": "self-assessment",
  "title": "Self assessment",
  "summary": "This piece examines self-assessment as a cornerstone of effective teaching and learning. Don explains that self-assessment requires transparent processes where both assessment criteria and rating scales are known to all participants. Referencing the DACUM process and his Holland College experiences, he advocates for criteria including task completion, need for assistance, accuracy, and speed. He emphasizes that self-assessment operates on the principle that learning can be demonstrated and requires students to engage actively in evaluating their own performance under teacher guidance, creating a feedback loop essential for educational progress.",
  "content_preview": "About Education\n\nBlog\n\nSelf-Assessment\n\nBlog/1//6/5/2022\n\n\n\n\nAnalysis and feedback are at the heart of teaching and learning; they provide a basis for discussion between teacher and learner as to what was intended, what happened and “why”.  It acts as a check on the teaching -learning process and signals as to readiness for the next step. I first encountered its significance as part of the DACUM process and saw it in action within the Holland College setting. Most recently I encountered it in ar",
  "theme": "04-holland-college"
 },
 {
  "slug": "shopping-around-for-education",
  "title": "Shopping around for education",
  "summary": "Inspired by local newspaper reference to \"shopping around\" for early childhood programs, Don questions why similar choice doesn't exist in public K-12 education. He notes we freely choose churches, professionals, and merchants but lack school choice for our children and no teacher selection. Don advocates allowing parents to \"shop around\" for K-12 schooling, acknowledging implementation difficulty but affirming possibility and desirability. This brief but powerful essay positions educational choice as fundamental consumer right with precedent in early childhood and higher education. It reflects Don's consistent advocacy for expanded learner/family agency within education systems. The column is signed by Don as President Emeritus of Holland College.",
  "content_preview": "Shopping around for education\n\n\n\n\nWhen I travel I am a regular reader of local papers whether at a restaurant where we stop for lunch or where we overnight, and I have a special interest in articles about education and schooling.  Concerns for quality appear almost daily in news items, editorials and letters to the editor.\n\n\n\n\nSuggestions for improvement are almost universal, smaller classes, curriculum changes, better qualified teachers, longer school days or school years and more standardized ",
  "theme": "04-holland-college"
 },
 {
  "slug": "souris-notes-2",
  "title": "Souris Notes-2",
  "summary": "Reformatted meeting notes from August 3, 2017, serving as running record of activities. Key findings include lack of local education office, community interest in technology awareness (fisheries, marine, agriculture), career counseling, and continuing education. Notes detail technology awareness initiative to create career awareness and document advanced technology applications, including Holland College Marine Centre and Vector Aerospace tours, with training components for young people documentation and follow-up sessions.",
  "content_preview": "Souris\nNotes-2\n\nAug\n3/2017\n\nNOTES: I\ndecided to recast and reformat my notes as a running record of\nour activities\n\n\n\n\n\n\n\t\n\nPurpose\n\t– to explore possible small projects that would contribute to\n\teducation of people in the Souris area,\n\t\n\nFindings:\n\n\n\t\n\nArea lacks\n\tlocal education office to provide information and counselling.\n\t\n\nfor people not\n\tin public school system\n\t\n\nParticipants \n\texpressed  interest in activities that encourages awareness of local\n\ttechnology (fisheries, marine and agricu",
  "theme": "04-holland-college"
 },
 {
  "slug": "st-d",
  "title": "St D",
  "summary": "Detailed proposal for \"PEI Math Map\" project developed by Don as part of Education 20/20 initiatives. Analyzes gaps in mathematics competency analysis on PEI and proposes a coordinated approach involving public schools, postsecondary institutions, and SkillsPEI. Includes seven-task work plan with budget notes, reflecting Don's systematic educational reform approach. Mentions collaboration among UPEI, Holland College, and Department of Education.",
  "content_preview": "PEI\nMath Map \n\n\n\nMath\nMap 25\n\n\n\n\n\n\n\n\nPurpose:\n\n\n\n\nDevelop\na ready-reference map of math competencies needed by Islanders for\nevery day living.\n\n\n\n\n\n\n\n\nBackground\n\n\nMathematics\nis the study of the science of number, quantity and space. The Oregon\nDepartment of Education contends that math provides “a foundation\nfor the study of science and technology as well as the interpretation\nof quantitative information in other subjects. Mathematics may be\nstructured in a number of ways but structure does no",
  "theme": "04-holland-college"
 },
 {
  "slug": "standards-3-assessment-1-and-grading",
  "title": "standards 3 Assessment 1 and grading",
  "summary": "This formal paper by Don Glendenning examines the conceptual and practical problems of assessment and grading in education. Drawing on Robert Paul Wolff's 1969 framework, Don distinguishes three separate functions: criticism (feedback for learning), evaluation (establishing performance levels), and ranking (comparative assessment). He argues these functions have become dangerously conflated in educational institutions. Don proposes that grading students is fundamentally not a school function—schools should focus on teaching, while separate qualification authorities (like Holland College's partnership with the Apprenticeship Branch) should handle certification. He advocates for Canada to adopt a model separating teaching institutions from credentialing bodies, eliminating confusion between credentials and qualifications.",
  "content_preview": "About\nEducation\t\t\t\t\t\t\t\t\n\n   Assessment\nand grading\n\n\nOccasional paper No. 10\t\t\t\t\t\t\t            July 14, 2014\t\n\n\n\n\n\n\n\n\t\n\t\nDefinition\n\t saaessment, grading, purposes, kinds\n\t\nAssessment\n\tis part of the teaching\n\tprocess; teachers use the results of assessment to design and\n\timplement new teaching strategies to help learners learn\n\t\n\n\t According\n\tto Robert Paul Wolff (Wolff: A discourse on Grading, 1969) there are\n\tthree elements or kinds of grading:\n\t\n\t\t\n\n\n\t\tCriticism\n\t\twhich includes analysis and",
  "theme": "04-holland-college"
 },
 {
  "slug": "standards-3",
  "title": "Standards (3)",
  "summary": "(172 words):** Don establishes rigorous standards framework distinguishing performance standards from educational qualifications. Standards must be community-reflective, observable, credible, attainable, and measurable. Critically, standards require both criteria and hierarchical performance levels. Don uses writing assessment to demonstrate: \"time\" becomes meaningful only as segmented benchmarks (75, 100, 125 units daily) with corresponding proficiency ratings. Benchmarks anchor standards to real-world practice—reading proficiency equates to local newspaper comprehension. Don argues schools maintain artificially separate standards from workplaces, disadvantaging students by teaching to different benchmarks than they'll encounter professionally. He advocates aligning school writing standards to workplace writing standards, emphasizing consistent performance criteria across contexts. This framework influenced Holland College's outcomes-based approach and Don's systematic educational reform philosophy.",
  "content_preview": "17 – Relevant Standards\n\n\n\n\nEveryone seems to have a c~t: favourite story about school standards e pecially as they relate to reading, writing, geography, Canadian History and work habits. It has ever been thus; criticisms go back at least to the time of the Greeks but that is not to say that the issue should be 'ignored.\" Furthermore, we frequently confuse standards and certification, and probably qualifications as well.\n\nA standard is not a qualification although a qualification should be base",
  "theme": "04-holland-college"
 },
 {
  "slug": "strategic-initiatives-arts",
  "title": "Strategic Initiatives-arts",
  "summary": "This document outlines the Island Arts & Heritage Sector Prosperity (IAHSP) initiative, a 2003-launched stabilization and capacity-building program supported by CFPEI with federal and provincial funding. The program involved two phases: initial participants (six organizations, 2004) and an outreach phase (four additional organizations, 2005). The review concluded the program provided critical organizational development, noting that external assessments, workplan development, training opportunities (governance, fiscal management, planning, marketing), networking, and strategic investments (equipment, technology) strengthened organizations. The \"Looking Forward\" section recommends continuing organizational assessment as funding criteria, establishing on-Island training programs (possibly through Holland College), creating annual training for arts managers and boards, developing industry cohesion (through a PEI Arts and Culture Sector Council), strengthening government relations on arts policy, and building arts-tourism linkages.",
  "content_preview": "Letter of Interest\n\nIAHSP Booster\n\n\n\n\n1.\tBackground\n\nIn October, 2003, formal approval was given for The community Foundation of Prince Edward Island, with support from both the Federal and the Provincial governments launched a stabilization project on PEI; Fund raising from the provate secotr took place in early 2004 with the Program being formally launched in May 2004. \n\n\n\n\nThe first phase of applicants (six in total) were selected in August 2004, and in the spring 2005, applications were invi",
  "theme": "04-holland-college"
 },
 {
  "slug": "student-2",
  "title": "Student (2)",
  "summary": "(136 words):** Don articulates core learning philosophy: learning is active, individual, and lifelong. Each person determines what's learned from encounters, though initial learning often differs from teacher intentions. Don acknowledges that unlearning established patterns—especially childhood learning—proves most difficult but remains essential and possible. Using a builder's metaphor, Don illustrates education as constructing one's life foundation: quality materials and techniques chosen early matter profoundly because the structure houses us permanently. Repairs prove difficult after construction. This metaphor encapsulates Don's educational philosophy: students bear responsibility for their learning quality, teachers can only guide selection of materials and methods, and early educational choices have permanent consequences. The piece emphasizes individual agency, long-term perspective, and quality commitment—values central to his Holland College approach.",
  "content_preview": "A STUDENT’S  RESPONSIBILITY IS TO LEARN\n\n\n\n\n\n\n\nLearning is something that we do; it is not something done to us.  We determine what we learn from each new encounter in life.  Granted that many times we do not learn what a teacher intended and even the wrong kind of learning is reinforced, nevertheless, as we mature we have a responsibility to sort out what is happening and take steps to learn that which will be most interesting or useful to us.  Blaming others for our unsuccessful learning has, ",
  "theme": "04-holland-college"
 },
 {
  "slug": "teacher-certification",
  "title": "Teacher Certification",
  "summary": "(158 words):** Don separates teacher education from certification, proposing certification verify demonstrated teaching skills, not mere credentials or subject knowledge. He catalogs twelve essential teacher competencies: environment creation, student evaluation, learner diagnosis, individual planning, resource selection, stakeholder communication, professional modeling, and others. Certification should confirm satisfactory subject knowledge, teaching skills, and learning-supportive characteristics. Drawing medical field analogies, Don advocates specialized certifications—teaching elementary differs from secondary; content specialization matters. He criticizes current systems based on subjects studied rather than teaching ability demonstrated. Don insists teaching skills are demonstrable, assessment requires judgment but isn't rocket science, and teachers themselves can identify necessary competencies. This framework influenced Holland College's professional development approach and Don's persistent advocacy for merit-based rather than credential-based advancement.",
  "content_preview": "Issue No.\n\nTEACHER CERTIFICATION\t\t_______________________________________________________________________\n\nPeople confuse teacher education and teacher certification.  Both are important but they are different; they are not two sides of the same coin.  \n\n\n\n\nTeacher education is a program of studies offered by universities Certification, on the other hand, is a process of  examination to ensure a person not only has met the minimum education requirements can demonstrate an acceptable level of but",
  "theme": "04-holland-college"
 },
 {
  "slug": "teachers",
  "title": "Teachers",
  "summary": "(157 words):** Don analyzes school staffing's administrative rigidity, arguing single-teacher-per-classroom persists despite limited educational justification. He advocates differentiated staffing expanding adult contact hours through paraprofessional support, citing successful examples: the Trump Plan, Bishop Carroll School, Washington High School (which improved from bottom-ranked to third through aide expansion and 14-to-7 position conversion). Don proposes professional-titled support roles—instructors, coaches, tutors, coordinators, technologists—trained for specific responsibilities. Health-field models demonstrate effectiveness: doctors direct; nurses, therapists, technologists deliver. Education could adopt similar structures with clearly differentiated roles. Don argues this approach improves service while potentially reducing costs. He questions traditional assumptions: do schools need principals? Technologists? Corridor monitors? This vision influenced Holland College's team approach to instruction and Don's critique of rigid educational hierarchies perpetuated by administrative convenience rather than learning effectiveness.",
  "content_preview": "14-Differentiated Staffing\n\n}'\n\n\n\n\nEarly schools began with teachers, often-itinerant ones, and teaching students in any convenient location. To me, this conjures up a teacher standing or sitting under a tree while rapt students sit \"at his feet\" soaking up every word. Over time, the concept grew and a century ago the one -room country school became a mainstay of most communities. I went to one of these schools and distinctly remember listening to instruction intended for older students and, on ",
  "theme": "04-holland-college"
 },
 {
  "slug": "technicians-and-technologists",
  "title": "Technicians and Technologists",
  "summary": "(152 words):** Don analyzes technician/technologist distinctions, rejecting institutional definitions based on program length. Using Bell's laboratory evolution, he illustrates workplace progression: laborers/craftsmen provide basic assistance; technicians apply established technical knowledge within standard procedures; technologists extend technical boundaries; engineers originate concepts. Don emphasizes technicians require advanced science/mathematics knowledge and diagnostic abilities, not necessarily manual skill (varying by specialty). Technologists require broader knowledge spanning traditional engineering, business, and medical fields. Don critiques educational confusion regarding terminology, noting institutions award conflicting designations. He emphasizes occupational practice defines roles better than institutional credentials. Don's framework influenced Holland College's positioning of applied technology education grounded in workplace practice rather than institutional designation. His distinction clarifies that role definition flows from occupational requirements, not arbitrary institutional categories.",
  "content_preview": "19 – Technicians and Technologists: A New Breed of Worker\n\n\n\n\nThere are two basic approaches to sorting people when talking about the work they do\n\n\n\n\nEducators tend to define qualifications based on the nature of the institution and length of study period.  A technician is a person who studied at a technical institute usually for two years, a technologist is a graduate of a three year program at an Institute of Technology, an engineer went to a university for at least four years and perhaps eve",
  "theme": "04-holland-college"
 },
 {
  "slug": "tess",
  "title": "Tess",
  "summary": "Letter of recommendation by Donald Glendenning, C.M, PhD, LLD (UPEI), President Emeritus of Holland College, supporting Dr. Tess Miller's application for full professorship at University of Prince Edward Island. Praises Dr. Miller's dedication, work with students, expertise in mathematics, and contributions to Education 20/20 Inc. board, where she participated in continuing education surveys in Souris area. Written by Don in his capacity as respected educator and institutional leader.",
  "content_preview": "Departmental and University Review Committees.\n\nUniversity of Prince Edward Island\n\n550 University Avenue\n\nCharlottetown, PE C1A  4P3\n\nDr. Tess Miller\n\nTess\n\nI am pleased to provide a letter of support for Dr. Tess Miller in her application for full-professorship at the University of Prince Edward Island.  I’ve known Dr Miller for a number of years and am impressed with the energy, dedication and insights which she brings to any conversation.  On a number of occasions, I was able to observe her ",
  "theme": "04-holland-college"
 },
 {
  "slug": "thrive",
  "title": "Thrive",
  "summary": "Don's notes on skills students need to thrive (communication, critical thinking, leadership, creativity, self-direction, curiosity, collaboration), drawing from Gayle Allen and OECD 2030 frameworks. Reflects his engagement with contemporary competency-based education models.",
  "content_preview": "About Education\n\nGlendenning Notes\n\nTHRIVE\n\n\n\n\nSkills all students need to thrive – Gayle Allen\n\n  \nCommunication\n  \nCritical thinking\n  \nOwnership\n  \nLeadership\n  \nCreative problem, solving\n  \nSelf directed learning\n  \nCuriosity\n  \nCollaboration\n  \nHigh threshold for uncertainty\n\n\n\n\n\nNext steps (OECD 2030) – see original)\n\n  \nNational,   regional and  local governments share",
  "theme": "04-holland-college"
 },
 {
  "slug": "time-the-variable",
  "title": "Time the variable",
  "summary": "An educational essay by Don arguing that learning rates vary among students and that time rather than learning should be the constant variable. He draws on examples from his teacher training, personal observation, England, and Holland College's independent scheduling approach, advocating for individualized pacing to ensure fairness and success.",
  "content_preview": "About Education\n\nMAKE LEARNING THE CONSTANT  INFORMATION NEEDED\n\n\n\n\nWe are told that each person learns at his or her own rate. Not only did I learn that in my teacher training classes but I found it with my own children. It also came up a few days ago when talking about education with a fellow Islander.  He has kids in school; not sure the age but would guess in high school. He wondered why his children had to study the same subject at the same time as their classmates.  Grades and time-based c",
  "theme": "04-holland-college"
 },
 {
  "slug": "transcripts-record-of-achievement",
  "title": "Transcripts RECORD OF ACHIEVEMENT",
  "summary": "(168 words):** Don proposes Records of Achievement replacing traditional transcripts and degrees, providing comprehensive documentation of demonstrated competencies rather than subject grades. Current documents fail describing achievement meaningfully, emphasizing narrow subject matter while ignoring non-academic competencies important to employers and institutions. Records would document: discipline accomplishments, communication abilities, responsibility assumption, collaborative skills, technological awareness, work habits—describing demonstrated strengths rather than listing activities. Records would show growth throughout schooling and ideally extend to lifelong learning. Don acknowledges structural barriers: colleges/universities (serving only 30-35% of students) may resist; employers welcome them; supervisors understand them; personnel officers resist information complexity. The idea isn't new but deserves reconsideration. This proposal influenced Holland College's comprehensive assessment approach and Don's persistent advocacy for outcome-based documentation reflecting actual demonstrated competencies rather than institutional convenience.",
  "content_preview": "RECORD OF ACHIEVEMENT\n\n\n\n\nThere have been many calls for changes to our educational system and there have been a number of responses.  Included among these responses are the following:\n\n\n\n\nCompetency based education\n\nBack to the basics\n\nAn increase in the number of courses required for high school graduation\n\nChanges in requirements to enter College and University\n\nIntroduction of technology education, and\n\nGreater access to computers\n\n\n\n\nAn obvious area for examination has been overlooked and t",
  "theme": "04-holland-college"
 },
 {
  "slug": "tyranny-of-time",
  "title": "Tyranny of time",
  "summary": "(153 words):** Don critiques schools' time-driven organization prioritizing administrative convenience over learning needs. Fixed school calendars, instruction hours, subject timing, and class schedules ignore fundamental learning reality: individual learning rates vary significantly. Current assessment measures achievement within fixed time rather than time required for achievement—like measuring race distance covered rather than race completion time. Don advocates inverting the equation: make graduation requirements constant and time variable. Students meeting requirements graduate on schedule; those needing support continue studying until achieving graduation standards. Don proposes offering extra weeks for struggling students rather than forcing advancement regardless of readiness. He suggests this flexibility—accommodating learning-rate differences—might dramatically increase graduation rates. This philosophy influenced Holland College's continuous-intake model and Don's persistent critique of rigid time-based schedules subordinating learning reality to administrative efficiency.",
  "content_preview": "23 – THE TYRANNY OF TIME\n\n\n\n\nSchools are time based institutions.  The system sets the number of days schools are open, the number of hours of instruction each day, days to be made up because of storms, the length of time available on a subject before you must move to another, they keep attendance, time missed may result in the lowering of a grade, teacher pay scales are related to years of training and years of experience.  I can think of no other sector that is so driven by time.\n\n\n\n\nThe curri",
  "theme": "04-holland-college"
 },
 {
  "slug": "vignettes",
  "title": "Vignettes",
  "summary": "(329 words):** File 18 contains multiple philosophical essays addressing core educational issues. Schooling-education distinction emphasizes that schools contribute to but don't monopolize education; homes, communities, peers educate as well. Current conflation discourages lifelong learning and non-school learning recognition. Vocational education definition derives from learner purpose, not content: same course becomes vocational or academic based on employment intent. Cultural divide essay identifies school-work disconnects—task-switching regardless of completion, teacher-dependence, absent service mentality, outdated industrial structures, minimal student responsibility. Don proposes cultural, not curricular, solutions: individual focus, output emphasis, achievement measurement, teacher accountability, learning plans, skills emphasis, community standards. Holland College founding reflections defend the separate college approach, emphasizing quality over university-transfer convenience. His teaching principle—\"If the learner hasn't learned, the teacher hasn't taught\"—recognizes learning as individual responsibility while placing accountability on teachers. Continuous intake advocacy proposes flexible enrollment matching hospital practice: instructional time becomes variable while achievement standards remain constant. These vignettes synthesize Don's educational philosophy addressing systemic contradictions between stated goals and operational practices. He emphasizes individual learning, measurable achievement, practical relevance, teacher accountability, and system flexibility. This collection represents his mature reflection on educational fundamentals—why schools exist, what they should accomplish, and how they should operate.",
  "content_preview": "Going to School or Getting an Education \n\n\n\n\n\n\n\nEducators confuse schooling and education - and their confusion impacts on the public as well.  We do not similarly confuse health and hospitalization, religion with church attendance or citizenship with court appearances.  Why, therefore, do we continue to speak of education when we mean schooling?  I know that we have an education system and a Department of Education but I assume that bear those names because they not only operate schools but the",
  "theme": "04-holland-college"
 },
 {
  "slug": "working-with-govt",
  "title": "Working with govt",
  "summary": "Don's critical analysis of governmental constraints on education reform. He identifies problems: government complexity, competing priorities, excessive management layers, power concentration, redundant checking, risk aversion, expertise gaps, and operational weaknesses. Proposes solutions: prioritizing limited reforms, reversing negative trends through hiring, increasing transparency, and empowering leaders. Notes government's lack of competitive pressure and reluctance to relinquish power. This document reveals Don's pragmatic understanding of bureaucratic constraints he navigated during Holland College leadership.",
  "content_preview": "About Education\n\nFramework\n\nPROBLEMS OF WORKING WITH GOVERNMENT\n\n  \nComplexity pf government\n  \nGovt has MANY priories\n  \nTOO MANY LAYERS OF MANAGEMENT\n  \nConcentration of power\n  \nEndless checking and rechecking\n  \nRisk aversion\n  \nLack of current expertise\n  \nLack 0perations, system developmene, analyetics and project management\n\n\nPriorize a limited number o priorities\n\nBegin yo reverse the trend next right thing\n\nReflect new thinkin in future hires\n\nGovernmene lacks competition\n\nTransparency\n",
  "theme": "04-holland-college"
 },
 {
  "slug": "z4-education-tomorrow",
  "title": "z4 Education Tomorrow",
  "summary": "Don's strategic vision for future education systems addressing issues of access, relevance, quality, inflexibility, and affordability. He proposes learner-centered, outcomes-based, and technology-assisted systems with decentralized decision-making, external qualification authorities, and challenge-for-credit mechanisms. The outline demonstrates his comprehensive educational reform thinking and influence on institutional directions, hallmarks of his visionary leadership at Holland College.",
  "content_preview": "Education Tomorrow\n\n\n\n\nWidespread  call  for change in education , not just a single or random occurrence or event but a constant condition  - organizations need to embrace change and keep themselves ready at all time Reasons are many including Outside regulations, economics, increase choice, or client demands.  In the case of education, widespread call for change from both within and outside the profession and include:\n\n\n\n\nIsues\n\n  \nAccess\n  \nRelevance\n  \nQuality\n  \nInflexibility\n  \nAffordabili",
  "theme": "04-holland-college"
 },
 {
  "slug": "z5-education-system-today",
  "title": "z5 Education System Today",
  "summary": "Don's critical analysis of contemporary education systems, characterizing them as age-based, bureaucratic, and inflexible with obscured accountability and teacher-centered delivery. He identifies persistent systemic gaps including insufficient outcomes definition, lack of learner centeredness, limited support for independent learners, and inadequate professional autonomy. This foundational document outlines problems he spent decades addressing through Holland College and his educational reform work.",
  "content_preview": "Outline\n- 5\n\n\nMay\n10, 2013\n\n\n \n\n\n\n\n\n\n\n\nEDUCATION\nSYSTEM TODAY\n\nNOTE:\tWriter\nwould argue that we have an age based school system rather than a\nneeds based education system\n\nDefinition\n\n\n\n\t\n\n\n\tthe\n\taggregate of the public schools of an area under the administration\n\tof an executive officer who represents and is responsible to the\n\tboard of education for that establishment\n\tincluding\n\tthe plant and equipment for providing education from kindergarten\n\tthrough high school\n\t\n\n\n\tall\n\tthe schools and su",
  "theme": "04-holland-college"
 },
 {
  "slug": "zhc-lessons-learned",
  "title": "ZHC-lessons learned",
  "summary": "A comprehensive summary of lessons learned from Holland College's outcome-based educational model, documenting benefits including enhanced student retention, responsiveness to employment needs, continuous entry/exit capabilities, credit for prior learning, and high employment placement rates. The document highlights how the model increases institutional flexibility while maintaining quality and strengthens student-instructor relationships—key achievements of Don's leadership tenure.",
  "content_preview": "Lessons\n\tlearned include: \n\t\n\t\n\n\t\to\n\t\tapproach works \n\t\n\t\n\n\t\to\n\t\tnot more expensive to operate \n\t\n\t\n\n\t\to\n\t\tdollars arc spent differently\n\t\n\t\n\t\n\n\t\to\n\t\tsuccess requires institutional commitment to philosophy \n\t\n\t\n\n\t\to\n\t\thigh student retention rate \n\t\n\t\n\n\t\to\n\t\tsystem increases ability to respond promptly to requests for\n\tcustomized training \n\t\n\t\n\n\t\to\n\t\tstrengthened linkages between institution and employment community \n\t\n\t\n\n\t\to\n\t\tallows students to meet a range of career goals within the same\n\tprog",
  "theme": "04-holland-college"
 }
]