[
 {
  "slug": "00-guest-letter",
  "title": "00 Guest letter",
  "summary": "December 25, 2015 letter from Don Glendenning to Premier Wade MacLauchlan inviting him as guest to \"Most Likely to Succeed\" screening (January 17, 2016). Explains the film showcases High Tech High's project-based approach emphasizing relational skills over content mastery. Don positions the film as relevant to PEI's education system and extends formal invitation. Shows Don's willingness to engage government leadership directly in educational discourse, and his strategic choice to position film screenings as tools for civic dialogue with decision-makers.",
  "content_preview": "December\n25, 2015\n\n\t\n\n\nPremier Wade MacLauchlan\n\nPO\nBox 2000\n\nCharlottetown,\nPE\n\nC1A\n7N8\n\n\n\n\n\n\nDear\nPremier:\n\n\n\n\n\n\nAs\nyou know, our group has been promoting changes in education. \nRecently, both the New York Times and Washington Post carried\naccounts of a new film about education being unrolled across the US;\nboth papers gave the film a high rating. \n\n\n\n\n\n\n\n\nThe film, Most Likely to Succeed, was produced by\neducation philanthropist, Ted Dintersmith,  and shows a project based\napproach to educati",
  "theme": "09-community-civic"
 },
 {
  "slug": "01-09-souris-a",
  "title": "01 09 Souris-A",
  "summary": "Marketing brochure outlining CFPEI's mission and the Souris Fund endowment established in 2007. Don Glendenning appears as a Board of Directors member. The document lists ten reasons to choose community foundations, outlines investment policies (4% annual payout on 4-year rolling average), and describes fund recipients (2007-2009) including Souris High School Band, Harbourview Training Centre, Souris 4-H, and Wilmot Scholarship recipients. Demonstrates Don's leadership role in managing philanthropic assets and community partnerships during his CFPEI directorship.",
  "content_preview": "‘CONNECTING\n\tPEOPLE WHO CARE WITH CAUSES THAT MATTER”\n\t\n\n\n\n\t\n\n\n\n\n\n\tTen\n\treasons people choose community foundations.\n\t\none\n\t\nWe\n\tare a local\n\torganization with\n\tdeep roots in the community, and part of a nationwide movement whose\n\tsupport  we build and share.\n\t\ntwo\n\t\nWe\n\tbring donors to the table as community\n\tbuilders, working\n\tclosely with them to align their philanthropic vision with the\n\tcommunity’s needs.\n\t\nthree\n\t\nWe\n\tidentify long-term\n\tneeds and\n\topportunities and invest in solutions tha",
  "theme": "09-community-civic"
 },
 {
  "slug": "01-community-engagement",
  "title": "01 Community engagement",
  "summary": "Extensive proposal addressing community-school engagement as means to improve education quality. Documents communication gaps between schools and communities revealed through Education 20/20 workshops (Stratford, Montague, Summerside, Wellington, Souris, O'Leary). Proposes training facilitators to organize community discussions and engagement activities. References Vital Signs research showing parents deeply concerned about gaps. Includes detailed exploration of engagement definitions, benefits to student achievement, and implementation strategies. Proposes development of community-based engagement facilitators to complement school-initiated engagement. Discusses role of information, engagement mechanisms, and public participation in educational improvement.\n- **Key People**: None specifically named\n- **Key Organizations**: Education 20/20 Inc., Community Foundation of PEI, Department of Education and Early Childhood Development, National Parent Teacher Association (USA), OECD, UNICEF\n- **Tags**: PROFESSIONAL, EDUCATION, COMMUNITY, FOUNDATION\n- **Eulogy Relevance**: HIGH - Major comprehensive proposal showing Don's belief in community engagement as driver of educational improvement",
  "content_preview": "March 16, 2014\n\n\n\n\nProposal\non\n\nCommunity\nEngagement with Schools\n\nBACKGROUND:\n\n\t\n\nWhen\n\tfamilies, schools, and communities work together, positive results\n\thappen: 1) Student achievement improves; 2) Teacher morale rises; 3)\n\tCommunication increases among learners, teachers, parents and the\n\tcommunity at large; 4) content becomes more relevant, and 5)\n\tfeedback more meaningful. \n\t\n\t\n\nPreliminary\n\tresults from a series of community workshops organized throughout\n\tPrince Edward  by Education 20/2",
  "theme": "09-community-civic"
 },
 {
  "slug": "01-preparedness",
  "title": "01 Preparedness",
  "summary": "First published occasional paper examining youth preparedness gaps for employment and further study. References 2013 Community Foundation of PEI survey showing youth concerns about readiness for next life stages. Documents four public workshops (Stratford, Montague, Summerside, Wellington) where participants identified skills needed: communication, mathematics, problem-solving, personal management, teamwork, and technology comfort. Identifies preparedness gap-narrowing strategies including greater student engagement, parent-teacher communication, independent study habits, learning culture development, technology use, mentoring programs, and \"can-do\" school atmosphere. Makes five recommendations including further study, clearly defined graduation standards, stronger employer preparation roles, and community partnership development.",
  "content_preview": "About\neducation\t\n\n\nPreparedness\n\n\nOccasional Paper No. 1\t\t                       \n\t\t\t            April 27, 2014\n\n\n\n\t\n\n\n\t\n\t\nIntroduction:\n\t\nYouth\n\ttoday are facing many issues, including high debt load, low incomes,\n\ttemporary employment, emotional stress, lack of jobs and high\n\tunemployment; the good news is that there is growing recognition\n\tthat something needs to be done, and soon.  On the one hand, a\n\tsluggish economy reduces opportunity for employment; on the other\n\thand, young people lack ",
  "theme": "09-community-civic"
 },
 {
  "slug": "03-10-a-community-funds",
  "title": "03 10 A Community Funds",
  "summary": "Comprehensive CFPEI document listing all managed funds for East Prince region, including unrestricted funds (Eric Robinson Fund, Thomas and Katherine Upson Fund), scholarship funds (Joan Auld, Orin Carver, Lorne and Ruby Bonnell, Lowell Phillips), specialized funds (Agricultural Heritage Fund, Glendenning Family Fund, Souris Fund, Visual Arts Fund), agency funds (L.M. Montgomery Land Trust, Indian River Festival Fund), and managed funds. The \"Glendenning Family Fund\" is identified as a CFPEI community endowment. Don served as Board Director providing governance oversight during this period of foundation growth.",
  "content_preview": "‘CONNECTING\n\tPEOPLE WHO CARE WITH CAUSES THAT MATTER”\n\t\n\n\n\n\t\n\n\n\n\n\n\tFUNDS\n\t\n\n\n\n\t\n\t\nUnrestricted\n\tFunds\n\t\nEric\n\tRobinson Fund\n\t\nFund\n\t#1\n\t\nThomas\n\tand Katherine\n\t\n      Upson\n\tFund\n\t\nCommunity\n\tFund\n\t\nFoundation\n\tFund\n\t\nScholarship\n\tFunds\n\t\nJoan\n\tAuld Fund\n\t\nOrin\n\tCarver Scholarship\n\t\n      Fund\n\t\nLorne\n\tand Ruby Bonnell\n\t\n      Scholarship\n\tFund\n\t\nLowell\n\tPhillips Scholarship\n\t\n     Fund\n\t\nSummerside\n\tNatick International\n\t\n      Friendship\n\tHockey Fund\n\t\nAdmiral\n\tLouise and James C.\n\t\n     Wilmo",
  "theme": "09-community-civic"
 },
 {
  "slug": "08-math-instruction-in-pei",
  "title": "08 Math Instruction In PEI",
  "summary": "This February 2021 paper addresses fragmentation in PEI mathematics education, building on the 2013 Community Foundation youth survey identifying educational deficiencies. Don analyzes multiple math providers (public schools, postsecondary institutions, SkillsPEI, private schools, independent learners) operating without coordination or shared definitions. He argues that transition from secondary to post-secondary education depends on mathematics preparation. The paper recommends adopting competency-based outcomes, implementing universal curriculum platforms, independent assessment bodies, and user-based advisory committees. Don's analysis identifies fundamental problems: lack of agreed definitions, no coordination mechanism, inconsistent evaluation criteria, and fragmented delivery. The document reflects his systematic approach to identifying systemic barriers to educational quality.",
  "content_preview": "MATHEMATICS\nINSTRUCTION\n\nIN\nPEI\n\nOccasional\nPaper No 8 (Revised)\t\t\t\t\t\t February 16, 2021\n\n____________________________________________________________________________\n\n\n\n\n\n\nIn\nlate 2013, The Community Foundation of Prince Edward Island (CFPEI)\nundertook a survey of over 200 Island youth to identify issues that\ndirectly affected them; the report, Taking\nthe Pulse of Island Youth,\navailable on the Foundation’s\nwebsite at www.cfpei.ca,\nprovides a snapshot of the findings.  Bright\nspots include a po",
  "theme": "09-community-civic"
 },
 {
  "slug": "09-learning",
  "title": "09-Learning",
  "summary": "The November 15, 2013 ninth issue, edited by Don Glendenning, explores multifaceted support for learning. Don notes that effective support extends beyond teaching and telling to encompass information provision, instruction, resource materials, recognition, feedback, counsel, encouragement, and opportunity creation. He emphasizes that learners' ability to learn depends on physical, social, emotional, and mental wellness. The newsletter reports on the Community Foundation of Prince Edward Island's youth survey, noting high high school and postsecondary completion rates alongside concerns about job availability, low wages, educational deficiencies, and substance abuse issues. Don highlights the survey's identification of emerging entrepreneurial opportunities and volunteerism as bright spots while flagging gaps in basic education, personal skills, and employment transition support. The issue reflects Don's comprehensive understanding of educational ecosystems and commitment to addressing barriers to learning success.",
  "content_preview": "Open\nEducation\t\t\t\t\n\t\n\n\n\n\n\t09\t\t\t\t\t\t\t\t\t\t    November 15, 2013\n\t\n\n\tThe\n\ttragedy of education is that it could easily be different and better\n\tfor everyone… \n\t\n\t\n\n\teven\n\tunder current constraints -  Jerry Wilhelm\n\t\n\n\t\n\n\n\t\n\n\n\n\tSupport for learning\n\t\n.\n\t\nRecently\n\tthe question arose as to ways we support others with their learning.\n\t It is the first time I’ve ever been part of such a discussion and\n\tI found it very interesting. \n\t\n\t\n\n\n\n\t\n\t\nThe\n\tfocus was on learning, whenever and wherever it occurs.  ",
  "theme": "09-community-civic"
 },
 {
  "slug": "1-4-2-windsor-proposal-docx",
  "title": "1.4.2 windsor proposal docx",
  "summary": "Brief introduction to Windsor proposal describing Education 20/20 Inc. as federally incorporated independent, broad-based, national, not-for-profit organization located in Charlottetown, PEI with volunteer board governance. Notes vision of quality education for every Canadian and mission to support and strengthen learning culture. Describes organizational structure: ten directors, network of approximately 50 people, mailing list of 225. References attached director biographies and notes charitable status application filed with Canada Revenue Agency, with CFPEI handling funds and invoices.\n- **Key People**: Board of Directors mentioned generically\n- **Key Organizations**: Education 20/20 Inc., Community Foundation of PEI, Canada Revenue Agency\n- **Tags**: PROFESSIONAL, ADMIN, FOUNDATION\n- **Eulogy Relevance**: LOW - Organizational description document",
  "content_preview": "1-\n\nLetterhead\n\nWindsor Proposal\n\n\n\n\nEducation 20/20 Inc. was federally incorporated as an independent, broad based, national, not-for-profit education organization, located in Charlottetown, PEI and is governed by a volunteer Board of Directors.  Its vision is a quality education for every Canadian and mission is to support and strengthen a culture of learning for all Canadians.  The organization operates with ten Directors, a network of some fifty people, and a mailing list of about 225. Attac",
  "theme": "09-community-civic"
 },
 {
  "slug": "1-a-brochure",
  "title": "1-A Brochure",
  "summary": "Revision A of Education 20/20 brochure design. Three-panel brochure with repeated sections highlighting 2014 Kinkora Regional High School Excellence Award. Includes organization's seven quality education principles, vision/mission/mandate statements, and activities. Emphasizes call to action for community involvement (volunteer, spread word, ask questions, voice opinions, donate). Full organizational details with contact information.\n- **Key People**: None listed\n- **Key Organizations**: Education 20/20 Inc., Kinkora Regional High School\n- **Tags**: PROFESSIONAL, COMMUNITY\n- **Eulogy Relevance**: MEDIUM - Brochure design iteration A.",
  "content_preview": "Education\n\t20/20 Inc. \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t2014\n\tExcellence Award in education presented to \n\t\n\t\n\n\tKinkora\n\tRegional High School\n\t\n\n\t\n\n\n\t\n\t\n\n\tA\n\tA quality education system is one where:\n\t\n\t\t\n\n\n\t\tLearners\n\t\tare healthy\n\t\t\n\n\n\t\tEnvironments\n\t\tare safe and respectful\n\t\t\n\n\n\t\tContent\n\t\tis relevant \n\t\t\n\t\t\n\n\n\t\tOutcomes\n\t\tare linked to personal and community objectives\n\t\t\n\n\n\t\tSupport\n\t\tis focused on learners and learning.\n\t\t\n\n\n\t\tInformation\n\t\tand advice is timely and independent\n\t\t\n\n\n\t\tTeachers\n\t\tare pr",
  "theme": "09-community-civic"
 },
 {
  "slug": "1-educational-soft-spots",
  "title": "1 Educational Soft spots",
  "summary": "A comprehensive essay identifying gaps and shortcomings in Canada's education system, particularly in PEI. Don critiques the rigidity of outcomes-based education (OBE), lack of school autonomy, absence of student advocates, and disconnection from job qualifications. He proposes five key reforms: updating OBE, increasing school-level autonomy, separate status for early childhood development, family education advisors, and establishing a qualification authority.",
  "content_preview": "Educational soft spots\n\n\n\n\n\n\nEducation\n\n\nIt is widely recognized that education is a key factor in determining\none’s quality of life; in the same way, the collective education of\nour citizens will determine to a significant degree the future of our\ncommunity and country. Because of this, Canada is among the world\nleaders in our investment in ensuring that our citizens, especially\nour youth, have access to a variety of educational activities and\nexperiences.  Our education system developed over d",
  "theme": "09-community-civic"
 },
 {
  "slug": "1-preparedness-2014-2014-11-10t10-36-36",
  "title": "1 Preparedness 2014@2014-11-10T10;36;36",
  "summary": "An occasional paper from Education 20/20 Inc. analyzing gaps in youth preparedness for postsecondary education and employment. Based on a Community Foundation of PEI survey, Don synthesizes findings from four public workshops across the province, identifying key skill gaps and recommending systemic improvements in education delivery, student engagement, and community involvement.",
  "content_preview": "About Education\t\t\t\t\t\t\t\t\n\n\nPreparedness\n\n\nOccasional paper No. 1\t\t\t\t\t\t\t            April 27, 2014 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBasic\nskills, especially in math and communications, are on everyone’s\nlist of needs for young people finishing high school, whether going\ndirectly to work or taking further studies.  But they also should\nhave good personal management skills and a high comfort level with\ntechnology regardless of their after school plans.    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "1-special-scholarships-2007",
  "title": "1-Special-Scholarships-2007",
  "summary": "Special newsletter (March 2006) listing seven scholarships available through CFPEI, including Orin Carver, Architects Association, Phillips, Summerside-Natick Hockey, Ruby and Lorne Bonnell, and Joan Auld scholarships. Demonstrates Glendenning's commitment to removing barriers to education for talented students. Reflects the Foundation's role in supporting educational advancement across diverse fields including academics, arts, athletics, and professional training.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nSpecial No. 2\t\t\t\t\t\t        March 01, 2006\n\n\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nSCHOLARSHIPS\n\tAVAILABLE\n\t\n\n\n\n\t\n\t\nThe following\n\tscholarships are available through your Community Foundation:\n\t\n\n\n\n\t\n\t\nORIN CARVER\n\tSCHOLARSHIP – open\n\tto high a school graduates in the top 25% of the class and who\n\texhibit a level of excellence and leadership in either athletics,\n\tarts and/or community service and who are accepted into a\n\tpost-secondary program at UPEI or Holland College.\n\t\n\n\n\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "10-a-quality-education",
  "title": "10 A Quality Education",
  "summary": "The December 20, 2013 tenth issue, edited by Don Glendenning, synthesizes his thinking about quality education as preparation for life's multiple roles: individual, family member, learner, citizen, consumer, and producer. Drawing on a 2000 UNICEF report, Don defines quality education systems as having healthy, well-nourished, family-supported learners; safe, protective environments with adequate resources; relevant curricula developing literacy, numeracy, and life skills; and trained teachers using child-centered approaches in well-managed settings. The newsletter announces a January 20, 2014 workshop at Stratford Town Hall addressing youth preparedness challenges, referencing the Community Foundation's \"Taking the Pulse of Island Youth\" study. Don concludes with season's greetings expressing hope for community blessings. This issue represents a culmination of Don's themes: learner-centered education, environmental support, teacher quality, and community engagement.",
  "content_preview": "Open\nEducation\t\t\t\t\t\n\n\n\n10\t\t\t\t\t\t\t\t\t\t   December 20,  2013\n\n\nLet\nus learn to think and learn and labour for the future of our children\nwho are here now –\n\n\n Dr.\nJames Robertson\n\n\n\t\n\n\n\t\n\t\nQuality\n\tEducation\n\t\n\n\n\n\t\n\t\nEducation\n\thelps us prepare for and navigate life’s road, a road with many\n\ttwists and turns, and one that engages us in a number of life roles,\n\tthat of an individual, family member, learner, citizen, consumer and\n\tproducer.  The preparation for life’s roles is called education\n\tand, t",
  "theme": "09-community-civic"
 },
 {
  "slug": "123-minutes-march-25-2009",
  "title": "#123 Minutes March 25, 2009",
  "summary": "Board minutes from Meeting #123 (March 25, 2009) document routine committee activities including granting decisions, financial reports, and website development. Don Glendenning noted as Fund Development committee member with no report. The minutes show ongoing CFPEI operations and a fundraising Roma Dinner event co-organized by Norman and \"Donnie\" with cost negotiations and entertainment planning.",
  "content_preview": "Community Foundation of Prince Edward Island\n\nBoard Minutes – Meeting #123\n\nDate: March 25, 2009\n\n\n\n\n  \n    \n      \n        \nItem\n      \n      \n        \nDescription\n      \n      \n        \nResponsibility\n      \n    \n    \n      \n        \n1\n      \n      \n        \nWelcome Directors – Present : Louann Thompson, David Campbell, Joyce Gaudet, Norman Carruthers, Heather MacDonald, Tom Davies\n      \n      \n        \n\n\n      \n    \n    \n      \n        \n\n\n      \n      \n        \n \n      \n      \n        \n\n\n   ",
  "theme": "09-community-civic"
 },
 {
  "slug": "18-math-education-2",
  "title": "18 Math education 2",
  "summary": "Policy proposal by Don Glendenning outlining his vision for improving mathematics education in Prince Edward Island through structured competency levels, independent testing services, and systemic reform addressing PISA test concerns. This reflects his broader Education 20/20 advocacy work and educational philosophy that students should be assessed by demonstrated competency rather than competitive ranking—a core principle of his education reform initiatives.",
  "content_preview": "Math\n\nMath Ladder   18\n\n\n\n\nBackground:\n\nIslanders are concerned about the quality of their public education with these concerns arising most recently  from PISA test results, a recent survey by The Community Foundation of Prince Edward Island, concerns expressed by the Greater Charlottetown Area Chamber. A survey by the Prince Edward Island Home and School Federation, and a series of workshops held through the Island by Education 20/20.  So far, the Department has neither responded  to nor refut",
  "theme": "09-community-civic"
 },
 {
  "slug": "19-news-a2-let-getting-help-in-souris",
  "title": "19 news A2 Let- Getting help in Souris",
  "summary": "Letter discussing education service gaps in Souris, PEI. Don observes that while schools and counsellors serve students, no accessible resource exists for non-enrolled residents seeking education information and advice (personal development, job changes, family support, etc.). After Google searching \"Souris development\" and related terms, he found no integrated education resource center. Don proposes appointing an Area Coordinator through the Department of Education to ensure community-wide service delivery. This letter reflects his community-focused perspective and concern for inclusive, accessible education services beyond traditional school populations.",
  "content_preview": "Let-2\n\nDate\n\nEditor\n\n\n\n\nGetting help in Souris\n\nSome time ago, I was waiting for friends at the Evergreen Restaurant in Souris when I was struck with the question as to where Souris residents obtain information and counselling on matters of education, We could ask the same question in any community.\n\nStudents can talk with teachers and counsellors but what about the people who are not in school? People may be thinking about furthering their education for many reasons: personal interest, self-dev",
  "theme": "09-community-civic"
 },
 {
  "slug": "2-board-restructuring",
  "title": "2 Board Restructuring",
  "summary": "Comprehensive strategic planning document detailing CFPEI's evolution from Level 1 to Level 2 community foundation with vision toward Level 3 status. Proposes recruitment committee with external chair including Order of Canada and Order of PEI appointees. Outlines director selection criteria emphasizing committee leadership potential and presidency track. Recommends lowering average director age and balancing gender representation. Details committee structure with three-year terms, rotation opportunities, and formal orientation. Emphasizes special initiatives (YIP, community building, vital signs) as separate function warranting distinct committee. Identifies development function requiring enhanced resources for endowment building, sponsorships, and operational support. Proposes advisor group of seven prominent citizens meeting annually for strategic counsel.",
  "content_preview": "CF2.2.1.2\n\nBOARD RESTRUCTURING\n\n\n\n\nAs part of our plan to grow the Foundation, we need a strategic plan for recruitment, development and recognition of directors and committee members.  The first step, obviously, is to clarify our longer term vision of the Foundation.  While we accomplish much of that through building of endowments, our inroads into the community will come through service.\n\n\n\n\nWe are moving, I would say have moved, from a Level 1 community foundation to level two and have our vi",
  "theme": "09-community-civic"
 },
 {
  "slug": "2",
  "title": "2",
  "summary": "Community Foundation News No. 2 addressing Hurricane Juan recovery efforts and agricultural heritage preservation. Reports Foundation assistance in rescuing a Hall thresher from a barn using crane services, now in museum storage. Describes a committee effort to preserve Island-made farm equipment at risk of disappearing or decaying. Committee includes George Wright, Jack Cutcliffe, Dr. Tom Hall, Henry Compton, Tony Glencross, and Don Glendenning, working with Tom LeClair of the PEI Museum. Discusses identifying storage needs and finding another Hall thresher with historical farm records. Newsletter edited by Don Glendenning.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.2\t\t\t\t\t\t\t             June 18, 2004\n\n\n\t\n\t\nFoundation Assists with Rescue\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nHurricane\n\tJuan uncovered a Hall thresher in a barn belonging to John\n\tMacQuarrie in Hampshire, PEI.;  the thresher belonged to his\n\tGrandfather.  The Foundation provided financial assistance to the\n\tMuseum Foundation to hire a crane to remove the thresher from the\n\tloft and transport it to dry storage.  Retrieval was under the\n\tdirection of Tom LeClair of th",
  "theme": "09-community-civic"
 },
 {
  "slug": "2005-memo-1",
  "title": "2005-Memo-1",
  "summary": "A memo from Don dated October 28, 2005, to Margaret, Norman, Tom, and Bruce following a Souris meeting. Don reflects on the positive discussion and shares his strategic thoughts on promoting the Souris Fund through churches, establishing it as an endowment, and creating memorial giving opportunities. He suggests reporting on the initiative at the CFPEI Board meeting, demonstrating his leadership role in the foundation's work.",
  "content_preview": "Date:\t\tOctober 28, 2005\n\n\n\n\nTo:\t\tMargaret\n\n\t\tNorman\n\n\t\tTom\n\n\t\tBruce\n\n\n\n\nSubject:\tSouris Meeting\n\n\n\n\nWe had a great discussion in Souris last night; thanks Margaret for making it happen.\n\n\n\n\nHere are my thoughts/understandings and ideas arising therefrom:\n\n\n\n\nAttached is a draft Special bulletin as a hand out at churches or elsewhere to people in the area.\n\nWe agreed to approach local churches to put something in a church bulletin  Here is a suggestion:\n\n\n\n\n“A Souris Fund has been established thr",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-1-notes",
  "title": "2008-1 Notes",
  "summary": "Meeting notes from Don's 'Little Sanhedrin' committee planning the 2008 US Citizens Day event, including discussions with provincial government partners, facility arrangements at the Culinary Institute of Canada, and survey planning. Documents Don's collaborative leadership style and commitment to recognizing American residents' contributions to PEI's community and economy.",
  "content_preview": "Date:\t\tJanuary 7, 2008\n\n\n\n\nTo:\t\tGarth\n\n\t\tAnne\n\n\t\tJohn\n\n\t\tDonnie\n\n\n\n\nFrom:\t\tDon\n\n\n\n\nSubject:\tUS Citizens Day reception\n\n\n\n\nThe above noted Little Sanhedrin gathered at Casa Mia on Monday morning at: 9:00 am to discuss plans for the coming year.  A brief summary of discussions follow:\n\n\n\n\nThe results of our discussions will be presented to the CFPEI Board for approval: (Don to place on agenda) Subject to that approval, the following are proposed/recommended.\n\nJohn reported briefly on discussions w",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-13-newsletter",
  "title": "2008-13 Newsletter",
  "summary": "Don Glendenning prepared this internal Community Foundation of PEI board document reviewing the electronic newsletter initiative launched in 2004. The memo poses key strategic questions about the newsletter's purpose, target audience, content, and frequency, proposing a leadership transition to bring fresh editorial perspective.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nSD-\t\t2008-13\n\nDate:\t\tFebruary 27, 2008\t\n\nPrepared by:\tDon Glendenning\n\n\n\n\nTo:\t\tBoard\n\n\n\n\nSubject:\tElectronic Newsletter\n\n\n\n\nOn June 4, 2004 we issued our first one-page electronic newsletter; a couple of weeks ago, we issued No. 81.  Our current distribution includes 141 people.  In addition, we issue a community reporter usually annually and around June 1.  It is time for a review:\n\n\n\n\nIt is time to ask ourselves a number whether or not we should",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-33-revised-admin-procedures",
  "title": "2008-33 Revised admin procedures",
  "summary": "A January 1, 2009 memo (dated 2009-2) proposing streamlined administrative procedures for CFPEI's Executive. Don advocates shifting administrative burden from Directors to the Executive Director, emphasizing that leadership should focus on planning rather than operational details. He recommends formal agenda development, support documents for all items, and designated responsibility assignments. This demonstrates Don's belief in organizational efficiency, proper delegation, and the importance of leadership maintaining strategic perspective rather than becoming mired in routine matters.",
  "content_preview": "COMMUNITY FOUNDATION OF\nPRINCE EDWARD ISLAND\n\n\n\n\n\n\n\nSD-\t\t2009-\n2\n\nDate:\t\tJanuary\n1, 2009\t\n\nTo:\t\tExecutive\n\nFrom:\t\tDon\nGlendenning\n\n\n\n\n\n\nSubject:\n Revised administrative procedures\t\n\n\n\n\n\n\nProblem:\tDisproportionate\namount of time on administration  \n\n\n\n\n\n\n\nBackground:\t\n\n\n\n\n\n\nReview\nof minutes for 2007 and 2008 reveals\n\n\n\n\n\n\nConclusions:\n\n\t\n\n\n\tDirectors spend too much time\n\tand energy on administrative matters\n\t\n\n\n\tOur resources allow us to\n\tlift some of the administrative load from Directors\n\t\n\n\n\t",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-agenda-2008-11-05",
  "title": "2008 Agenda 2008-11-05",
  "summary": "Development Committee meeting agenda for November 5, 2008 at CFPEI office, chaired by Don. Topics include information requirements for prospect cultivation, professional advisors outreach (Heather), points of interest (Norman), donor liaison (Jeniene), existing trusts review (David), inter-charity liaison (Tom), and community needs assessment (John). Shows Don's collaborative leadership style and committee structure.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nDevelopment Committee\n\nNovember 5, 2008, 10:30 am\n\nCFPEI Office\n\n\n\n\nWelcome and opening remarks\t\t\tDon\n\nInformation Requirements\n\nAbout prospects\n\nIn support of visits/presentations\n\nFollowing visit – notes to file and follow-up\n\n\n\n\nProfessional advisors\t\t\t\tHeather\n\n\n\n\nPOI\t\t\t\t\t\tNorman\n\n\n\n\nDonor Liaison\t\t\t\t\tJeniene\n\n\n\n\nExisting trusts\t\t\t\t\tDavid\n\nCotton\n\nCarver\n\nSchurman\n\nSummerside Legion\n\nMacDonald\n\nDundas\n\nOther\n\n\t\t\t\t\t\n\nLiaison with other Charitab",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-backgroung-paper",
  "title": "2008-backgroung paper",
  "summary": "Comprehensive background document (dated March 31, 2008) explaining the Living Trust concept and CFPEI's implementation. Defines living trusts as green spaces honoring people/events that enhance environment and provide community benefit. Outlines initial funding from Keuper Family honoring Dr. Charles Keuper's conservation legacy. Details five donation options ($25 to $1,500+) and explains motivations for giving: life changes (retirement, births, deaths) and special occasions (holidays, birthdays, anniversaries).",
  "content_preview": "Draft: March 31, 2008\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nLiving Trust \n\n1. Background\n\n\n\n\nLiving trusts are green spaces set aside to honour, recognize, or remember a person, place or event; the key characteristic is that it is a natural space where life continues to thrive  A Living Trust may be as simple as a single tree or bush but also may be a garden, a park or a forest.  \n\n\n\n\nLiving Trusts are more than just a tribute; they enhance and beautify our environment, provide shelt",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-draft-invitation",
  "title": "2008-Draft invitation",
  "summary": "Official bilingual invitation (English/French) from the Community Foundation of PEI inviting American residents and friends to the US Citizens Day reception at the Culinary Institute of Canada. The invitation celebrates shared history and the valuable contributions of American summer residents to PEI's community.",
  "content_preview": "The Community Foundation\n\t\n\n\tof Prince Edward Island\n\t\n\n\tSuite\n\t105\n\t\n\n\tQueen\n\tSquare Place\n\t\n\n\tCharlottetown\n\t\n\n\tPrince\n\tEdward Island\n\t\n\n\tC1A 4B3\n\t\n\n\t\n\n\t\tUS CITIZENS DAY\n\t\t\n\n\t\tWednesday,\n\t\tJuly 4, 2008\n\t\t\n\n\t\t\n\n\n\t\t\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\t\n\n\t\n\n\n\t\n\t\n\n\t\t\n\t\n\n\tLa Fondation communautaire\n\t\n\n\tde\n\tl’Île-du-Prince-Édouard\t\n\t\n\n\tPièce\n\t105\n\t\n\n\tPlace\n\tQueen Square\n\t\n\n\tCharlottetown\n\t\n\n\tÎle-du-Prince-Édouard\n\t\n\n\tC1A 4B3\n\t\n\n\t\n\n\n\t\n\n\n\n\n\t\n\t  \n\t\n\n\t                                                        ",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-hugh-macdonald-grace",
  "title": "2008-Hugh Macdonald - Grace",
  "summary": "Formal letter dated July 31, 2008 from Don Glendenning (as Director of CFPEI) to Hugh Macdonald thanking him for agreeing to say grace at the First Annual Fundraising Dinner at Roma on August 20, 2008 at 6:00 PM. The letter offers one complimentary dinner ticket and expresses gratitude, requesting contact via Foundation office at 892-3440.",
  "content_preview": "2008 07 31\n\n\n\n\n\n\n\n\n\n\nMr. Hugh Macdonald\n\n\n\n\n\n\n\n\n\n\nDear Mr. Macdonald,\n\n\n\n\nOn behalf of the Community Foundation of Prince Edward, I wish to express our appreciation to you for agreeing to say grace at our First Annual Fundraising Dinner at Roma at Three Rivers Historic Site.\n\n\n\n\nAs you know the dinner is on August 20, 2008 at 6:00 PM and we will be providing you with one ticket for the dinner.  \n\n\n\n\nOnce again thank you for joining us and agreeing to say grace.  If you have any further question,",
  "theme": "09-community-civic"
 },
 {
  "slug": "2008-proposal-3",
  "title": "2008-proposal-3",
  "summary": "A formal proposal prepared by Don Glendenning on behalf of the Community Foundation for establishing a Literacy Fund. The 30-page document, dated December 2008, defines literacy comprehensively, establishes benchmarks (notably that a Level 3 reader can \"read the daily newspaper and converse with others about items read\"), and presents compelling PEI demographic data showing 30% of adults with very low literacy rates. Don analyzes current provider fragmentation and advocates for targeted interventions through foundation-supported projects. He identifies potential entry points including defined geographic communities, workplace programs, and early childhood literacy initiatives. The proposal demonstrates Don's sophisticated understanding of literacy as a multifaceted challenge requiring coordinated, evidence-based responses rather than fragmented initiatives.",
  "content_preview": "December 30, 2008\n\n\n\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n\n\n\n\nNotes prepared by Don Glendenning \n\n\n\nAs background to a \n\n\n\nProposed Literacy Fund\n\n\n\n\n\n\n\n\n\n\n\nThe\nnotes that follow are provided only as a basis for discussions\nbetween the Community Foundation and a potential donor.  The document\ndoes not pretend to be a thorough review nor is it a plan of action\nfor the sector in general.\n\n\n\n\n\n\nWhat\nis literacy?\n\n\n\n\n\n\n\nLiteracy is defined as the ability to understand and use\nprinted",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-01-05-agenda",
  "title": "2009 01-05 Agenda",
  "summary": "Formal agenda for the Community Foundation of PEI Development Committee meeting chaired by Don. Topics include donor liaison, professional advisors, existing trusts, charitable organization liaison, and promotional initiatives. Don led discussion on Cotton Trusts and a potential Literacy Fund, coordinating work across multiple team members including Marie (his wife), John, David, Heather, Tom, and Jeniene. The agenda demonstrates his role as director and strategic leader within the Foundation.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nDevelopment Committee\n\nJanuary 7, 2009, 10:30 am\n\nCFPEI Office\n\n\n\n\nWelcome and opening remarks\t\t\tDon\n\n\n\n\nPersons of Interest\n\nWhere to begin?  Directors, Past Directors, Donors, short lists, new names, ???. \n\n\n\n\nDonor Liaison - \t\t\t\t\tJeniene\n\n\n\n\nProfessional Advisors\t\t\t\tHeather\n\nList of presentation in 2008, lessons learned, plans for 2009? \n\n\n\n\nExisting trusts\t\t\t\t\tDavid\n\nDavid and Donnie have analyzed CRA lists, identified cemeteries as a place to",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-02-19-initial-telephone-call",
  "title": "2009-02-19 Initial telephone call",
  "summary": "Memorandum to file documenting a telephone conversation between Don and Lt. Col. Donnie Walsh regarding venue options for the 2009 US Citizens Day reception. Records discussion of using the Armouries and notes about regimental band availability requiring wage payment, with plans to follow up with Captain DeCoste for detailed arrangements.",
  "content_preview": "Date:\t\tFebruary 19, 2009\n\n\n\n\nTo:\t\tFile\n\n\n\n\nFrom:\t\tGlendenning\n\n\n\n\nSubject:\tUS Reception\n\n\n\n\nAt the wrap up on the 2008 reception, we agreed to hold one in 2009 but one much less labour intensive.  Since then, we learned that the Culinary Institute would not be available on that day.  \n\n\n\n\nJohn Robinson wrote a letter to LT. Col Donnie Walsh, OC, about the availability of the Armouries for the occasion.  I talked with him today at the Bank of Commerce, and he is happy to oblige subject to working",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-04-17-checklist",
  "title": "2009-04-17 Checklist",
  "summary": "Planning checklist for the 4th Annual US Citizens Day Reception showing evolution of planning details. Reflects updated decisions including Haviland House venue confirmation, time window 4:00-6:00 pm, and partially detailed budget and facility requirements, with many items still designated for completion or clarification.",
  "content_preview": "April 17, 2009\n\nCOMMUNITY FOUN DATION OF PRINCE EDWARD ISLAND\n\nUS Citizens’ Day (2009)\n\nChecklist\n\nA  Event:\t\n\nName:\t\t4th Annual US Citizens’ Day Reception\n\nPurpose:\tTo host a meet and thank US citizens for their contributions to the Island \n\nand to inform them about work of the Community Foundation\n\nInvitees:\tUS summer visitors and US citizens living in PEI and their guests; not open to the general public\n\nType:\t\tReception\n\nVenue:\tHaviland House, Charlottetown, PEI\n\nDate:\t\tSaturday, July 4, 200",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-06-05-mc-notes",
  "title": "2009-06-05 MC Notes",
  "summary": "Speaking notes prepared by Don Glendenning for his role as Master of Ceremonies at the July 4, 2009 US Citizens Day Reception. Includes welcoming remarks, introduction of honorable guests including Judge Thomas Upson from Connecticut, background on Haviland Club architecture, recognition of Community Foundation directors, and acknowledgment of sponsors and volunteers.",
  "content_preview": "June 5, 2009\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nUS Citizens’ Day Reception, July 4, 2009\n\n\n\n\nSpeaking Notes\n\n\n\n\n\n\n\nIntro\t\tMy name is Don Glendenning\n\n\t\tLong time Director of the Community foundation of Prince Edward Island\n\n\t\tAlso with many close personal connections with your country \n\n\t\t\tthrough family, friends and a wife from Illinois\n\n\t\tPleased to be your master of ceremonies today\n\n\n\n\nWelcome\tTo the Fourth US Citizens’ Day Reception\n\nEvent organized for two reasons\n\nto celebr",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-13-summer-islanders",
  "title": "2009-13 summer Islanders",
  "summary": "Written May 29, 2009, this document evaluates CFPEI's Summer Islanders programming, including annual receptions for US citizens, summer lecture series, and social events. Don reviews the successes and challenges of each initiative, noting that the first and fourth receptions best achieved objectives with minimal resource drain and maximum opportunity for conversation. He proposes two alternatives: either hand July 4th celebrations to municipalities, or develop a formal \"Summer Islanders Society\" with membership fees to sustain operations and deepen visitors' engagement with the island community.",
  "content_preview": "SD-2009-13\n\n\n\n\nDate:\t\tMay 29, 2009\n\n\n\n\nSubject:\tThe future of Summer Islanders\n\n\n\n\nBackground:\n\n\n\n\nFor a number of years now, we have been organizing activities for summer Islanders:\n\nThe purpose of the US reception is twofold: to recognize the contributions of summer islanders and to tell them about CFPEI.  The first US reception, I believe, was very successful and resulted in over 100 people enjoying a reception and entertainment at the Haviland Club.  Although I was not at the second receptio",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-board-discussion-paper-sept-24-2",
  "title": "2009 Board discussion paper-Sept 24 -2",
  "summary": "Strategic discussion paper for Board consideration addressing development priorities and definition of endowment building. Notes that Norman and Lou Ann are leading legislative initiative to allow CFPEI to serve as trustee of trusts. Identifies target populations including directors, past directors, business people, prominent families, celebrities, Islanders Away, and young Islanders. Explores possible development themes (environment, reading, literacy, capacity building, health, Canadian history) and donor instruments (cash, property, art, stocks, insurance). Discusses life insurance and starter funds as special initiatives.",
  "content_preview": "September 16, 2009\n\n\n\n\n\n\n\nCOMMUNITY FOUNDATION OF\nPRINCE EDWARD ISLAND\n\n\nDevelopment - Some points\nfor discussion on September 24\n\n\n\n\n\n\n\nDefinition:\tBuilding\nCFPEI endowments\t\t\n\n\n\n\n\n\nStatus:\t\t\n\n\t\n\n\n\tNo significant change since\n\tlast report\n\t\n\n\n\tNorman and Lou Ann are\n\tleading an initiative to ask Province to change legislation to allow\n\tCFPEI to be a trustee of trusts.  If approved, the change will give\n\tus a significant new tool when dealing with existing trusts.\n\t\n\n\n\tNext step on Cotton funds\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-chairs-re-endowment-funds",
  "title": "2009 Chairs re endowment funds",
  "summary": "Letter from Don Glendenning to chairs/presidents of six arts organizations (Piping, Harbourfront, Victoria, Indian River, PEISO, Carrefour) proposing CFPEI-administered endowments. References prior cooperation including the Island Arts and Heritage Stabilization Project and joint brochure development. Emphasizes recent Department of Canadian Heritage Endowment Incentives Program (deadline December 1, 2009) offering federal matching funds for locally raised endowments. Suggests expediency and possibility of DOCH representative meeting. Demonstrates Don's proactive leadership in arts sector development.",
  "content_preview": "Chairs and Presidents\n\n\n\n\nPiping, Harbourfront, Victoria, Indian River, PEISO, Carrefour\n\n\n\n\nAs you know, the Community Foundation of Prince Edward Island is in the business of building and administering endowments.  In fact, at the close of the Island Arts and Heritage Stabilization Project and again during the development of a joint brochure for arts organizations, we discussed formalizing arrangements between our two organizations whereby the community foundation would administer an endowment",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-community-capacity-building-2",
  "title": "2009 Community Capacity Building -2",
  "summary": "Comprehensive proposal for CFPEI to take leadership in assisting PEI charitable organizations increase capacity through customized support and community-level coordination. Based on Venture Philanthropy Partners' seven elements framework (Aspirations, Strategies, Organizational Skills, Human Resources, Systems and Infrastructure, Organizational Structure, Culture). Proposes provision of technical assistance, training, networking, and grants. References CFPEI's prior success with Arts Stabilization program and prior capacity building grants ($55,000 in prior year with additional $45,000 planned). Document demonstrates CFPEI's sophisticated approach to nonprofit sector development under Don's leadership.",
  "content_preview": "Community Capacity Building\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCommunity Foundation of Prince Edward Island \n\n119·121 Queen Street, Suite 105 \n\nCharlottetown, PE CIA 4B3\n\n\n\n\nCharitable Registration Number: 890011190RROOOI\n\n\n\n\nAugust 10, 2009\n\n\n\n\nCommunity Capacity Building\n\n\t\n\n1.0 \tCommunity Capacity Building \n\n\n\n\nAs non-profit  organizations play increasingly important roles in our society, it becomes even more critical for them to perform effectively.   Staff, volunteers",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-holman-1",
  "title": "2009-Holman 1",
  "summary": "Letter from Don Glendenning to Harry Holman dated March 6, 2009, written from Florida detailing the development of the \"Leave a Legacy\" arts brochure. Don explains he earmarked private donations to extend the Island Arts and Heritage Stabilization Project (IAHSP) impact. Scott MacAuley proposed a multi-panel brochure featuring six organizations plus front/back matter. Five organizations responded positively; Carrefour initially didn't participate but Michelle Blanchard later responded with French panel. Don discusses unsuccessful attempts to fund French translation (estimated $800-1,000 plus printing costs). Explains Carrefour wouldn't participate in English-only version with French panel. References Donald Arsenault (past CFPEI Director) and seeks advice from Harry Holman regarding translation grant opportunities.",
  "content_preview": "Date:\t\tMarch 6, 2009\n\n\n\n\nTo:\t\tHarry Holman\n\n\n\n\nFrom:\t\tDon Glendenning\n\n\n\n\nSubject:\tArts brochure\n\n\n\n\nGreetings from the sandy shores of Florida!  I am having email problems; I can receive but not send so am handling my messages via web mail.\n\n\n\n\nSome background on the arts brochure:\n\n\n\n\nI felt strongly that we should try to extend the impact of the IAHSP project and was able to earmark some private donations to CFPEI for that purpose.  The funds are not part of the funds transferred to CFPEI on ",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-nursing-scholarships-go-begging",
  "title": "2009-Nursing Scholarships go Begging",
  "summary": "News article or press release describing the $4,000 Rear Admiral Louise C. and James Wilmot Scholarship for nursing students with no applications received. Attributes the scholarship's creation to Don Glendenning's brokerage of an arrangement between the Wilmots and Eastern Kings Health Foundation during summer 2007. Includes Don's quote: \"The establishment of these scholarships is a classic example of the role of a community foundation, linking people who care with causes that matter.\" Calls for applications before deadline.",
  "content_preview": "Nursing Scholarships go Begging\n\n\n\n\nScholarships worth four thousand dollars for nurses in their third or fourth year of training in any Canadian university have not received a single application.  The scholarships, one at the Community Foundation of Prince Edward Island (CFPEI) and the other at the Eastern Kings Health Foundation, are valued at $2,000 each and are for students in training who agree to accept employment at the Souris hospital for one or  two years after graduation.  Time is runn",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-starter-funds-3",
  "title": "2009 Starter funds-3",
  "summary": "Strategic proposal document for Community Builders Legacy Fund initiative (circa 2008-2009). Proposes expanding CFPEI's reach to younger donors through legacy building. Details fund characteristics ($10,000 minimum, regular contributions, named/unnamed options, Canadian/US funds), multiple contribution methods, management approaches, and a comprehensive three-year budget ($6,900 total) including mailings, brochures, staff, and promotional activities. Identifies administrative challenges and proposes creating a \"Society of Community/Legacy Builders.\"",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nCOMMUNITY BUILDING FUND\n\n\n\n\nBACKGROUND\n\n\n\n\nCFPEI was incorporated in 1993 and gathers and administers endowments for Islanders and Island organizations.    It is one of 160 such foundations across the country with assets in excess of $1bn all with a focus on the needs of their local communities.  CFPEI is one of the smaller community foundations with 40 funds and assets of $1m.  In retrospect, our focus has been generally people who are now senior",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-starter-funds-brochure-3",
  "title": "2009 Starter Funds Brochure-3",
  "summary": "Extended marketing brochure about Community Builder Funds, targeting donors interested in philanthropic legacy. Describes community builders as diverse professionals committed to giving back, discusses tax benefits of life insurance gifts, emphasizes CFPEI's role in Canada's community foundation movement (160+ organizations since 1921), and lists ten reasons for choosing community foundations including flexibility, tax advantages, and community accountability.",
  "content_preview": "If\n\tgiving is one of the family values you want to pass along, we can\n\thelp                                 your family build a tradition\n\tof giving.\n\t\n\n\t\n\n\n\t\n\n\n\n\tWho are\n\tCommunity builders?\n\t\n\n\n\n\t\n\t\n\n\tCommunity Builders\n\tare people who are interested in\n\tmaking Prince Edward Island an even better place to live – both\n\tfor this generation and the\n\tnext.  Community\n\tbuilders want to give back to their community and want to\n\tdo it now.  Community\n\tbuilders are thinkers, planners, and doers in all",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-starter-funds-descriptioncommunity-builders",
  "title": "2009 Starter Funds-descriptionCOMMUNITY BUILDERS",
  "summary": "Programmatic document describing CFPEI's \"Community Builders Legacy Fund\" concept, designed to encourage individuals to establish endowments reflecting their values and passions. Outlines the philosophy that community builders quietly or publicly contribute to causes (environment, heritage, education, health, religion) and can formalize their legacy through living endowments. Details the simple process of establishing funds and maintaining donor input. Reflects Don's belief in democratizing philanthropy and making legacy giving accessible to diverse community members beyond major donors.",
  "content_preview": "COMMUNITY BUILDERS LEGACY FUND\n\n\n\n\n\n\n\nWHAT IS A COMMUNITY BUILDER?\n\n\n\n\nCommunity Builders are people who are interested in making Prince Edward Island an even better place to live – both for this generation and generations to follow.  Community builders want to give back to their community and want to start doing now.  Community builders are thinkers, planners, and doers in all walks of life.  They realize that their successes resulted from help by many people and, through establishing a legacy ",
  "theme": "09-community-civic"
 },
 {
  "slug": "2009-summary-report-2",
  "title": "2009-summary report-2",
  "summary": "Comprehensive Community Foundation agricultural heritage report documenting accomplishments: exploratory survey and \"Made in PEI\" report; museum donations (Hall thresher panels, conversion tractor wheels); museum liaison efforts; endowment fund establishment; virtual display support; collector meetings and tours. Lists conclusions (need for storage, museum-collector linkages, database establishment) and proposed next steps (expand publication, Island-wide collector meeting, fundraising). Demonstrates Don's systematic approach to heritage preservation and his role coordinating institutional and community efforts.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nAgricultural Heritage Report\n\n\n\n\nA small committee linked to the Community Foundation has been promoting the conservation and restoration of Island-made agricultural equipment; the continuing core committee consists of Don Glendenning who serves as Chair, Dr. Tom Hall, Tony Glencross, and Charley Coles.  \n\n\n\nAccomplishments:\n\n\n\n\nConducted an exploratory survey or early Island farm equipment and published a preliminary report, Made in PEI; Copies are ",
  "theme": "09-community-civic"
 },
 {
  "slug": "2010-07-challenge-funds",
  "title": "2010  07 Challenge Funds",
  "summary": "July 4, 2010 proposal to establish CFPEI Challenge Fund offering financial incentives for endowment creation/expansion. Models include matching funds, arts partnership matching (1:4 multiplier with DOCH), and flow-through grants. Short-term goal $100,000; long-term $1,000,000. Open to all sectors except faith-based/partisan (unless donor-initiated). Reflects Don's sophisticated understanding of leverage financing to democratize access to professional fund administration for smaller organizations unable to sustain independent fundraising. Shows innovative thinking about sector-wide capacity building.",
  "content_preview": "July 4, 2010\n\n\n\n\nCHALLENGE FUNDS\n\n\n\n\nWe’ve spoken on occasion about offering a financial incentive to organizations or individuals to encourage the creation or expansion an endowment fund held by CFPEI.  Although CFPEI has not used that approach, it has been involved in two instances where we were challenged. \n\n\n\n\nPROPOSAL:\n\n\n\n\nThat CFPEI adopt the challenge fund idea as a mechanism for encouraging charitable organizations to ensure their future through the establishment of \n\n\n\n\nBENEFITS:\n\n\n\n\nAl",
  "theme": "09-community-civic"
 },
 {
  "slug": "2010-10-13-sample-funds-for-the-2009-canada-games-dreams",
  "title": "2010-10-13 Sample Funds for The 2009 Canada Games Dreams",
  "summary": "A proposal document outlining five fund administration options for the 2009 Canada Games Dreams & Champions Legacy Trust at CFPEI. Options range from an Interest Fund (full CFPEI management) to a Managed Fund (allowing withdrawal at donor discretion) to custom arrangements. Each option specifies investment management, granting policies, and agreement structures. The document demonstrates CFPEI's capacity to accommodate diverse donor needs and trust management preferences while maintaining professional investment and reporting standards.",
  "content_preview": "The 2009 Canada Games Dreams & Champions Legacy Trust (the Trust) has been established to assist provincial sporting organizations help emerging; Island athletes develop, train, and compete at increasing levels.  The trust will be managed by a committee (the Trust Committee) made up by representatives from Sport PEI, the Province of PEI, and the Host Society.\n\nOptions for the Trust Fund Hosting available at the Community Foundation.\n\nAs an Interest Fund\n\n(Administration, investment, full grantin",
  "theme": "09-community-civic"
 },
 {
  "slug": "2010-funding-ideas-initiatives",
  "title": "2010 FUNDING IDEAS-initiatives",
  "summary": "Strategic brainstorm document outlining five major funding initiatives for CFPEI: charitable/NGO facilities center, 3-5 year organizational development program, endowment challenge grants, Centre for Family Philanthropy, and enhanced communications. Reflects Don's visionary leadership in identifying ways to strengthen the provincial charitable sector beyond traditional grantmaking. Shows his commitment to capacity-building for nonprofit organizations and systematic approaches to sector development.",
  "content_preview": "FUNDING IDEAS\n\n\\\n\nIntroduction;\n\n\n\n\nA number of ideas have bee or are floating around; it may be time for an overall view.\n\n\n\n\nIdeas:\n\nFacilities: A centre for charitable/NGO agencies to include such things as: some offices, bookable meeting rooms, administrative and secretarial services, state-of-the-art IT, \n\nDevelopment:  3-5 year developmnt initiative parallel to the IAHSP which was designed to strengthen the business/ administrative side of organizations. To include such things as: Board de",
  "theme": "09-community-civic"
 },
 {
  "slug": "2010-trust-planning-checklist",
  "title": "2010-Trust planning checklist",
  "summary": "Draft template (December 17, 2009) for donor planning conversations covering objectives, interests (undesignated, memorial, religion, heritage, environment, education), beneficiary organizations, fund options, and capacity planning. Includes calculation guidance: $25,000 investment provides $1,000 annual grant in perpetuity; $500/year grant requires $12,500 investment. Educational tool designed to guide donors in structuring planned gifts to CFPEI aligned with personal charitable priorities.",
  "content_preview": "Draft: December 17, 2009\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nTrust Planning Guide\n\n\n\n\nName:_____________________________\n\n\n\n\nAddress ____________________________\n\n\n\n\nPhone\n\nObjective(s)\n\n\n\n\n\n\n\n\n\n\n\n\n\nInterests:\n\nUndesignated\n\nMemorial to _______________\n\nReligion ___________________\n\nHeritage __________________\n\nEnvironment _______________\n\nEducation _________________\n\n\n\n\n\n\n\n\n\n\nOrganizations:\n\nChurch ___________________\n\nHospital __________________\n\nUPEI ____________________\n\nHollan",
  "theme": "09-community-civic"
 },
 {
  "slug": "2011-cemeteryworkshopagenda-3",
  "title": "2011 Cemeteryworkshopagenda-3",
  "summary": "Official agenda for the April 8, 2011 Cemetery Workshop held at The Best Western Hotel, Charlottetown. Document includes the Community Foundation of PEI mission statement and board roster listing Don Glendenning as a board member. The workshop featured remarks from President John Robinson, a panel discussion on cemetery operations with speakers Jack Sorensen (Tryon Community Cemetery), Tom Deblois (Sherwood Cemetery Company), and George Wright (Old Protestant Burial Ground), plus sessions on fundraising strategies led by Jodi Swan and investment strategies led by Rogers Bell. Sponsored by the PEI Funeral Directors and Embalmers Association.",
  "content_preview": "The\n\t\tCommunity Foundation of Prince Edward Island\n\t\tis a volunteer driven, registered, non-profit, charitable\n\t\torganization. Our mission is to improve the quality of life on PEI\n\t\tthrough the creation and building of endowment trust funds that\n\t\twill enhance life for all residents.\n\t\t\nTheFoundation\n\t\tprovides an established means for individuals, families, community\n\t\tgroups, corporations, and private foundations to support\n\t\tphilanthropic activities which invest in sustainable solutions to\n\t\t",
  "theme": "09-community-civic"
 },
 {
  "slug": "2011-notes-for-exec-meeting",
  "title": "2011-Notes for Exec meeting",
  "summary": "Executive meeting notes addressing board restructuring to position CFPEI as the most significant player in PEI's third sector. Outlines objectives: increase endowment-building efforts, establish community initiatives committee, improve organizational effectiveness through structured board/committee meetings and orientation, define clear member expectations. Proposes committee reforms: establish recruitment committee with external chair, limit appointments to three-year terms, include community members on all committees except Executive, transition from administrative focus to policy-making focus, and enhance director participation in decision-making.",
  "content_preview": "BOARD RESTRUCTURING\n\n\n\n\n\n\n\n\n\n\nGoal: to position CFPEI as the most significant player in the third sector of PEI\n\n\n\n\nObjectives:\n\nIncrease our efforts in building endowments/assets\n\nConfirm role of development committee as increasing endowments only \n\nAdd community members to the committee\n\nAdd someone with fundraising experience to the committee\n\nClearly define expectations of members\n\n\n\n\nIncrease our visibility and service through self supporting projects\n\nEstablish a community Initiatives comm",
  "theme": "09-community-civic"
 },
 {
  "slug": "2011-options",
  "title": "2011-Options",
  "summary": "Strategic planning document from May 2010 presenting multiple options for the future of US Citizens' Day programming. Options include: discontinuing the event while thanking participants, inviting municipalities to organize celebrations, establishing higher budgets ($1,000+), showcasing Island arts through cultural programming, emphasizing CFPEI institutional identity, and establishing dedicated US citizen funds. Includes suggestion of US student scholarships at PEI institutions. Document reflects Don's analytical approach to evaluating program sustainability, cost-benefit analysis, and strategic fit within CFPEI's mission.",
  "content_preview": "May 17, 2010\n\nCOMMUNITY FOUN DATION OF PRINCE EDWARD ISLAND\n\nUS Citizens’ Day (2010)\n\n\n\n\nIdeas for 2011\n\n\n\n\nConsiderations:\n\n\n\n\nIs purpose still valid?\n\nHas it provided any benefits to CFPEI\n\nIs it good for PEI\n\nIs it appropriate for CFPEI\n\nWhat is/should be its priority for CFPEI\n\nHow could it be improved?\n\nWhat would lighten the burden of organizing\n\n\n\n\n\n\n\n\n\n\nOptions/Ideas\n\nDiscontinue; inform participants thank organizers\n\nInvite City, cities, PEI municipalities to organize\n\nEstablish a budge",
  "theme": "09-community-civic"
 },
 {
  "slug": "2011-remarks",
  "title": "2011-Remarks",
  "summary": "Speaking notes for the 6th Annual July 4 Reception in 2011 addressing old and new attendees. Don welcomes guests, explains CFPEI's core mission as a community foundation improving quality of life through endowments and grants. Highlights recent achievements including returning $65,000 in grants, increasing endowment, expanding digital presence (Facebook), and adding Doug Leitch to planning committee. Proposes future evolution toward broader summer islander gatherings at dates beyond July 4, offering opportunities for networking with community leaders and learning about Island life. Invites audience participation in shaping the initiative's future.",
  "content_preview": "Sixth annual July 4 Reception\n\nJuly 4, 2010\n\nWelcome  - \n\nGreat to see old friends and welcome new friends\n\nWhere are you from?\n\nIs this your first time?\n\nLast year, you asked us what we do.  We:\n\n  \nAre a  community Foundation\n  \nImproving the quality of life on PEI\n  \nProvide a vehicle for individuals and organization to support worthy causes of their choice\n  \nBuild endowments\n  \nFlow through funds \n  \nBring people together to solve problems\n\n\n\n\n\nTo be more specific:\n\n  \nToday’s reception – N",
  "theme": "09-community-civic"
 },
 {
  "slug": "2011-wrap-up",
  "title": "2011 wrap-up",
  "summary": "Memorandum dated April 13, 2011 from Don Glendenning to File with observations about the cemetery workshop. Notes approximately 30 participants attended, comments on room logistics and program reception, and observations that participants were engaged with discussion continuing nearly an hour after the session ended. Includes recommendations for future sessions: consider Saturday dates, larger square room, seek second sponsor (possibly monument maker), and provides suggestions for topics (fundraising, insurance costs, stone care, endowment management, cemetery association formation). References participant feedback requesting follow-up letter from CFPEI and questionnaire survey on future topics.",
  "content_preview": "Date:\t\tApril 13, 2011\n\n\n\n\nTo:\t\tFile\n\n\n\n\nSubject:\tCemetery Workshop Wrap-up\n\n\n\n\nFrom:\t\tDon Glendenning\n\n\n\n\nA few observations and thoughts:\n\n\n\n\nNumbers:  About 30 people; I’ve heard that others planned to come but thought the session was on Saturday\n\nRoom: adequate, below ground, tables of 6 or 8, tables a bit close together, the arrangement certainly facilitated discussion among participants.\n\nProgram was well received\n\nParticipants were engaged; discussion carried on for nearly an hour after se",
  "theme": "09-community-civic"
 },
 {
  "slug": "2012-gov-receptionpotential-invitees-3",
  "title": "2012 Gov. ReceptionPotential invitees-3",
  "summary": "Updated invitee list from June 27, 2012 with more detailed contact information. Organizes 100 invitations for 80 guests at Government House garden party (6:00 pm). Separates US Citizens (32 names with email addresses including Bob Grey, Rob Grimshaw, Mark Ptashne) and Canadian invitees (21 names) from CFPEI Board members (12 positions). Demonstrates sophisticated donor prospect management and relationship cultivation across both summer residents and year-round community leaders.",
  "content_preview": "June 27, 2012\n\nMaster List of Potential invitees \n\nfor\n\nReception for at Government House \n\nAugust 7, 2012\n\nPurpose – to encourage giving and not simply to thank simply or recognize service \n\nGarden Party:  6:00 pm\n\nNumber of Guests:\t80\n\nNumber of invitations:  100\n\nInvitees:\tSummer Islanders:  Canadian and US  \n\n  \nHave address\n  \n\n\n\nUS citizens\n\n\n\n\nBergmark, David *\n\nBliss, Sally  *\n\nCarver, David * \n\nCorcoran, Tom  and Marge \n\nCross, Edward *\n\nDavis, Bea and Mel \n\nDunea, Mary *\n\nEagles, Robin",
  "theme": "09-community-civic"
 },
 {
  "slug": "2012-proposal",
  "title": "2012 proposal",
  "summary": "Formal proposal dated September 24, 2011 from Don Glendenning to CFPEI Board proposing discontinuation of traditional July 4 reception in favor of municipalities organizing their own celebrations. Proposes CFPEI initiate separate \"summer islanders\" reception on membership basis with potential fees, targeting Island leaders across sports, arts, business, and government sectors. References successful Upson reception as precedent. Rationale emphasizes cost efficiency, goodwill generation, tangible outcomes (one endowment, $15,000 in scholarships), and opportunity to highlight CFPEI's identity separately from July 4 celebrations.",
  "content_preview": "COMMUNITY FOUN DATION OF PRINCE EDWARD ISLAND\n\nProposed 2012 Strategy\n\n\n\n\n\n\n\nDate:\t\tSept 24, 2011\n\n\n\n\nTo:\t\tDirectors\n\n\n\n\nFrom:\t\tDon Glendenning\n\n\n\n\nSubject:\tChange of strategy – US Reception\n\n\n\n\nBackground:\n\nWe successfully hosted six receptions for US summer visitors on July 4 each year\n\nNumber varied from l40 to 150\n\nProgram usually consisted of music, national anthems and a speaker. The US consul from Halifax, or his representative, attended 3 receptions\n\nThe future of the initiative has been",
  "theme": "09-community-civic"
 },
 {
  "slug": "2012-remarks",
  "title": "2012 remarks",
  "summary": "Speaking remarks delivered at July 4, 2012 US Citizens' Reception in Summerside, likely by Don Glendenning. Extends CFPEI greetings, recognizes John Robinson and other Directors, reflects on deep historical connections between PEI and United States (emigration patterns to Boston States, descendants returning). Notes that three daily trains once connected PEI to USA, many stayed and had descendants. Thanks Mayor and Summerside for hospitality and cross-border friendship. Invites continued engagement with CFPEI. Reflects Don's interest in historical connections and appreciation for cultural/family ties across borders.",
  "content_preview": "US citizens’ Reception\n\nSummerside, PEI\n\nJuly 4, 2012\n\n\n\n\nYour worship, Honoured Guests,\n\n Ladies and Gentlemen, Friends all\n\n\n\n\nBring greetings from CFPEI\n\nRecognize John Robinson and other Directors\n\n\n\n\nWhile you celebrate your birthday\n\nWe celebrate the many linkages between our peoples\n\nIslanders can tell stories of relatives heading for the Boston States\n\nWoods industry, construction retail, manufacturing\n\nThree times trains a day one could board a train\n\nleaving PEI and make connections to",
  "theme": "09-community-civic"
 },
 {
  "slug": "2013-08-school-board-elections",
  "title": "2013-08 School Board elections",
  "summary": "Supporting school board elections as engagement indicators, Don cites National Parent Teacher Association research confirming that family-school-community collaboration improves student achievement, teacher morale, and communication. Addressing concerns about low voter interest, Don suggests public apathy reflects perception of trustee powerlessness rather than disinterest. Empowering trustees with real decision-making authority would likely increase engagement. The letter positions community involvement as a policy lever rather than an isolated governance matter.",
  "content_preview": "May 13, 2013\n\n\n\n\nEditor, Charlottetown Guardian\n\nCharlottetown, PEI\t\n\n\n\n\nDear Sir:\n\nSchool board elections\n\n\n\n\nI support the idea of school board elections because they are an indicator of school engagement, and students do better in schools where communities are involved.  The National Parent Teacher Association in the USA reports that “when families, schools, and communities work together,\n\nStudent achievement improves,\n\nTeacher morale rises,\n\nCommunication increases” \n\n\n\n\nAs for low voter int",
  "theme": "09-community-civic"
 },
 {
  "slug": "2016-literacy-workshop-before",
  "title": "2016 Literacy workshop-before",
  "summary": "Pre-event press release announcing workshop at Stratford Town Hall on adult literacy training services. Connects literacy to economic prosperity and notes Community Foundation's identification of preparedness gaps. Positions literacy as shared responsibility between education and workforce departments. Glendenning organized this community education event, demonstrating his belief in public forums for addressing systemic issues. His hands-on approach to convening stakeholders and educating the public was characteristic of his leadership style.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdult\nliteracy levels on PEI \n\n\nIslanders\nwill have a chance to learn about literacy training for adults at a\npresentation and discussion at the Stratford Town Hall on Wednesday,\nSeptember 14, 2016 at 9:00 am.  The session, held in the Southport\nRoom, will deal with services available, what more needs to be done,\nand, generally, why literacy is important to the future success",
  "theme": "09-community-civic"
 },
 {
  "slug": "2016-literacy-workshop-following",
  "title": "2016 Literacy workshop following",
  "summary": "Comprehensive press release on adult literacy findings in PEI, reporting OECD average literacy levels yet noting that 40% of the workforce lacked skills needed for modern economy. References Community Foundation survey of youth and Charlottetown Chamber of Commerce data. Includes Glendenning's quote emphasizing literacy as central to education conversations. Demonstrates his advocacy for basic skills development and awareness of the literacy-economy connection, positioning him as a voice for workforce development on the island.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdult\nliteracy levels on PEI \n\n\n\n\n\n\n\n\nLiteracy\nlevels of PEI adults (ages 16-65} are at the OECD average level; the\nsame can be said for numeracy.  That’s good news for PEI but still\nleaves more than 40 percent of the Island workforce lacking the skill\nlevel needed to participate in a modern economy.  \n\n\n\n\n\n\n\n\n\nThe\nnumbers were presented by Barbara\nMcNutt, Manager of Literacy",
  "theme": "09-community-civic"
 },
 {
  "slug": "2017-description-8",
  "title": "2017 Description-8",
  "summary": "Program description for 2017 Excellence in Education Award expanding beyond schools to community organizations ($2,500 award). Reflects philosophy that \"it takes a community to raise a child,\" shifting focus to educational initiatives by non-school community groups. Proposals must be community-led, address actual educational needs, build on existing resources, be equitable, include implementable activities, and reflect best practices. Documentation requirements: 3-page maximum, group-generated rather than professionally contracted, written format. Proposals should address educational need, underlying principles, proposed activity, likely future, and relevant information. April 30, 2017 deadline, submissions via Education 20/20 or Community Foundation of PEI office. Award represents strategic expansion to recognize broader educational ecosystem beyond institutional settings.",
  "content_preview": "EXCELLENCE\nIN EDUCATION AWARD\n\n$2,500\n\n\n\n\n\n\n\n\nBACKGROUND\n\nEducation\n20/20 Inc. is pleased\nto offer an Excellence in Education Award in the amount of $2,500 for\nthe purpose of supporting and encouraging a quality education for\nPrince Edward Islanders.  In the belief that it\ntakes a community to raise a child, the 2017 Award will recognize\neducational initiative of a community organization other than a\nschool or learning centre.  Community groups are invited to present\ntheir ideas\non the use and o",
  "theme": "09-community-civic"
 },
 {
  "slug": "2019-opei-robinson",
  "title": "2019 OPEI Robinson",
  "summary": "Don Glendenning writes a letter of nomination support for A. John Robinson for the Order of Prince Edward Island. He highlights Robinson's crucial leadership role with the Community Foundation of PEI, which has grown from $100,000 to over $10 million in endowments under Robinson's guidance. This document demonstrates Don's continued civic engagement and his role as a key opinion leader in PEI's philanthropic community.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown PEI  \n\nC1A 3A9\n\nApril 4, 2019\n\n\n\n\nOrder of Prince Edward Island\n\nLegislative Assembly\n\n197 Richmond Street\n\nPO Box 2000\n\nCharlottetown, PE  C1A 7N8\n\n\n\n\nDear Sir:\n\nA. John Robinson\n\n\n\n\nI am pleased to support the nomination of A. John Robinson to the Order of Prince Edward Island. I have known John for many years and know him to be a most worthy candidate.\n\n\n\n\nWhile I am aware of John’s status as a successful farmer, businessman, volunteer and philanthropis",
  "theme": "09-community-civic"
 },
 {
  "slug": "3-1-cfpei-admin-letters",
  "title": "3-1 CFPEI Admin letters",
  "summary": "Letter to Community Foundation of Prince Edward Island President John Robinson proposing organizational partnership to facilitate PEI Education Group's launch and fundraising. Details plans for incorporation, fund management (operating, program, and endowment), and describes consensus among group members about need for greater public engagement in education. Demonstrates Don's collaborative leadership and strategic planning for education reform initiative.",
  "content_preview": "February 19, 2012\n\n\n\n\nMr. John Robinson, President\n\nCommunity Foundation of Prince Edward Island\n\n119-121 Queen St.\n\nCharlottetown, PE  C1A 4B3 \n\n\n\n\nDear Mr. Robinson:\n\n\n\n\nPEI Education Group\n\n. \n\nAs a result of considerable discussion over the past year, a small group of people with an interest in education, has come together to discuss educational issues.  Members are unanimous in the view that there is a need in PEI, and across the country, for greater public engagement in education at all le",
  "theme": "09-community-civic"
 },
 {
  "slug": "3-letterhesd-1",
  "title": "3 Letterhesd 1",
  "summary": "Founding letter from Don Glendenning introducing Education 20/20 initiative to PEI residents, articulating concerns about educational quality, inadequate public engagement, and need for systemic change. Establishes slogan \"A quality education for every Canadian\" and describes partnership with Community Foundation of PEI. Demonstrates his post-Holland College commitment to educational reform and community mobilization.",
  "content_preview": "Education 20/20 Inc.\n\n\n\n\n101 Kent St., PO Box 624 \n\nCharlottetown \n\nPEI C1A 1M0 Canada\n\n\n\n\nEmail: educ.first@gmail.com\n\nNovember 9, 2012\n\n\n\n\nIsland Resident, Taxpayer\n\nAnywhere\n\nPE,  C1A 4A5\n\n\n\n\n\n\n\nDear Island Resident:\t\t\n\n\n\n\nAs you may have gathered from my letters to the Charlottetown Guardian, I am concerned about the state of education in Canada.  I say this, based on my own experience, on what Islanders tell me, and what I read and hear. Without doubt, education is important, changes are ne",
  "theme": "09-community-civic"
 },
 {
  "slug": "3-opening-remarks",
  "title": "3-opening remarks",
  "summary": "Don's prepared opening remarks introducing the transition working group's conceptual framework. Traces issue origins to CFPEI 2013 youth survey identifying \"preparedness gap\" and documents subsequent conversations with students, parents, grandparents, and employers. Presents framework using metaphor of \"road of life\" with hurdles and helpers, positioning the problem from student perspective rather than institutional perspective. Identifies specific student predicaments: meeting institutional requirements but not program requirements, graduating without necessary credits, having good marks but not diploma, older student status. The remarks show Don's ability to translate abstract policy problems into concrete human narratives.",
  "content_preview": "Transition/2-3\n\t\nOPENING\n\tREMARKS\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nWelcome\n\t\n\t\t\n\nThanks\n\t\n\t\n\n\n\n\t\n\t\nBackground\n\t\n\t\t\n\nCFPEI\n\t\t2013. Youth survey, “Preparedness gap”\n\t\t\n\nConversations\n\t\tsince – parents, grandparents, employers, students\n\t\t\n\nCMEC\n\t\tstatement on importance of transition \n\t\t\n\t\t\n\nThere\n\t\tis an issue\n\t\t\n\nIssue\n\t\t\n\nFocus\n\t\ton a single subject-math\n\t\t\n\nMore\n\t\tthan just high school to further study and employment\n\t\t\n\nLook\n\t\tat it from a student’s perspective\n\t\n\n\n\n\t\n\n\n\t\n\t\nRoad\n\tof life Framework\n\t\n\t\t\n\nStude",
  "theme": "09-community-civic"
 },
 {
  "slug": "37-july-112007-minutes",
  "title": "#37 July 112007  Minutes",
  "summary": "Executive meeting minutes for the Community Foundation of PEI with Don in attendance alongside Norman Carruthers (Chair), John Robinson, and David Campbell. Key items include board vacancy discussions, scholarship funding, space planning, grant-making processes, and the Living Memorial Trust project. Minutes reflect ongoing operational decisions and Don's collaborative role in Foundation governance.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\nMinutes of Executive Meeting\n\nFoundation Office\n\nJuly 11, 2007 at 9:00 am\n\n\n\n\nIn attendance:\t\n\nNorman Carruthers in Chair\n\nJohn Robinson\n\nDavid Campbell\n\nDon Glendenning\n\nAbsent: \n\nMyron Mackay\n\n\n\n\nBUSINESS ARISING\n\nMinutes of meeting May 30, 2007 - approved\n\n\n\n\nUpcoming board Vacancy Norman to invite Mike O’Brien and \n\nWayne Murphy\n\nDon to invite Paul Norris\n\n\n\n\nNorman playing telephone tag with Mike O”Brien\n\n\n\n\n\n\n\nCarver Scholarship-\tSubject to dis",
  "theme": "09-community-civic"
 },
 {
  "slug": "4-cfpei-number-of-directors",
  "title": "4 CFPEI Number of Directors",
  "summary": "Brief proposal to increase CFPEI board size from 12 to 15 directors. Includes comparative data on Canadian community foundation board sizes (ranging 8-15 members). Notes CFPEI operated with 12 directors since 1993. Comparative examples include Fredericton (15), Newfoundland (14), various Nova Scotia and other Atlantic/Canadian foundations (8-12 members). Document supports strategic governance restructuring discussions.",
  "content_preview": "CF2.2.1.4\n\nDIRECTORS\n\nProposal:\tTo increase the number of Directors of the community foundation of |Prince Edward Island  from 12 to 15. \n\n\n\n\nBackground:\n\nSince its establishment in 1993, CFPEI has operated with a Board of 12 Directors.  From time to time, the suggestion has been made that the number be increased.  \n\nOther Foundations:\n\nAn internet search of other Canadian community foundations reveals the following numbers of Directors:\n\n\tFredericton, NB\t\t15\n\nNfld\t\t\t\t14\n\nFundy, NB\t\t\t11\n\nNova Sc",
  "theme": "09-community-civic"
 },
 {
  "slug": "6-legacy-club-medicine-hat",
  "title": "6 Legacy Club-Medicine Hat",
  "summary": "Model documentation of a similar Legacy Club program created in 2005 by the Medicine Hat community foundation, likely used as a template for CFPEI's version. Describes five fund types (Pledged, Community, Designated, Field of Interest, and Donor Advised) with varying minimum contributions ($500-$15,000). Each tier provides different levels of donor control and charitable impact. The document demonstrates how community foundations across Canada were structuring endowment programs for diverse donor preferences.",
  "content_preview": "CF2.2.1.6\n\n  \n    \n      \n        \nMedicine Hat Legacy Club\n        \nCreated in 2005 (Alberta's Centennial Year) the Legacy Club provides an opportunity for everyone to create and build their own community legacy,\n        \nThe Legacy Club runs each year and is simple, unique and lasting.  A Legacy Club membership can commence with as little as $500 received by December 31st.  \n        \nLegacy donations are placed in an endowment fund in the chosen name of the donor.  For example it could be a fa",
  "theme": "09-community-civic"
 },
 {
  "slug": "7-cfpei-director-recruitment",
  "title": "7 CFPEI Director Recruitment",
  "summary": "Strategic proposal by Don advocating for establishment of an external board recruitment committee chaired by the Lieutenant Governor, similar to models used by other foundations (Fundy, Nova Scotia Community Foundation). References Don's Order of Canada status (\"Member of the Order of Canada\") as criterion for committee membership. Argues this approach would elevate governance standards and restore CFPEI to \"original roots\" by recruiting high-profile community leaders. Demonstrates Don's vision for professional governance structures and his understanding of institutional best practices.",
  "content_preview": "CF1-Org\n\nRECRUITMENT OF DIRECTORS\n\nProposal: To strike an external committee for purpose of recruiting new Directors.\n\nBackground:\n\nCommunity foundations thrive on their support by and service to their communities.  One of the devices used to maintain that linkage is the use of external nominating committees.\n\n  \nThe initial Directors were recruited by a Committee Chaired by the Chief Justice and included the Mayor of Summerside and the Mayor of Charlottetown.  Over time, the composition changed",
  "theme": "09-community-civic"
 },
 {
  "slug": "agric-2004-1",
  "title": "Agric-2004-1",
  "summary": "Comprehensive briefing document on the Farm Equipment Fund initiative addressed to the Community Foundation executive. Don outlines the committee's work (led by himself, Dr. Tom Hall, Jack Cutcliffe, Henry Compton, and Tony Glencross), storage challenges at Orwell Corner, and recommends establishing a $250,000 endowment with $100,000 allocated for barn restoration, reflecting his strategic planning and institutional stewardship.",
  "content_preview": "Draft -  TIME \\@ \"MMMM d, yyyy\" September 9, 2005\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nSubject:\tFarm Equipment Fund\n\n\n\n\nBackground:\t\n\n\n\n\nFrom some time snow we have been talking with officials of the PEI Museum and Heritage Foundation about providing financial support for the recovery of early agricultural equipment, especially equipment manufactured on Prince Edward Island.  The initiative has a number of elements including:\n\nThe identification of artifacts\n\nRetrieval\n\nRestorati",
  "theme": "09-community-civic"
 },
 {
  "slug": "agric-2005-3",
  "title": "Agric-2005-3",
  "summary": "Executive briefing from Don addressing the Foundation's role in the Farm Equipment Fund initiative. He describes the core committee, storage needs for artifacts at Orwell Corner, renovation of the Stanley Barn, and recommends a $250,000 endowment ($100,000 for building). Emphasizes the Foundation's supportive role without direct fundraising involvement.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nDate:\t\tDraft -  TIME \\@ \"MMMM d, yyyy\" September 9, 2005\n\nTo:\t\tExecutive\n\nFrom:\t\tDon\n\nSubject:\tFarm Equipment Fund\n\n\n\n\n\n\n\nFrom some time snow we have been talking with officials of the PEI Museum and Heritage Foundation about the recovery of early agricultural equipment, especially equipment manufactured on Prince Edward Island.  The initiative has a number of elements including:\n\nThe identification of artifacts\n\nRetrieval\n\nRestoration/refurbishme",
  "theme": "09-community-civic"
 },
 {
  "slug": "annual-press-release",
  "title": "Annual - press release",
  "summary": "Press release reporting CFPEI's solid 2006 performance: 10 new endowments added, over 10% investment return, and year-end fair market value of $866,866.80. Highlights major 2006 events including a July 4 reception for American summer islanders and establishment of new funds (David A. Mackay health fund, Summer Islanders Legacy Fund, Living Memorial Trust). President Norman Carruthers acknowledges board, volunteers, and donors.",
  "content_preview": "Press release\n\n\n\n\nCOMMUNIITY FOUNDATION REPORTS SOLID INVESTMENT RETURNS\n\n\n\n\nThe Community Foundation of Prince Edward Island wrapped up another successful year.  At the annual meeting, the President, Norman Carruthers, reported the addition of 10 new endowments in 2006 and a return on investment of over 10 percent.  The total Fair Market Value of the Consolidated Trust fund at year end was $866,866.80.\n\n\n\n\nOne of the major events held in 2006 was a reception on July 4 for American Summer Island",
  "theme": "09-community-civic"
 },
 {
  "slug": "annual-report-2004",
  "title": "Annual Report 2004",
  "summary": "CFPEI Annual Report for 2004 identifying Don Glendenning as Past President on the Board of Directors and noting his role on the Arts & Heritage Stabilization Board. Reports $32,000+ in grants, successful proposal-writing workshops, and financial returns of 7.7%. Lists Dr. Donald & Carol Glendenning and Janet Glendenning among donors, further documenting the family's philanthropic engagement.",
  "content_preview": "The\nCommunity Foundation of Prince Edward Island\n\n\nAnnual\nReport - 2004\n\n\n\n\n\n\n\n\nSuite 105, 119-121 Queen Street, Charlottetown, PE C1A 4B4\n\n\nTel: (902) 368 3440; Toll Free 1 800 566 7307;\nFax 892 0880; E mail \u0007\u0003\b\n\n\nCharitable Numbers: Canada #: 890011190RR001, US IRS #:30-0050801\n\n\n\n\n\n\n\n\nPresident’s\nMessage\n\n\nA.\nJohn Robinson\n\n\n\n\n\n\n\n\tThe\nCommunity Foundation of Prince Edward Island (Foundation) is pleased\nto report a great year of progress and development.  I would like to\nmake particular mentio",
  "theme": "09-community-civic"
 },
 {
  "slug": "annual-report-9",
  "title": "Annual Report - 9",
  "summary": "CF-PEI Annual Report 2005 documenting institutional achievements including scholarship awards, increased US donations, positive mid-term arts review, and establishment of new funds. Don Glendenning identified as Past President.",
  "content_preview": "The\n\tCommunity Foundation of Prince Edward Island\n\t\n\t\n\n\t\n\n\n\t\n\t\nPresident’s\n\tMessage\n\t\n\n\n\n\t\n\t\nI\n\twould like to acknowledge especially, the personal and financial\n\tsupport of Directors; first awards from The Dr. Donald K. Taylor\n\tFund and The PEI Association of Architects Scholarship Funds; the\n\tincrease in donations to Island arts and cultural organizations from\n\tUS citizens; a positive mid‑term review of the Arts &\n\tHeritage Stabilization Program; a return of 8.3% for our funds under\n\tmanagement",
  "theme": "09-community-civic"
 },
 {
  "slug": "art-collection-1",
  "title": "Art collection-1",
  "summary": "Specialized donation agreement template for art collection donations to the Community Foundation. Establishes legal terms for accepting, safeguarding, and managing art donations. Demonstrates the Foundation's capacity to handle specialized asset classes beyond cash donations. The inclusion of art collection templates reflects Don's sophisticated understanding of nonprofit administration and asset management across diverse donation types, extending the Foundation's reach beyond conventional financial contributions.",
  "content_preview": "18/02/2026\n\n\tInterest fund\n\n\n\n\t)\n\n\t\n\n\t\n\n\n\t\n\n\n\n\n\n\n\n\n\n\n\nCOMMUNITY\nFOUNDATION OF PRINCE EDWARD ISLAND\n\n\n119-121\nQueen St., Charlottetown,\n\n\nPrince\nEdward Island, C1A 4B3\n\n\n\n\n\n\n\nPhone:\n902-892-3440   Fax: 902-892-0880   Email:\nfoundation@cfpei.ca\n\n\n\n\n\n\n\nCharitable\nRegistration: Canada-890011190 RR0001; USA- 30-0050801\n\n\n\n\n\n\nI,\n _______________  _____________(the Donor), hereby agree to transfer\nto the Community Foundation of Prince Edward Island (the Foundation)\nmy personal collection of cultural ob",
  "theme": "09-community-civic"
 },
 {
  "slug": "barbara-mcinnis",
  "title": "Barbara McInnis",
  "summary": "Letter dated August 14, 2007, from Don Glendenning to Barbara McInnis addressing her book on community foundations. Don provides thoughtful observations on asset-building challenges in small communities, out-migration of young entrepreneurs, and competitive fundraising landscape dominated by universities, hospitals, and cultural institutions. He emphasizes community foundations' overlooked leadership role in convening stakeholders to solve problems and advocates for viewing them as essential community infrastructure. References his international development experience and explores how community foundations might serve international development contexts.",
  "content_preview": "Date:\t\tAugust 14, 2007\n\n\n\n\nTo:\t\tBarbara McInnis\n\n\n\n\nFrom:\t\tDon Glendenning\n\n\n\n\nSubject:\tCommunity foundations\n\n\n\n\nGreetings from Prince Edward Island.\n\n\n\n\nI am not sure that I have any observations of value when writing your book but here are a few comments: \n\n\n\n\nFirst let me point out some of the unique problems of asset building in a small community and small province.  It is likely that many of this same problems exist in other remote communities in this country and countries as well.\n\n\n\n\nHea",
  "theme": "09-community-civic"
 },
 {
  "slug": "bell-canada-fund",
  "title": "Bell-Canada Fund",
  "summary": "Letter from Don Glendenning as Director of CFPEI to Claude and Bernice Bell proposing a Canada History Fund ($100K goal) to promote Canadian history education through schools and public events. Don references the Dominion Institute's survey on Canadian history teaching and positions CFPEI's mission to \"connect people who care with causes that matter.\" Demonstrates Don's educational advocacy and philanthropic leadership.",
  "content_preview": "Claude and Bernice Bell\n\n200 Hillsborough Street\n\nCharlottetown, PE C1A 4W9\n\n\n\n\nDear:\n\n\n\n\nRecently the media reported the results of a survey by the Dominion Institute as to the state of teaching of Canadian history in our schools.  The release of the report triggered a couple of editorials and a number of letters in the local media and, while the Dominion Institute report spoke only about the public schools, the issue really reaches beyond the school system..\n\n\n\n\nWe, the Community Foundation of",
  "theme": "09-community-civic"
 },
 {
  "slug": "bell-starter-funds-letter",
  "title": "Bell-Starter Funds- letter",
  "summary": "Letter from Don Glendenning introducing CFPEI to prospects, emphasizing the foundation's unique role as a public foundation on PEI and its experience establishing 40+ endowments. Don discusses community foundations' focus on perpetual endowments, their convener role (citing $800K channeled to arts over 4 years), and the importance of legacy planning. The letter showcases Don's deep commitment to building charitable infrastructure on the island.",
  "content_preview": "Starter Funds\n\n\n\n\nAs a follow-up to earlier conversations, I wanted to provide you with some detailed information about the Community Foundation of Prince Edward Island and also let you know of a new initiative to build a charitable legacy over a period of years.  First, however, let me say a few things about community foundations.\n\n\n\n\nOR\n\n\n\n\nThis letter comes to introduce you to the Community Foundation of Prince Edward Island\n\n\n\n\nCommunity foundations are unique in that they focus on endowment",
  "theme": "09-community-civic"
 },
 {
  "slug": "black-draft-letter",
  "title": "Black, Draft letter",
  "summary": "Draft letter from Don to Professor Roger Black following a pre-Christmas breakfast, highlighting CFPEI's 2008 achievements (60K+ grants, 160+ endowments nationally). Don discusses Black's potential legacy related to his UPEI teaching career, visual arts collection, and faculty support, positioning CFPEI as the mechanism for a lasting contribution. Demonstrates Don's personalized approach to philanthropic relationships and his ability to reflect donors' values.",
  "content_preview": "Dear Roger:\n\n\n\n\nI enjoyed our pre-Christmas breakfast and being updated on your most recent trip to Ottawa; I trust that you are none the worse for having overnighted in your car in Gagetown, New Brunswick.  Our discussions also included the work and progress of the Community Foundation of Prince Edward Island and it is about that topic that I write this letter.\n\n\n\n\nI am sorry that you did not receive your invitation to our awards night on August 20, 2008.  I was out of Province at the time but ",
  "theme": "09-community-civic"
 },
 {
  "slug": "board-restructuring",
  "title": "Board Restructuring",
  "summary": "Extended board restructuring proposal from Don outlining CFPEI's evolution from Level 1 to Level 2 community foundation, with Level 3 aspirations. Proposes recruiting directors capable of chairing committees and becoming president. Recommends lower average director age and gender balance. Details committee structure: Executive (administration), Special Projects/Initiatives (YIP, vital signs, community building), Development (endowment-focused with professional fundraiser), and Advisors (group of 7 well-respected citizens meeting annually). Discusses Board recruitment committee with external chair, formal orientations, and three-year community member terms with possibility of rotation. Emphasizes that service to community through special initiatives deserves higher priority than previously assigned.",
  "content_preview": "BOARD RESTRUCTURING\n\n\n\n\nAs part of our plan to grow the Foundation, we need a strategic plan for recruitment, development and recognition of directors and committee members.  The first step, obviously, is to clarify our longer term vision of the Foundation.  While we accomplish much of that through building of endowments, our inroads into the community will come through service.\n\n\n\n\nWe are moving, I would say have moved, from a Level 1 community foundation to level two and have our vision set on",
  "theme": "09-community-civic"
 },
 {
  "slug": "brochure",
  "title": "Brochure",
  "summary": "Draft marketing brochure distinguishing between donations and legacy giving. Explains donation concept (existing organization, one-time, used immediately) vs. legacy concept (perpetuity, organizational planning, long-term revenue stream, memorial/remembrance). Lists reasons to choose CFPEI: island-based, professional investment, managed by known people, confidentiality, safety, perpetuity, flexibility, low fees, positive investment record, 20-year service record, experienced staff. Provides sample will clauses for establishing endowments and emphasizes free consultation to help donors maximize impact.",
  "content_preview": "Philanthropy\n\n\n\n\nDonation:\n\nExisting cause or organization\n\nOne time\n\nUsed now\n\n\n\n\nLegacy:\n\n\n\n\nPerpetuity\n\nAllows organization to plan\n\nLong term revenue stream\n\nProvides for emerging needs\n\nA memorial\n\nAn act of remembrance\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nResources:\n\nCall Jeniene at:\n\n\n\n\nCFPEI Name and address\n\n\n\n\nLeaving a Legacy\n\n\n\n\n1  Decide on your causes:\n\nEducation\n\nYour church\n\nFavourite charities?\n\nEnvironment\n\nIn memory of…\n\n???\n\n\n\n\n2  Develop a giving plan\n\n\n\n\nContact Foundation for help \n\nExperience",
  "theme": "09-community-civic"
 },
 {
  "slug": "campbell-and-chapman",
  "title": "Campbell and Chapman",
  "summary": "Letter from Don Glendenning to potential donors in Souris area (Mildred Campbell, Cyril Chapman) introducing CFPEI's services and emphasizing community foundation benefits: endowment focus, community orientation, legacy preservation, and volunteer management. Don notes CFPEI's experience (60+ endowments, $1.5M assets) and flexibility in designing charitable legacies to reflect donor interests.",
  "content_preview": "Mildred Campbell, Knights Lane, 687-2313, Souris, retired school teacher, was on HC Board, \n\nCyril Chapman, Chapman construction,; brother Buddy was killed in accident in Nova Scotia; 687-2328\n\n\n\n\nDear…\n\n\n\n\nThis letter comes to introduce you to the Community Foundation of Prince Edward Island and to seek an opportunity to discuss the services we offer.  While the Foundation may not be well-known, we have been making grants to organizations in the Souris area for a number of years. Margaret Ching",
  "theme": "09-community-civic"
 },
 {
  "slug": "capacitybuilding",
  "title": "CapacityBuilding",
  "summary": "Strategic proposal authored by Don Glendenning outlining the Community Foundation's capacity-building initiative for the charitable sector. Conducted 2001 survey identifying organizational needs: fiscal sustainability, community profile, volunteer recruitment, board development, and training. Document distinguishes community capacity building (focusing on collective community needs) from institutional strengthening. Proposes customized support through HRD coaching, technical assistance, training workshops, networking, and special-purpose grants. This work demonstrates Don's leadership in strategic nonprofit development and community-focused philanthropy during his time with CFPEI.",
  "content_preview": "Community Foundation of Prince Edward Island\n\n119-121 Queen St, Suite 105\n\nCharlottetown, PEI  C1A 4B3\n\n\n\n\nAdding Value to our Communities\n\n\n\n\nBackground\n\n\n\n\nThe Community Foundation of Prince Edward Island (CFPEI) was incorporated in 1993 and has a Revenue Canada charitable tax number (89001 1190 RR 001) and a charitable tax number for the USA. ( 30-0050801).  CFPEI is one of 140 community foundations in Canada.  It has a Provincial mandate and is governed by 12 Directors from across the Provin",
  "theme": "09-community-civic"
 },
 {
  "slug": "card-friend",
  "title": "Card-Friend",
  "summary": "Gift card announcing memory tree planting in recipient's name through Living Memorial Trust at CFPEI. Notes trees serve as tributes while enhancing environment, providing wildlife shelter, reducing erosion, improving air quality. Explains trees can be planted in any public green space including Confederation Trail, school grounds, parks, hospital grounds. References Dr. Charles Keuper family's establishment of trust. Includes CFPEI contact information and design credit to Valerie Ford.",
  "content_preview": "Memory Trees\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory trees are planted to\nremember  a person, place or event.   But they are more than just a\ntribute, memory trees enhance and beautify our environment, provide\nshelter for our wildlife, reduce erosion and improve the quality of\nthe air we breathe.  As part of our public spaces, memory trees bring\ncomfort, hope and peace to visitors and ensure that generations to\ncome will know the beauty of a green plant.  \n\n\n\n\n\n\n\n\n\nMemory trees are a component of\na Living Memorial",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-100",
  "title": "CFPEI 100",
  "summary": "Final newsletter (No. 100) by Don Glendenning as editor of Community Foundation News. Reflects on PEI's special qualities and the generosity of Islanders witnessed over 40 years of residence. Discusses causes that matter including landscape maintenance, youth development, healthcare, and community improvement. Explains CFPEI's role as community agent enabling donors to create lasting impact. Lists major foundation funds including MacKay Family (cardiac response), Jessie Drummond (youth public speaking), James and Louise Wilmot (Souris healthcare), Keuper family (landscape), Bryenton (Ghiz park), MacDonald (school libraries), Robinson family, Taylor memorial, and Glendennings (home community support). Glendenning notes this is his final issue as editor.",
  "content_preview": "Community\n\tFoundation News\n\t\n\n\n\n\t\n\t\nNo.\n\t100\t\t\t\t\t\t\t\tAugust 10, 2009\n\t_______________________________________________________________________\n\n\n\n\n\n\n\t\n\t\nPeople\n\twho care\n\t\n\n\n\n\t\n\t\nPrince\n\tEdward Island is a great community.  So great, in fact, that some 40\n\tyears ago, I chose it as my home.  The Island is a special place; it\n\tworks its magic on Islanders and visitors alike.  I saw the magic at\n\twork on newly-hired staff at Holland College; with a neighbour from\n\tFlorida who fell in love with the Is",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-2013",
  "title": "CFPEI 2013",
  "summary": "Letter dated August 23, 2013 from Don Glendenning to CFPEI President Tom Davies describing the Glendenning Family Fund (established in memory of Elmer and Jane Watling Glendenning of Black River Bridge, NB). Fund began with a $5,000 goal and has grown to approximately $17,000 with a new target of $25,000. When fund reaches $25,000, it will convert to the Glendenning Scholarship supporting postsecondary students from Black River Bridge. Eligible institutions: UNB, University de Moncton, Mount Allison, Saint Thomas, NB Community College (excluding private institutions). Reserves right to make grants for special projects upon family advisory committee approval (Don, Lois Anne Glendenning Gregan, and Janet Glendenning).",
  "content_preview": "August 23, 2013\n\n\n\n\nTom Davies, President\n\nCommunity Foundation of Prince Edward Island\n\nSuite 105, 119-121 Queen St.\n\nCharlottetown PE, C1A 4B3\n\n\n\n\nDear Mr. Davies\n\nGlendenning Family Fund\n\n\n\n\nAs you know, the Glendenning Fund was set up a few years ago in memory of Elmer and Jane (Watling) Glendenning and to honour their contributions to their community, Black River Bridge, New Brunswick.  Since its inception, grants have been made for a variety purposes including books to Miramichi Rural Scho",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-25",
  "title": "CFPEI 25",
  "summary": "Newsletter No. 25 (May 18, 2005) uses the metaphor of a \"Superstore for Donors\" to describe CFPEI's multi-purpose approach versus traditional single-purpose charities. Don contrasts superstores' one-stop convenience with CFPEI's ability to address diverse community needs. The newsletter showcases his talent for making complex philanthropic concepts accessible through relatable analogies and emphasizes putting donors' interests first.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 25\t\t\t\t\t\t\t             May 18, 2005\n\n\n\t\n\t\nA Superstore for Donors\n\t\n\n\n\n\t\n\t\nA few\n\tdays ago while waiting to have my car serviced, I noticed the\n\tmessage on the sign of a nearby realty office.  It read “Realty\n\tSuperstore”.  It struck me that a community foundation is also a\n\tsuperstore – a “Superstore for Donors” \n\t\n\t\n\n\n\n\t\n\t\nSuperstores\n\tand one-stop shopping are common in North America.  No longer do\n\toutlets limit themselves to one line of service",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-33",
  "title": "CFPEI 33",
  "summary": "Newsletter edition featuring CFPEI's fund portfolio and values, emphasizing that philanthropy is accessible to all donors regardless of wealth. Lists 20+ funds under management with a portfolio fair market value of $613,245.63 as of June 2005, including the Glendenning Family Fund. Advocates for endowment building as a simple way to create lasting legacies through systematic contributions.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 33\t\t\t\t\t\t\t      October 10 , 2005\n\n\nCFPEI\n\tFunds under Management\n\t\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\tFair\n\t\t\t\t\tMarket Value of Funds\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\n\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t2005-06-01\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\tUnrestricted\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\n\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t\n\n\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\n\n\t\t\t\t\t     Community\n\t\t\t\t\tFund\n\t\t\t\t\t\n     Eric\n\t\t\t\t\tG Robinson Fund \n\t\t\t\t\t\n\t\t\t\t\t\n     Fund\n\t\t\t\t\t#1\n\t\t\t\t\t\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\nInterest\n\t\t\t\t\tFunds\n\t\t\t\t\t\n     Foundation\n\t\t\t",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-36",
  "title": "CFPEI 36",
  "summary": "Describes a heritage preservation initiative led by Don Glendenning, George Wright, Jack Cutcliffe, Dr. Tom Hall, Henry Compton, Tony Glencross, and Tom LeClair to document and preserve Island-made farm equipment. Reports establishing an Agricultural Heritage Fund endowment with Paul H. Schurman as lead, supported by Warren Ellis (Prince County), Norman MacDonald (Queens County), and Clayton Bulpitt (Kings County). Demonstrates Don's active engagement in cultural heritage conservation beyond traditional philanthropy.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.36\t\t\t\t\t\t\t    December 10, 2005\n\n\n\tAn update\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nIssue\n\tNo. 2 (June 18, 2004) of the Community Foundation News carried the\n\tabove photo of an Island-made Hall thresher.  In brief, the thresher\n\tbelonged to John MacQuarrie, was uncovered by Hurricane Juan, was\n\trescued by Tony Glencross and Tom LeClair and is now in dry storage.\n\t \n\t\n\t\n\n\n\n\t\n\t\nIts\n\trecovery, and that of some other pieces of Island agricultural\n\thistory as well, s",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-48-us-reception",
  "title": "CFPEI 48- US Reception",
  "summary": "Community Foundation newsletter (No. 48) reporting on the inaugural US Citizens Day reception held July 4, 2006 at Haviland Club. Over 100 US citizens from multiple states attended to be welcomed to PEI and thanked for their community contributions. Don Glendenning edited and published the informal newsletter as a \"letter from a friend.\"",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 48\t\t\t\t\t\t      \t\tJuly 8, 2006\n\n\n\t\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nUS\n\tCitizens’ Day Reception Held\n\t\n\n\n\n\t\n\t\nA\n\tcapacity crowd of US citizens was in attendance at Haviland Club to\n\tlaunch the first US Citizens Day reception sponsored by the\n\tCommunity Foundation of Prince Edward Island on July 4.  Those in\n\tattendance hailed from Illinois, Maryland, Maine, Massachusetts,\n\tConnecticut, New York, Iowa, New Mexico, Colorado, Florida and South\n\tCarolina ",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-50-mackay-fund",
  "title": "CFPEI 50-MacKay Fund",
  "summary": "Community Foundation News No. 50 announcing official launch of David A. MacKay Endowment Fund in Summerside on August 5, 2006, with John Robinson (CFPEI President), Judy MacKay, Kim MacKay, Debbie Grubbe, and Phil Grubbe in attendance. Fund honors David A. MacKay, Island-born entrepreneur with successful Canadian/US business career. MacKay's greatest passion was building MacKay and Hughes of Toronto into North America's largest fresh potato distributor. Fund income supports grants for improving public awareness, training, and equipment for cardiac emergency response. Fund created following MacKay's 2002 cardiac stress on golf course in PEI; he died at O'Leary Hospital. Robinson thanked family for unique healthcare contribution, noting community foundations support quality-of-life aspects and specialize in donor-interest responses. CFPEI administers 25 endowments reflecting diverse community and donor interests.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  50\t\t\t\t\t\t                     August 19, 2006\n\n\n\t\n\n\n\t\n\t\nDavid A. MacKay Fund Launched\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nThe\n\tDavid A. Mackay Endowment Fund was officially launched in\n\tSummerside, PEI on August 5, 2006.  On the left above is John\n\tRobinson, PEI and members of the Mackay family, Judy MacKay, Kim\n\tMacKay, Debbie Grubbe and Phil Grubbe.\n\t\n\n\n\n\t\n\t\nFamily\n\tand friends of the late David A. Mackay gathered in Summerside on\n\tAugust 5, 2006 to formally ann",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-51-jessie-drummond-fund-us-flow-through",
  "title": "CFPEI 51 -Jessie Drummond Fund & US Flow-through",
  "summary": "Community Foundation News No. 51 announcing establishment of Jessie Drummond Public Speaking Award Fund by her son Stuart Drummond to recognize \"Best Overall First Time Speaker\" annually at PEI United Church Youth Public Speaking Competition. Jessie Drummond, schoolteacher and UCW member, believed public speaking was critical child development skill. Fund honors her dedicated commitment. Newsletter credits Ricky Dalton (Red Rock Servers) for website updates including photo gallery, media releases, and scholarship descriptions/applications. Also provides recap on accessing IRS charitable number (#30-0050801) for US citizens: donors contribute in US or Canadian funds, inform CFPEI of intended organization, receive US dollar receipt at exchange rate on conversion day, CFPEI deposits in Canadian dollars, deducts 1.5% administration fee (minimum $15), and issues check to designated charity.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  51\t\t\t\t\t\t                 September 6, 2006\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nJessie Drummond Fund\n\t\n\n\n\n\t\n\t\nWe\n\tare pleased to announce the establishment of the Jessie Drummond\n\tPublic Speaking Award Fund.  The\n\tpurpose of the Fund\n\testablished by her son, Stuart Drummond, is\n\tto provide an award annually to recognize the contestant achieving\n\tthe designation of “Best Overall First Time Speaker “at The PEI\n\tUnited Church Youth Public Speaking Competition. \n\t\n\t\n \n\t\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-53-summer-islanders",
  "title": "CFPEI 53 -Summer Islanders",
  "summary": "Published in October 2006, this newsletter describes CFPEI's initiative to establish a Summer Islanders Legacy Fund targeting seasonal residents from Canada and the USA who return annually to PEI. The foundation promoted this with a July 4 reception for US citizens and an August advertisement. The Summer Islanders Fund supports landscape, arts, heritage, genealogy, health, environment, and education initiatives. The newsletter outlines plans for 2007 including a second US Citizens' Day Reception (led by Garth Staples), a summer social, and summer lecture series. This reflects Don's vision for leveraging non-resident wealth to support PEI community development and his inclusive approach to philanthropic engagement.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 53\t\t\t\t\t              \t         October 6, 2006\n\n\n\tSummer Islanders Activities\n\t\n\n\n\n\t\n\t\nIn\n\tdiscussing our mission, to improve the quality of life on Prince\n\tEdward Island, we noted that PEI provides a summer home for many\n\tpeople whose full-time residence is elsewhere.  \n\t\n\t\n\n\n\n\t\n\t\nSummer Islanders\n\tare visitors who spend time on the Island on a regular basis and who\n\tthink that PEI is a special corner of the world.  They may come from\n\tany corner ",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-54-imagine",
  "title": "CFPEI 54-Imagine",
  "summary": "This October 2006 newsletter addresses misconceptions about endowments, explaining that they need not require large sums and can be built over time. Don provides concrete examples: $1,000 annually for five years generates $200 perpetual grants, life insurance policies offer tax deductions, and stock donations save taxes. He emphasizes CFPEI's accessibility and volunteer-managed board of PEI-based directors, promoting the foundation's one-percent annual administration fee as unbeatable. This educational approach demonstrates Don's commitment to democratizing philanthropy and making charitable giving accessible to islanders of modest means, reflecting his leadership philosophy at Holland College and beyond.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 54\t\t\t\t\t\t                   October 27, 2006\n\n\n\t\n\n\n\t\n\t\nImagine an Endowment \n\t\n\t\n\n\tWith Your Name on It\n\t\n\n\n\n\t\n\t\nBut,\n\tyou say, endowments are only for folks with lots of money – and\n\tthat’s not me.  At least, that may be the impression you get when\n\tendowments are announced.\n\t\n\n\n\n\t\n\t\nLet’s\n\tstart with the question, “How much money does one need to\n\testablish an endowment?  The short answer is, “It depends upon\n\twhat you want to do.” Endowments may ",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-57-christmas",
  "title": "CFPEI 57-Christmas",
  "summary": "This December 20, 2006 issue is brief, featuring a correction to the previous newsletter's photo caption and a holiday message from Don and CFPEI. The message thanks the foundation family for a successful year, acknowledges islanders' gifts of time and talent, extends best wishes for health and peace, and closes with a paraphrased Gandhi quote: \"We must be the change we wish to see in the world.\" The brief holiday message reflects Don's thoughtful leadership voice and his connection of community philanthropy to broader principles of social change and personal responsibility.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. \t57\t\t\t\t\t       \t    December 20, 2006\n\n\n\t\n\n\n\t\n\n\n\n\n\t\n\n\t\nThe\n\tFoundation Family at our annual Christmas luncheon at the\n\tCharlottetown Hotel\n\t\n\n\n\n\t\n\n\n\n\tCorrection\n\t\n\n\n\n\t\n\t\n\n\n\t\nThis\n\tphoto appearing in the last issue should have read:  Norman\n\tCarruthers with Jocelyn LaPorte of Students Against violence\n\tEverywhere.  My apologies\n\t\n\n\n\n\t\n\t\n_______________________________________\n\t\nThe\n\tCommunity Foundation News is an informal newsletter, in electronic\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-58-rev-cumberland-wi",
  "title": "CFPEI 58(Rev) Cumberland WI",
  "summary": "January 2006 Community Foundation News newsletter (No. 58, edited by Don Glendenning) describing the Cumberland-Rocky Point Women's Institute Legacy Fund. The fund, established through the sale of a historic school building, provides perpetual support for literacy in local elementary schools. Shows Don's editorial role promoting community philanthropy and institutional memory.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 58\t(Rev)\t\t\t\t              \t       January 12, 2006\n\n\n\tSupport for Literacy Lives On\n\t\n\n\n\n\t\n\t\nThe\n\tRocky Point School has a long and proud history of service to the\n\tyoung people of the area. But times change and, instead of trudging\n\talong the road to the local school, students now hop on a bus at the\n\tend of their driveway and are whisked to a school elsewhere.  And\n\tthat story is repeated in most small communities throughout rural\n\tCanada.\n\t\n\n\n\n\t",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-59-changing-the-face-of-charity",
  "title": "CFPEI 59-Changing the face of charity",
  "summary": "This January 2006 newsletter provides strategic analysis of community foundations' role in reshaping Canada's charitable sector. Don features CFPEI President Norman Carruthers explaining how community foundations differ from traditional charities by addressing broad community needs across all sectors. He details CFPEI's impact: a $100,000 Challenge Grant to 50 organizations for capacity building, scholarship programs, and emergency response initiatives. Don emphasizes donors' growing desire to customize donations and the foundation's flexibility in responding to varied charitable interests (literacy, medical emergencies, scholarships, area-specific funds). The low one-percent administration fee is highlighted as enabling donor accessibility.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 59\t\t\t\t\t\t                   January 26, 2006\n\n\nReshaping\n\tthe charitable sector\n\t\n\n\n\n\t\n\t\nCommunity\n\tfoundations have reshaped the charitable sector across Canada and\n\tthe effects are being felt in Prince Edward Island.  So says Norman\n\tCarruthers, President of the Community Foundation of Prince Edward\n\tIsland.\n\t\n\n\n\n\t\n\t\nMost\n\tcharitable organizations are focused on the needs of a particular\n\tsegment of the community such as health, the local hospital",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-61-beach-tennis-fund",
  "title": "CFPEI 61 Beach Tennis Fund",
  "summary": "February 2007 newsletter documenting the Beach Tennis Club's establishment of an endowment fund to honor founders Gordon and Helen MacDonald. The club, founded 30 years prior in Stanhope to serve summer residents, sold its land and created the Beach Tennis Club Endowment with CFPEI. Grants from the fund provide annual prizes to top junior tennis players through Sport PEI. Don includes a photo of Norman Carruthers (CFPEI President), Dr. Doug Cudmore (Beach Tennis Club President), and David Campbell (Club Secretary) signing the agreement. David Campbell recalls the club's role as a gathering place for all ages, illustrating how Don connects recreational community institutions with lasting philanthropic legacies.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 61\t\t\t\t\t\t                  February14, 2007\n\n\n\t\n\n\n\t\n\t\n\n\n\t\nNorman\n\tCarruthers, President of CFPEI, with Dr. Doug Cudmore, President of\n\tthe Beach Tennis Club and David Campbell, Secretary of the Club\n\t\n\n\n\n\t\n\t\nThirty\n\tyears ago, Gordon and Helen MacDonald were among the founders of The\n\tBeach Tennis Club, Inc. in Stanhope, for the benefit of the many\n\tsummer residents in the area. Gordon gave lessons to many junior\n\tmembers at the time the Club began,",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-62-fund-totals-2006",
  "title": "CFPEI 62 Fund totals 2006",
  "summary": "February 2007 newsletter announcing 2006 year-end results showing portfolio growth from $626,376 to $866,867 (increase of $240,491). The foundation administered 32 funds (up from 22), demonstrating institutional expansion. Don highlights notable new funds including David Mackay Fund (cardiac emergencies), Hesta MacDonald Legacy Fund (school libraries), Cumberland Rocky Point WI Fund (literacy), Upson Fund (first US summer resident fund), and Summer Islanders Legacy Fund. The newsletter includes detailed fund allocations and closing remarks expressing gratitude for community support. This document provides concrete evidence of Don's stewardship during significant institutional growth and diversification.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  62\t\t\t\t\t\t         \t     February 23, 2007\n\n\n\t\n\n\n\t\n\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t31-Dec-06\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\tCommunity\n\t\t\t\tFoundation of PEI Consolidated Trust Fund Allocation and\n\t\t\t\tValuation\n\t\t\t\n\t\t\t\n\n\t\t\t\tPH&N\n\t\t\t\t2006 Yr End FMV + Funds in Transit\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t \n\t\t\t\n\t\t\t\n\n\t\t\t\t$866,866.80\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-64-scholarships",
  "title": "CFPEI 64 - Scholarships",
  "summary": "March 2007 newsletter listing 2006 scholarship awards: Rae-Anne McCourt (Summerside Natick Hockey Scholarship to St Thomas University), Ryan Keefe (Orin Carver Scholarship to UPEI), Jessica Hutchinson (Joan Auld Scholarship to Kootenay School of the Arts), Christopher Dahn (Joan Auld Scholarship to Nova Scotia College of Art and Design), Andrea Gallant (Lowell Phillips Scholarship to UPEI), and Carolyn Doucette (Lorne and Ruby Bonnell Scholarship to Dalhousie). Don explains advantages of CFPEI scholarships over institutional awards: portability to out-of-province institutions, access to specialized programs unavailable on PEI, transferability between institutions, and flexibility for non-traditional studies. A photo shows David Carver presenting the Orin Carver Scholarship to Ryan Keefe.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  64\t\t\t\t\t\t                     March 30, 2007\n\n\nScholarships\n\tAwarded in 2006\n\t\n\n\n\n\t\n\t\nRae-Anne McCourt\n\tof Summerside was awarded the Summerside Natick Hockey\n\t\nScholarship\n\tto attend St Thomas University\n\t\nRyan Keefe of\n\tSummerside received the Orin Carver Scholarship to attend UPEI\n\t\nJessica Hutchinson\n\tof Bonshaw received the Joan Auld Scholarship to attend the\n\t\nKootenay\n\tSchool of the Arts\n\t\nChristopher Dahn\n\tof Cornwall received a Joan Auld S",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-65-granting",
  "title": "CFPEI 65 - Granting",
  "summary": "April 2007 newsletter detailing 2006 grants from CFPEI's unrestricted and restricted funds. Unrestricted grants supported organizational capacity building: PEI Rape/Sexual Assault Crisis Centre (policy manual), Girl Guides of Canada (governance), Canadian Parents for French (organizational governance), SAVE PEI (relationship violence radio spots), Learning Disabilities Association (governance workshop), and Canadian Red Cross (seniors survey). Restricted fund grants included Belfast Consolidated School and Miramichi Rural School library purchases. Don explains that the first six grants came from completely unrestricted funds, while the last two were constrained to specific purposes. The newsletter also calls for grant proposals (capacity building, $250 max) and lists 33 funds totaling nearly $1 million under foundation administration.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  65\t\t\t\t\t\t              \tApril 17, 2007\n\n\n\tGrants 2006\n\t\n\n\n\n\t\n\t\n\t\t\n\n\n\t\tThe PEI Rape/Sexual Assault Crisis Centre from undesignated\n\t\tfunds to upgrade a policy and procedures manual. \n\t\t\n\t\t\n\n\n\t\tGirl Guides of Canada - PEI Council from undesignated funds\n\t\tfor improving governance.\n\t\t\n\n\n\t\tPEI Canadian Parents for French from undesignated funds for\n\t\timproving organizational governance.\n\t\t\n\n\n\t\tSAVE PEI: Students Against Violence Everywhere (Montague\n\t\t",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-66-pei-als-society",
  "title": "CFPEI 66- PEI ALS Society",
  "summary": "April 2007 newsletter announcing CFPEI's partnership with the PEI ALS Society to administer $50,000 in fundraised assets. The society maintains ownership while CFPEI invests the funds within its portfolio. Don explains how community foundations (140+ in Canada) provide affordable administration for charitable organizations seeking professional fund management. Marie Salamoun-Dunne commended the foundation's service accessibility. The newsletter details ALS Society activities: supporting 6-9 residents annually through home visits, equipment provision, healthcare professional education, and national research contributions. The society's primary fundraiser is the \"Walk for ALS\" (June 16, 2007 at Oyster Bed Bridge), demonstrating Don's role in infrastructure building for health charities.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  66\t\t\t\t\t\t                        April 27, 2007\n\n\n\t\n\n\n\t\n\t\n\n\n\t\nMarie\n\tSalamoun-Dunne representing the PEI ALS Society and Norman\n\tCarruthers, President of CFPEI sign a partnership agreement for the\n\tmanagement of funds set aside to meet future needs of ALS on PEI.\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nFoundation\n\tto Administer ALS Funds\n\t\n\n\n\n\t\n\t\nThe\n\tALS Society of Prince Edward Island has concluded an agreement with\n\tThe Community Foundation of Prince Edward Island cove",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-67-agriculture-heritage",
  "title": "CFPEI 67 Agriculture Heritage",
  "summary": "May 2007 newsletter documenting a multi-year agricultural heritage project preserving PEI-made farm equipment. The initiative included Tony Glencross's initial survey, McNaught History Centre's \"Made in PEI\" report, donations to PEI Museum and Heritage Foundation (including a Hall thresher with original owner's production logs), and museum discussions about inventory and preservation. The project created an Agricultural Heritage Fund (established by Paul H. Schurman) and connected the PEI Association of Community Museums with private collectors. Conclusions identified storage space needs, significant undocumented island-made equipment, continuing inventory requirements, collector networking desires, and conservation assistance gaps. The fund promotion and network development demonstrate Don's commitment to cultural heritage preservation and community institution building.",
  "content_preview": "Community Foundation\n\tNews\n\t\n\n\t           \n\t\n\t\n\n\tNo. 67\t\t\t\t\t          \t   \t   \t May 12, 2007\n\n\n\n\tAgricultural Heritage Project\n\t\n\n\n\n\t\n\t\n\n\t\n\n\n\n\t\n\t\nIsland-made\n\tFarm Equipment\n\t\n\n\n\n\t\n\t\nThe\n\tabove photo, and a description of the initiative, appeared in the\n\tsecond issue of Community Foundation News dated June 18, 2004.  \n\tSince then:\n\t\n\n\n\n\t\n\t\n-\n\tTony Glencross conducted initial survey\n\t\n-\n\tMcNaught History Centre prepared Made\n\tin PEI, a\n\tpreliminary review of Island-made farm equipment.  The repor",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-72-souris-and-shrine-club",
  "title": "CFPEI 72 Souris and Shrine Club",
  "summary": "Newsletter No. 72 from August 18, 2007, showcases CFPEI's community impact and partnerships. The Souris Fund, established by an anonymous donor, awarded its first grant ($500) to Souris Regional High School Band for instrument purchases. A local committee was established to expand the fund. The newsletter also features the Island Shrine Club signing an agreement with CFPEI for a Managed Fund with initial contribution of $7,500. Don's editorial role demonstrates his involvement in publicizing Foundation initiatives that support local organizations, charitable trusts, and community development throughout PEI.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 72\t\t\t\t\t\t\t         August 18, 2007\n\n\n\t\n\n\n\t\n\t\nSouris Fund\n\t\n\n\n\n\t\n\t\n\n\n\t\nMargaret\n\tChing presents a cheque from the Community Foundation of Prince\n\tEdward Island in support of Souris Regional High School Band. \n\tAccepting the cheque on behalf of the band is Dimitri Boertien while\n\tthe Director, Doug Millington, looks on.\n\t\n\n\n\n\t\n\t\nThe\n\tfirst grant from the Souris Fund was awarded recently for the\n\tpurchase of band instruments at the Souris Regional High",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-73-living-memorial",
  "title": "CFPEI 73 Living Memorial",
  "summary": "Newsletter No. 73 from August 28, 2007, highlights the Living Memorial Trust established to honor Dr. Charles Keuper, a retired physician who worked to protect PEI's natural beauty. The trust funds plantings at public spaces, particularly trail entrances. A notable photograph shows Elinore (Mrs. Charles) Keuper and Don Glendenning standing beside the newly planted Island oak tree at Wood Islands' Confederation Trail entrance, depicting Don's active role in this environmental initiative. The article explains how living memorials enhance environment and wildlife habitat. Don's prominent involvement in this community project reflects his commitment to conservation and commemorative giving.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  73\t\t\t\t\t\t        \t          August 28, 2007\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nLiving\n\tMemorial Trust Established\n\t\n\n\n\n\t\n\t\nThe Wood Islands\n\tentrance to Trails PEI looks different today, and will be\n\tsignificantly different in 20 years, thanks to the planting of two\n\tclusters of native red oak trees.  The planting is the first\n\tinitiative of the Community Foundation of Prince Edward Island under\n\tthe newly established Living Memorial Trust from which grants will\n\tbe",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-74-rbc-donation-us-citizens-day",
  "title": "CFPEI 74 RBC Donation; US Citizens Day",
  "summary": "Newsletter No. 74 from September 22, 2007, reports on RBC Royal Bank's contribution to the Island Arts and Heritage Stabilization Program, with a photograph of Don Glendenning receiving a cheque from Patricia Williams and Mary MacInnis. The newsletter also announces the second annual US Citizens' reception at the Culinary Institute, with US Consul Elizabeth Swefler as speaker. The Agricultural Heritage initiative is highlighted, focusing on private collections of agricultural equipment. A board vacancy is noted following Bruce Lewis's departure to Yellowknife, with the Foundation seeking someone with accounting or financial background.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  74\t\t\t\t\t\t              September 22, 2007\n\n\n\t\n\n\n\t\n\t\nIAHSP Donation\n\t\n\n\n\t\n\n\n\n\t\n\t\nShown\n\tabove are Patricia Williams, on the left, and Mary MacInnis, on the\n\tright, of the RBC Royal Bank presenting a cheque to Don Glendenning\n\tof the Community Foundation of Prince Edward Island.  The\n\tcontribution is part of the RBC Royal Bank commitment to the Island\n\tArts and Heritage Stabilization Program.\n\t\n\n\n\n\t\n\t\nAgricultural Heritage Newsletter\n\t\n\n\n\n\t\n\t\nThe\n\tAg",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-75-souris-heallth-initiative",
  "title": "CFPEI 75, Souris Heallth Initiative",
  "summary": "Newsletter No. 75 from October 26, 2007, documents Don's involvement in addressing a community health concern. Don met with US summer visitors Jim and Louise Wilmot who expressed concerns about professional health coverage at Souris Hospital during summer months. This led to meetings with hospital staff, regional health authorities, and government officials to discuss recruitment incentives. Solutions discussed included scholarships for healthcare students, signing bonuses, and professional development assistance. Don's role in \"bringing together people for the purpose of solving community problems\" exemplifies his leadership approach at CFPEI. The newsletter also addresses the Foundation's policy on fundraising and endowments.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  75\t\t\t\t\t                               October 26, 2007\n\n\n\t\n\n\n\t\n\t\nHealth\n\tMeeting\n\t\n\n\n\t\nJim\n\tand Louise Wilmot (standing) Marilyn Barrett (seated on left) Chief\n\tNursing Officer, Community Hospitals and Continuing Care and JoAnn\n\tChisholm  (seated on right), a Director of CFPEI\n\t\n\n\n\n\t\n\t\nI\n\tfirst met Jim and Louise Wilmot at the reception for US citizens on\n\tJuly 4, 2006.  They live in Florida and have a summer home near\n\tSouris, PEI.  \n\t\n\t\n\n\n\n\t\n\t\nI",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-76-ed-lantz",
  "title": "CFPEI 76, ED, Lantz",
  "summary": "Newsletter No. 76 from November 14, 2007, announces Don MacDonald as the new Executive Director of CFPEI. MacDonald is island-born, a CGA graduate of Holland College and UPEI, with 28 years of government experience in auditing and finance. The newsletter also announces the establishment of the J. Gwenyth Lantz Memorial Fund in memory of Gwenyth Lantz, daughter of Mary and the late Rory Lantz. An anonymous donor expressed interest in funding grants for relief of needy persons in Eastern PEI, demonstrating the Foundation's evolving role in direct community assistance and charitable giving.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  76\t\t\t\t\t\t               November 14, 2007\n\n\n\t\n\n\n\t\n\t\nExecutive Director\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nCFPEI\n\tis pleased to welcome Don MacDonald to the position of Executive\n\tDirector.  He is Island-born, a graduate in accounting of both\n\tHolland College and UPEI and holds national recognition as a CGA. \n\tDon has been employed for 28 years with the Government of Prince\n\tEdward Island in the area of auditing, accounting and finance.\n\t\n\n\n\n\t\n\t\nIn\n\tadditio",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-77-2007-reception",
  "title": "CFPEI 77, 2007 Reception",
  "summary": "Newsletter No. 77 from December 2, 2007, documents the Foundation's awards reception held at the Arts Guild on November 14, 2007. Total grants of $20,000 were awarded to various scholarship funds and community organizations. Recipients included students receiving Lowell Phillips, Summerside-Natick Hockey, and Orin Carver scholarships. Significant grants went to the David A. MacKay Fund, various school funds, and community organizations including the Hesta MacDonald Legacy Fund and Cumberland-Rocky Point Women's Institute Legacy Fund. The event exemplifies CFPEI's community impact under Don's editorial direction, showcasing the Foundation's diverse grantmaking throughout PEI.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  77\t\t\t\t\t              \t      December 2, 2007\n\n\n\n\n\n\n\n\t\n\n\t\nNorman\n\tCarruthers with Wendy MacDonald and Shirley Jay representing PEI\n\tHome and School Assoc \n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\nRogers\n\tBell with Hilary Hanson and Nancy Connolly\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\nLisa\n\tBeck, David Carver and Jessica Fleming \n\t\n\t\nAwards 2007\n\t\nA\n\treception was held at the Arts \n\nGuild on November 14, 2007 to\n\tannounce Foundation awards for 2007.  Grants totaling $20,000 were\n\taward",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-79-best-wishes",
  "title": "CFPEI 79 Best wishes",
  "summary": "Newsletter No. 79 from January 6, 2008, is a brief seasonal greeting from Don Glendenning as editor. The message thanks the \"Foundation family\" of directors, staff, volunteers, and donors for another productive year and extends best wishes for 2008. A photograph shows attendees at the Foundation's annual Christmas luncheon held December 12, 2007, at the Charlottetown Hotel. The newsletter conveys gratitude and team spirit characteristic of Don's editorial voice, treating CFPEI as an extended community working together toward common charitable goals.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  79\t\t\t\t\t                           January 6, 2007\n\n\n\n\t\n\n\n\t\n\t\n\n\n\t\nFoundation\n\tFamily at our Annual Christmas Luncheon\n\t\nDecember\n\t12, 2007 at the Charlottetown Hotel\n\t\n\n\n\n\t\n\n\n\n\t\n\nGREETINGS\n\t\tto readers scattered across the continent most of whom have an\n\t\tIsland connection\n\t\n\t\n\n\n\n\t\n\t\n\t\t\n\nTHANKS\n\t\tto the Foundation family, Directors, staff, volunteers  and donors\n\t\tfor another good year\n\t\n\t\n\n\n\n\t\n\t\n\t\t\n\nBEST\n\t\tWISHES\n\t\tto  all for 2008\n\t\n\t\n Don\n\tGlend",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-80-who-gives",
  "title": "CFPEI 80 Who gives",
  "summary": "Newsletter No. 80 from January 22, 2008, explains CFPEI's funding model and acknowledges various donors. The newsletter distinguishes community foundations from traditional charities, emphasizing endowment building and donor-driven grants. Examples of donors include the Cumberland Rocky Point Women's Institute, Dr. Hesta MacDonald (established a library fund), Joan Auld scholarship supporters, Dr. Lorne Bonnell, US visitors, and families memorializing deceased loved ones through the Living Trust. This educational piece, edited by Don, demonstrates his commitment to explaining the Foundation's philanthropic philosophy and celebrating the generosity of diverse supporters.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  80\t\t\t\t              \t\t       January 22, 2008\n\n\n\tWho Gives to CFPEI?\n\t\n\n\n\n\t\n\t\nReaders\n\tmay wonder about CFPEI finances; they know students who received\n\tscholarships and groups, maybe even theirs, who received grants -\n\tbut nobody stops at the door looking for donations.  How does CFPEI\n\tdo it?\n\t\n\n\n\n\t\n\t\nCommunity\n\tfoundations are different from other charitable organizations in a\n\tnumber of ways; (1) They make grants to charities, not to\n\tindividu",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-81-island-heritage",
  "title": "CFPEI 81 Island Heritage",
  "summary": "Newsletter No. 81 from March 2008, welcomes Lou Ann Thomson as a new CFPEI director. Thomson, born on PEI, transitioned from nursing to law and retired from Halifax Legal Aid Services. She serves as chair of the PEI Human Rights Commission and board member of Roma at Three Rivers historical recreation. The newsletter also provides substantial information about the Government of PEI's Heritage study, listing public hearing dates and locations across the province. Don's editorial encourages Island residents and summer visitors to participate in heritage consultations, reflecting the Foundation's broader commitment to cultural preservation and community engagement beyond pure grantmaking.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  81\t\t\t\t\t              , 2008\n\n\n\t\n\n\n\t\n\t\nOur Newest Director\n\t\n\n\n\t\nLou\n\tAnn Thomson\n\t\n\n\n\n\t\n\t\nWe\n\twelcome Lou Ann Thomson as a Director of the Community Foundation of\n\tPrince Edward Island.  Lou Ann was born in Prince Edward Island,\n\tentered nursing but later studied law.  She retired from Legal Aid\n\tServices in Halifax returning to Brudenell where she now lives.  Her\n\tcommunity activities include being the chair of the PEI Human Rights\n\tCommission an",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-82-iahsp",
  "title": "CFPEI 82 IAHSP",
  "summary": "Newsletter No. 82 from March 5, 2008, documents the completion of the Island Arts and Heritage Stabilization Program (IAHSP), which ran from May 2004 to 2008. Don Glendenning is pictured with Katy Baker and Ken Gillis, who chaired the IAHSP board. The program provided comprehensive support to PEI cultural organizations including governance guidance, financial management training, and organizational development. Participating organizations included Carrefour Theatre, College of Piping, Indian River Festival, Jubilee Theatre, PEI Symphony, and Victoria Playhouse. Total funding of $800,000 came from federal and provincial governments and the Bronfman Family Foundation. Don's visible involvement underscores his commitment to arts and cultural heritage preservation.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  82\t\t\t\t\t              \t           March 5, 2008\n\n\n\n\n\n\n\n\t\n\n\t\nStanding:\n\t   Don Glendenning and Katy Baker\n\t\nSeated:\n\t      Ken Gillis (L) Norman Carruthers\n\t\n\n\n\n\t\n\t\nArts Stabilization Project Finishes\n\t\n\n\n\n\t\n\t\nLaunched in May\n\t2004, the Island Arts and Heritage Stabilization Program was\n\tdesigned to assist PEI cultural organizations to become stronger and\n\tmore viable over the long term.   \n\t\n\t\n\n\n\n\t\n\t\nThe program focused\n\ton \n\t\n\t\n\t\t\n\nSound\n\t\tgoverna",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-83-growing-your-legacy",
  "title": "CFPEI 83 Growing your legacy",
  "summary": "Newsletter No. 83 from March 29, 2008, presents Don's philosophical reflections on legacy planning and endowments. Opening with a farmer's parable about persistently moving a stone through repeated effort, Don draws parallels to building personal wealth and community legacies. He contrasts temporary donations with permanent endowments, emphasizing how legacy funds continue supporting causes after donors' deaths. The newsletter encourages people to establish endowments reflecting their interests, describing CFPEI's experience in administering such funds and its commitment to honoring donor intentions over time. This piece reveals Don's thoughtful approach to philanthropy and estate planning.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  83\t\t\t\t\t              \t         March 29, 2008\n\n\n\t\n\n\n\t\n\t\nFrom\n\tLittle Acorns…\n\t\n\n\n\n\t\n\t\nA\n\tfarmer pastured his cows in the back field.  In the corner of the\n\tfield was a large flat stone that he wanted for a front step at his\n\tnew home – but he did not have the means to load it on to the\n\twagon.  So, each morning when taking the cows to the pasture and\n\tevening when bringing them home, he reached under one edge of the\n\tstone and, with a mighty heave",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-86-aliant",
  "title": "CFPEI 86 Aliant",
  "summary": "Newsletter No. 86 from May 16, 2008, acknowledges Aliant's partnership with CFPEI, providing telephone and internet services. Keith Lambe of Aliant presented a $500 cheque to President Norman Carruthers. The newsletter's second section details CFPEI's first-ever fundraiser scheduled for August 20 at Roma at Three Rivers Historic Site in Brudenell. The event features period entertainment by Singing Strings, a multi-course meal, reception, and $90 tickets (including $50 charitable donation receipt). The newsletter demonstrates CFPEI's evolution toward diversified fundraising while maintaining its core mission of endowment building.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  86\t\t\t\t\t             \t\t May 16, 2008\n\n\n\t\n\n\n\t\n\t\nPartnership with Aliant\n\t\n\n\n\n\t\n\t\n\nKeith\n\tLambe of Aliant presents cheque for $500 to Norman Carruthers,\n\tPresident of the Community Foundation of Prince Edward Island _\n\t\n\n\n\n\t\n\t\nCFPEI partners with\n\tmany organizations and agencies with mutual interests in improving\n\tthe quality of life of Islanders and Island communities. In so\n\tdoing, we are pleased to recognize the role of Aliant in providing\n\tus wit",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-90-granting-guidelines",
  "title": "CFPEI 90 Granting guidelines",
  "summary": "Newsletter No. 90 from October 28, 2008, publishes CFPEI's Granting Guidelines for undesignated funds, approved June 2008. The document outlines five grant purposes focused on building community capacity, developing local leadership, improving resource use, encouraging collaboration, and strengthening voluntary sector organizations. Detailed decision-making criteria address issues like inclusiveness, governance quality, partnership building, innovation, and community benefit. Funding restrictions exclude debt retirement, deficit reduction, computer equipment, sports sponsorships, individuals, core operations, single-religion support, and retroactive expenses. This comprehensive policy document, edited by Don, reflects the Foundation's mature operational framework and commitment to strategic grantmaking.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  90\t\t\t\t\t              \t       October 28, 2008\n\n\n\t\n\n\n\t\n\t\n\n\tGuidelines\n\tfor Undesignated Grants\n\t\n(Approved\n\tJune 2008)\n\t\n\n\t\n\n\n\t\n\t\n\n\tGrants are made available to:\n\t\n\n\t\n\n\n\t\n\t\n\t\t\n\n\n\t\tincrease the capacities of organizations, communities and\n\t\tindividuals to respond to challenges and opportunities\n\t\t\n\n\n\t\tdevelop local leadership, promote self-reliance, emphasize\n\t\tprevention, and mobilize civic participation and resources\n\t\t\n\n\n\t\timprove effectiveness i",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-91-scholarship-and-dundas",
  "title": "CFPEI 91 Scholarship and  Dundas",
  "summary": "Newsletter #91 (2008) featuring two community initiatives: the discovery and preservation of a Hall thresher uncovered by Hurricane Juan on a Hampton farm, which found permanent home at the Dundas Agricultural Museum; and establishment of the Rear Admiral Louise C. and James E. Wilmot Scholarship to support nursing training in the Souris area with requirement for post-graduation employment commitment. Demonstrates Glendenning's commitment to preserving Island heritage and improving local healthcare access through strategic charitable giving.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  \t91\t\t\t\t              , 2008\n\n\n\t\n\t\nHall thresher finds new home\n\t\n\n\n\t\nJohn\n\tand Ian MacQuarrie in front of a Hall thresher donated to the\n\tAgricultural Museum at Dundas\n\t\n\n\n\n\t\n\t\nHurricane\n\tJuan uncovered a Hall thresher on the farm of John MacQuarrie of\n\tHampton, PEI.  (See Community Foundation News N0. 2, June 18, 2004)\n\tOn November 4, 2008, the thresher found a permanent home in the\n\tagricultural museum at the Dundas Fairgrounds.  To quote Mr.\n\tM",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-93",
  "title": "CFPEI 93",
  "summary": "Newsletter #93 (January 2009) providing comprehensive overview of the Community Foundation of PEI's core functions and capabilities. Describes the Foundation's role in building endowments, creating community value, providing leadership, and accepting diverse forms of contributions. Glendenning uses the newsletter format to educate donors and community members about philanthropic vehicles available through CFPEI, emphasizing accessibility and flexibility in charitable giving.",
  "content_preview": "Community Foundation\n\tNews\n\t\n\n\t           \n\t\n\t\n\n\tNo.  93\t\t\t\t\t              \t       January 19, 2009\n\t\n\n\n\n\t\n\n\n\nCFPEI:\n\t\n\t\n\t\n\t\t\n\nHas\n\t\tthree main functions: building endowments, making grants that\n\t\tcreate value and providing community leadership\n\t\n\t\n\n\n\n\t\n\t\nCFPEI:\t\n\t\n\t\t\n\nPromotes\n\t\tlong term giving through the establishment of endowments \n\t\t\n\t\t\n\nApplies\n\t\ta granting policy that creates value within the charitable sector\n\t\t\n\nExerts\n\t\tleadership through convening and liaison\n\t\n\t\nCFPEI\n\t\n\t\t\n\nConnects",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-94-bell",
  "title": "CFPEI 94-Bell",
  "summary": "Newsletter #94 (February 2009) introducing new Board member Rogers Bell and addressing economic hardship during the 2009 recession. Glendenning articulates his philosophy of charitable responsibility during financial crisis, calling on donors and volunteers to increase support to social agencies despite personal hardship. Emphasizes that charitable commitments should persist and expand during tough times when needs are greatest—a principle reflecting his personal values of community stewardship.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.  94\t\t\t\t             \t\t     February 26, 2009\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tRogers\n\tBell was appointed to the Board in January, 2009. A native of\n\tCharlottetown, Rogers retired to PEI in 2008 after a career in the\n\tfinancial industry in Quebec, Alberta and Ontario. Since returning\n\tto PEI, he has joined the boards of the North Shore Community Centre\n\tand the North Shore Senior’s Housing, both located in Stanhope,\n\twhere he resides with his wife Phyllis",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-96-regional-meeting",
  "title": "CFPEI 96 - Regional_meeting",
  "summary": "Newsletter #96 (May 2009) reporting on the Atlantic Regional workshop of Community Foundations of Canada. Covers sessions on endowment growth, communications strategy, and investment management during recession. Glendenning documents CFPEI's participation through Rogers Bell and Executive Director Donald MacDonald, contextualizing the Foundation within the broader Canadian community foundation network of 162 organizations across the country.",
  "content_preview": "Community\nFoundation News\n\n\n\n\n\n\nNo.\n96\t\t\t\t\t\t\t\t\t\tMay 14, 2009\n\n________________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n“As\n\ta new kid on the block, it was a learning experience that I quite\n\tenjoyed”.  Rogers Bell,\n\tDirector\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nRegional\n\tMeeting\n\t\n\n\n\n\t\n\t\nCFPEI\n\trepresentatives at the Atlantic Regional workshop of Community\n\tFoundations of Canada found it a useful investment of time and\n\tenergy – and suggested others be encouraged to attend future\n\tgathering",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-98-focus-on-you",
  "title": "CFPEI 98 - Focus on you",
  "summary": "Newsletter #98 (July 2009) articulating CFPEI's donor-centered philosophy that reverses traditional fundraising approach. Rather than soliciting for institutional needs, the Foundation begins with donors' interests and charitable goals. Glendenning emphasizes that community foundations thrive by empowering donors as decision-makers. Lists 11 Board directors and invites community members to discuss personal legacy planning, reflecting his belief that effective philanthropy flows from individual values and capacity.",
  "content_preview": "Community\nFoundation News\n\n\n\n\n\n\nNo.\n98\t\t\t\t\t\t\t\t\t\tJuly 2, 2009\n\n________________________________________________________________________\n\n\n\tOur focus is you\n\t\n\n\t\n\n\n\t\n\t\n\n\tSeldom a day goes by without a request to give to someone’s\n\tfavorite charity.  The causes are many and all are legitimate.  The\n\tcanvasser believes in the cause and is prepared to make the case to\n\tyou as a potential donor.\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe Community Foundation of Prince Edward reverses the process; we\n\tstart with you: you made y",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-99-history",
  "title": "CFPEI 99 History",
  "summary": "Newsletter #99 (July 2009) providing comprehensive history of CFPEI's founding and Glendenning's central role. Details 1986 origins with Rotary Club initiative and Glendenning's assignment to research community foundation feasibility. Documents his extensive research across 32 community consultations, 9 U.S. foundations, and 20 Canadian foundations. Chronicles incorporation in January 1993 with founding Board including himself. This is a critical document for understanding his institutional legacy and leadership impact on PEI's philanthropic infrastructure.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. 99\t\t\t\t\t\t                          July 17, 2009\n\n\n\tA Brief History\n\t\n\n\n\n\t\n\t\nIn\n\tthe spring of 1986, members of the Charlottetown Rotary Club heard a\n\tpresentation from a founding member of the Greater Moncton Area\n\tCommunity Foundation.  He was a passionate believer and had\n\tcommitted $10,000 per year for ten years to its establishment.\n\t\n\n\n\n\t\n\t\nSome\n\tRotarians (Stan MacPherson, Bob Hutchison, Walt Wheeler, Stuart\n\tDrummond and Tom DeBlois), also m",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-and-third-sector",
  "title": "CFPEI and third sector",
  "summary": "Don's draft outline on CFPEI's role within PEI's third sector. The document articulates how the foundation contributes to quality of life, retains provincial uniqueness, attracts business, and retains population by filling service gaps. Don emphasizes CFPEI's unique position as the only organization with broad community interest, enabling long-term strategic direction and permanence beyond other organizations. He highlights the foundation's capacity to modify interventions through broadly-based directors, absorb small trusts, add value to donations, and create lasting impact. The work reflects Don's vision for institutional stability and community leadership.",
  "content_preview": "Draft-1\n\n\n\n\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n\n\n\n\nCFPEI and the Third Sector\n\n\n\n\n\n\n\n\nBy Don Glendenning\n\n\n\n\n\n\n\nDefinition\n\n\n\n\n\n\nComponents\n\n\n\n\n\n\nSignificance\n\n\t\n\n\n\tKind of future we have depends to large degree on the third\n\tsector\n\t\n\n\n\tAdds to quality of life\n\t\n\n\n\tFactor in retaining uniqueness of Province\n\t\n\n\n\tFills gaps; future governments less likely to have dollars for\n\tthird sector activities\n\t\n\n\n\tAttract business\n\t\n\n\n\tRetain people \n\t\n\n\n\n\n\n\n\nChallenges\n\n\n\n\n\n\nRole\nof CFP",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-proposal-hwc-1",
  "title": "CFPEI Proposal HWC-1",
  "summary": "Don submits a funding proposal to the Community Foundation of Prince Edward Island for a Handle With Care (HWC) program. HWC is designed to promote children's mental health through interactive strategies for parents, caregivers, and teachers. Education 20/20 Inc. proposes training facilitators using experienced trainers Alice Taylor and Eileen Conway-Martin, with a 16-hour program spread over two days. The proposal details specific eligibility requirements for participants and itemized costs totaling $2,750, demonstrating Don's attention to program quality and professional development.",
  "content_preview": "Education\n20/20 Inc.\n\n\n101\nKent St., PO Box 624/rue Kent, BP 624\n\n\nCharlottetown,\nPEI C1A 1M0 Canada\n\n\nTel:\n902-892-2060\n\n\nEmail:\npei@education2020.ca\n\n_____________________________________________________________________________________\n\nJune\n8, 2015\n\nCommunity\nFoundation of Prince Edward Island\n\nSuite\n105, Queen Square Place\n\n119-121\nQueen Street\n\nCharlottetown,\nPE C1A 4B3\n\n\n\n\n\n\nDear\nSir:\n\nHandle\nWith Care\n\nThis is a request\nto the Community Foundation of Prince Edward Island for financial\nsup",
  "theme": "09-community-civic"
 },
 {
  "slug": "cfpei-tribute-to-robinson",
  "title": "CFPEI tribute to Robinson",
  "summary": "A tribute to John Robinson celebrating his leadership of the Community Foundation of PEI, which grew assets from $1 million to $7 million under his direction. Don credits Robinson's vision of the Foundation as key provincial infrastructure and praises his engagement of summer residents and development of investment policies. The tribute exemplifies Don's role as a mentor to community leaders.",
  "content_preview": ":\n\nJohn Robinson\n\nJohn Robinson first came to my attention during a conversation with Tom Davies, then President of the Community Foundation, as a possible board member and future president. Tom was right; John was  both of these   and more and became a driving force behind the Community Foundation of Prince Edward Island.  \n\nI’ve known John for 20 years, first as a successful Island business man and entrepreneur, a man, well known in the agriculture industry for progressive farming practices, l",
  "theme": "09-community-civic"
 },
 {
  "slug": "chapman",
  "title": "Chapman",
  "summary": "Personal solicitation letter dated November 9, 2010 from Don Glendenning to Cyril Chapman of Chapman Brothers Construction in Souris, PEI. Don introduces CFPEI's mission and explains community foundation advantages: long-term community focus, endowment building, community orientation vs. single-issue focus, and legacy preservation. Emphasizes professional investment management, transparency, and experience with over 50 endowments. Notes CFPEI assets approaching $1.5 million, annual grants exceeding $70,000, and mentions Chapman's connection through Margaret Ching (past Director), Carol Fraser (current Director), and John and Pam MacDonald. References $1,000 grant to Souris Fire Fighters Association. Offers free consultation with no commitment.",
  "content_preview": "2010 11 09\n\n\n\n\n\n\n\n\n\n\nMr. Cyril Chapman\n\nChapman Brothers Construction Ltd.\n\nP.O. Box 85\n\nSouris, Prince Edward Island\n\nC0A 2B0\n\n\n\n\nDear Mr. Chapman, \n\n\n\n\nThis letter comes to introduce you to the Community Foundation of Prince Edward Island and to seek an opportunity to discuss the services we offer.  You may be aware of the Foundation as we have been making grants to organizations in the Souris area for a number of years.  Also, Margaret Ching is a past Director, Carol Fraser is a current Direc",
  "theme": "09-community-civic"
 },
 {
  "slug": "community-builder-handout",
  "title": "Community Builder Handout",
  "summary": "Educational handout explaining the Community Builder concept and fund model, describing how individuals can establish lasting legacies through endowments. Reflects the community foundation's philosophy and Don's approach to engaging donors and citizens in long-term community improvement.",
  "content_preview": "If\n\tgiving is one of the family values you want to pass along, we can\n\thelp                                 your family build a tradition\n\tof giving.\n\t\n\n\t\n\n\n\t\n\n\n\n\tCommunity Builders\n\tare people who are interested in\n\tmaking Prince Edward Island an even better place to live – both\n\tfor this generation and generations to follow.  Community builders\n\twant to give back to their community and want to start doing it now.\n\t Community builders are thinkers, planners, and doers in all walks\n\tof life.  Th",
  "theme": "09-community-civic"
 },
 {
  "slug": "community-foundation-of-pei-consolidated-trust-fund-fair-market-value",
  "title": "Community Foundation of PEI Consolidated Trust Fund                  Fair Market Value",
  "summary": "Financial statement of the Community Foundation of PEI consolidated trust fund as of December 31, 2006, showing portfolio value of $860,751.80 across unrestricted, interest, scholarship, and agency funds. Documents Don's stewardship of CFPEI with entries for the Glendenning Family Fund ($12,013.71) and demonstrates the Foundation's significant growth and diversified funding across numerous community initiatives.",
  "content_preview": "Community Foundation of PEI Consolidated Trust Fund                  Fair Market Value\n      \n      \n        \n \n      \n      \n        \n31-Dec-06\n      \n      \n        \n \n      \n      \n        \n31-Dec-05\n      \n      \n        \n\n\n      \n      \n        \nChange before Funds in Transit\n      \n    \n    \n      \n        \n \n      \n      \n        \n \n      \n      \n        \n \n      \n      \n        \n \n      \n      \n        \n \n      \n      \n        \n \n      \n      \n        \n\n\n      \n      \n        \n \n      \n ",
  "theme": "09-community-civic"
 },
 {
  "slug": "compton-beharrell",
  "title": "Compton- Beharrell",
  "summary": "Letter from Don Glendenning to Cindy Beharrell (Simon Compton's daughter) following his death, offering CFPEI's services for establishing a memorial fund. Don reviews community foundation benefits and suggests potential fund purposes aligned with Simon's interests (church, Camp Gencheff, Bangor cemetery). Includes personal anecdote about Don and Hazel's friendship with Simon during shared time in Mesa, Arizona. Reflects Don's compassion and capacity-building work.",
  "content_preview": "Cindy Beharrell\n\n\n\n\nDear Cindy:\n\n\n\n\n\n\n\nI write, Cindy, to introduce the Community Foundation of Prince Edward Island and to offer our services should you be thinking of establishing a memorial in your Dad’s memory.  Your Dad was aware of the work of the foundation and made a contribution to one of our early initiatives.\n\n\n\n\nFirst some comments about community foundations in general and the Community Foundation of Prince Edward Island in particular.\n\n\n\n\nCommunity foundations, and there are 170 in",
  "theme": "09-community-civic"
 },
 {
  "slug": "cu-challenge-description",
  "title": "CU Challenge description",
  "summary": "Strategic proposal draft (March 4, 2007) for CFPEI's Community Challenge Program encouraging Island communities to establish permanent endowment funds. Program matches community deposits at $5,000/year with Foundation grants of $1,000/year over five years, creating sustainable $25,000+ permanent community funds. Includes undesignated fund definition, community committee requirements, CFPEI liaison role, and governance structure. Reflects Don's vision for community-level philanthropic development.",
  "content_preview": "Draft March 4, 2007\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n(Name of Partner) Community Challenge Program\n\n\n\n\n\n\n\nBackground\tMost charitable giving is focused on meeting immediate needs and for specific causes.  Reflection and informal consultation indicates a parallel need to develop longer term plan and resources in the charitable sector at the community level and not to be solely dependent upon the efforts of particular interest groups regardless of how relevant and important such",
  "theme": "09-community-civic"
 },
 {
  "slug": "cu-challenge-letter",
  "title": "CU Challenge letter",
  "summary": "June 12, 2006 letter from CFPEI President John Robinson to Credit Union Central seeking $100,000 partnership for Community Challenge Program (later called Community Advancement Program). Outlines Foundation's decade of accomplishments (750K+ endowment, 25+ funds, $150K grants, five scholarships, $800K arts stabilization). Proposes matching-grant model building $500,000+ permanent fund for Island communities. Articulates Don's vision for grassroots philanthropy and community development.",
  "content_preview": "June 12, 2006\n\n\n\n\nMr. Robert Gregory\n\nManager of Marketing\n\nCredit Union Central of PEI\n\n281 University Ave.\n\nCharlottetown, PE  C1A 7M4\n\n\n\n\nDear Mr. Gregory:\n\nCommunity Advancement Program\n\n\n\n\nThis is a follow-up to our discussion of Wednesday, June 7, regarding your potential interest in the proposed Community Advancement Program.  \n\n\n\n\nFirst a brief background on the Foundation.  The Community Foundation of Prince Edward Island is a not-for-profit organization established in 1993 for the purp",
  "theme": "09-community-civic"
 },
 {
  "slug": "d-11-preparedness-1",
  "title": "D 11 Preparedness-1",
  "summary": "A May 2014 draft proposal addressing workforce readiness gaps identified through multiple sources including Vital Signs surveys and Chamber of Commerce reports. Don proposes conducting further surveys of youth populations across PEI to confirm findings, define skill gaps in math, literacy, and life skills, and develop action plans. The proposal includes various survey options from focused community studies to in-depth impact analyses on individual young people. Intended deliverables include comprehensive reports, action plans, and recommendations. Potential funding sources include HRDC, employment councils, and educational institutions, showing Don's systematic approach to evidence-based policy development.",
  "content_preview": "Draft\n\nMay 1, 2014\n\n\n\n\nPreparedness for the workplace\n\n\n\n\nBackground:\n\n  \nEducation and work are crucial to future of individuals and our community\n  \nVital signs: Preparedness for work identified as an issue in the  survey\n  \nWorkshops: Education 20/20 public consultations identified widespread concern about  preparation for work\n  \nRecent report of Greater Charlottetown Area Chamber of Commerce refers to levels of math, literacy and life skills\n  \nPEIHSF survey, although numbers were small, id",
  "theme": "09-community-civic"
 },
 {
  "slug": "d-16-math-tune-up",
  "title": "D-16  Math Tune-up",
  "summary": "A 2021 essay by Don Glendenning examining mathematics education and youth preparedness for post-secondary transition. Drawing on the Community Foundation's 2013 youth survey, it discusses educational deficiencies and proposes education-focused solutions, reflecting Don's long-standing commitment to education reform and youth development through the Education 20/20 initiative.",
  "content_preview": "ABOUT\nMATHEMATICS \n\n\nJune\n2021\n\n____________________________________________________________________________\n\n\n\n\n\n\nIn\nlate 2013, The Community Foundation of Prince Edward Island (CFPEI)\nundertook a survey of over 200 Island youth to identify issues that\ndirectly affected them; the report, Taking\nthe Pulse of Island Youth,\navailable on the Foundation’s\nwebsite at www.cfpei.ca,\nprovides a snapshot of the findings.  Bright\nspots include a positive sense of community, emerging entrepreneurial\nspirit",
  "theme": "09-community-civic"
 },
 {
  "slug": "d-37-preparedness-workplace",
  "title": "D 37  Preparedness workplace",
  "summary": "A May 2014 detailed proposal addressing gaps between educational preparation and workplace readiness identified through Vital Signs, Chamber of Commerce reports, and various education surveys. Don proposes surveying youth across multiple stakeholder perspectives (youth, parents, employers, schools, community leaders) to confirm findings and develop targeted interventions. The proposal uses the Conference Board's employability skills framework and suggests various survey approaches from single-community focus to in-depth case studies of a dozen young people. Deliverables include comprehensive reports, action plans, and recommendations for addressing gaps. This proposal demonstrates Don's systematic approach: identify the problem through data, engage multiple perspectives, and develop evidence-based solutions.",
  "content_preview": "Draft, May 1, 2014\n\nProposal - 7\n\nPreparedness for the workplace\n\nBackground:\n\n  \nEducation and work are crucial to future of individuals and our community\n  \nVital signs: Preparedness for work identified as an issue in the  survey\n  \nWorkshops: Education 20/20 public consultations identified widespread concern about  preparation for work\n  \nRecent report of Greater Charlottetown Area Chamber of Commerce refers to levels of math, literacy and life skills\n  \nPEIHSF survey, although numbers were s",
  "theme": "09-community-civic"
 },
 {
  "slug": "d-irving-numeracy-2019",
  "title": "D Irving Numeracy 2019",
  "summary": "Similar numeracy initiative letter addressed to Robert Irving, co-CEO of J.D. Irving Limited. Don presents the same gap analysis between improved math test scores and unchanged practical shop-floor math skills. He requests help covering the $15,000 cost of a two-day brainstorming analysis using the Community Foundation as intermediary for charitable receipts. This letter demonstrates Don's ability to engage private business leadership in education initiatives and his understanding that numeracy affects workforce competitiveness.",
  "content_preview": "February\n25, 2019\n\nRobert\nIrving, co—CEO\n\nJ.\nD. Irving Limited\n\n300\nUnion St\n\nSaint\nJohn, NB E2L 4M3\t\t1-3-DI\n\n\n\n\n\n\nDear\n\nMath\nInstruction on PEI\n\n\n\n\n\n\nAlthough\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen exploring why.\n\n\n\n\n\n\n\nIslanders need math; they\nneed to be able to measure, sort, calculate, group and estimate\nnumbers, space, time, distance, etc.  and they need to do it quickly,\neasily, accurately; an",
  "theme": "09-community-civic"
 },
 {
  "slug": "dear-hesta",
  "title": "Dear Hesta",
  "summary": "Letter dated March 20, 2007, from Don Glendenning to Dr. Hesta MacDonald responding to her interest in establishing a charitable legacy through a foundation. Don provides comprehensive background on community foundations, including Canadian history (first founded Winnipeg 1921, now 155 across Canada with $2.7 billion in assets), governance structure, and advantages of establishing funds within CFPEI rather than private foundations. Describes different fund types (undesignated, designated, interest) and their flexibility. References the Winnipeg Foundation's $100 million Richardson donation and international examples of family foundations transitioning to community foundation funds. Includes CFPEI fact sheet and draft interest agreement. Exemplifies Don's educational and advisory role in promoting community foundation philanthropy.",
  "content_preview": "March 20, 2007\n\n\n\n\nDr. Hesta MacDonald\n\n206 Spring Park Road\n\nCharlottetown, \n\nPE\tC1A 3Y9\n\n\n\n\nDear Dr. MacDonald:\n\n\n\n\nAs usual, I enjoyed our coffee last week; it was also great to see so many former colleagues and continuing friends.\n\n\n\n\nYou mentioned your interest in setting up a “foundation” to carry on your charitable interests into the future.  I think that is appropriate.  Doing so, also relieves you and your family, of both the administration and cost of establishing a private foundation.",
  "theme": "09-community-civic"
 },
 {
  "slug": "description-2",
  "title": "Description-2",
  "summary": "Proposal document dated October 8, 2014, recommending development of an independent assessment service for certifying mathematics proficiency with initial focus on entry-level employment. Outlines background concerns about literacy levels including PISA and CFPEI findings, problems with social promotion limiting credibility of high school diplomas, and inadequate school documentation of achievement levels. Proposes service characteristics including multiple levels, fee-for-service model, independence from schools, and certificates for proof of competency. Includes work plan (literature review, system development, instrument development, pilot testing) and key unresolved issues.",
  "content_preview": "October\n8, 2014\n\nAssessment\n  \n\n\nEDUCATION\n20/20 INC.\n\nAssessment\nService\n\nBackground\n\n\t\n\n\n\tConcerns about literacy\n\tlevels of Islanders have been widely reported: PISA\n\tresults, CFPEI survey, Charlottetown Area chamber, Home and School,\n\tEducation 20/20 workshops, Employers concerns, PEI Literacy Alliance\n\t\n\n\n\tOf particular concern are the\n\trecent graduates whose level of basic skills prevent them from\n\tentering post-secondary studies or securing employment.  \n\t\n\t\n\n\n\tThe practice of social\n\tpro",
  "theme": "09-community-civic"
 },
 {
  "slug": "donors-and-sponsors-2005-cfpei-and-iahsp",
  "title": "Donors and Sponsors 2005 (CFPEI and IAHSP)",
  "summary": "A donor and sponsor list for the Community Foundation of PEI and Island Arts & Heritage Stabilization Program (IAHSP) in 2005. Documents Don's role in fundraising, the Glendenning family's philanthropy, and the network of community leaders supporting PEI cultural and civic initiatives.",
  "content_preview": "DONORS AND SPONSORS 2005\n\n\n\n\nADL\n\nAtlantic Lottery Corporation\n\nJoan Auld & Keith Pigot\n\nProfessor Roger D. H. Black\n\nThe Samuel and Saidye Bronfman Family Foundation\n\nRick Burger\n\nRobert W. Butt\n\nRonald G. Butt\n\nAndrew Campbell\n\nDavid & Dianne Campbell\n\nMary P. Campbell\n\nStephen Campbell\n\nThane Campbell\n\nGordon Carr\n\nNorman & Diana Carruthers\n\nRoy & Aletha Creed\n\nMargaret Ching\n\nFast Foods (P.E.I.) Ltd.\n\nDon & Carol Glendenning\n\nJanet E. Glendenning\n\nKen Glendenning\n\nDr. Tom Hall\n\nSuzanne Hasti",
  "theme": "09-community-civic"
 },
 {
  "slug": "draft-1",
  "title": "Draft 1",
  "summary": "Draft newsletter (2006) describing CFPEI's four core functions: informing Islanders of needs and opportunities; liaison and coordination with charitable organizations; grant-making reflecting donor wishes; and fund administration and investment. Lists 2006 activities including donor conversations, endowment growth, scholarship publicity, and website development. Documents Foundation activities in youth projects and arts stabilization. Represents working draft outlining institutional priorities.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo.\tDraft\t\t\t\t\t\t              , 2006\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nWhat we do:\n\t\n\n\n\n\t\n\t\nIn practice, The\n\tFoundation carries out four functions:\n\t\n\t\t\n\nInforming\n\t\tIslanders of needs and opportunities and assisting them in\n\t\tdesigning charitable responses to match their interests and\n\t\tresources.\n\t\t\n\nProviding a\n\t\tliaison and coordination role with individuals and organizations\n\t\tengaged in charitable work.\n\t\t\n\nMaking grants to\n\t\treflect donors wishes.\n\t\t\n\nAdminister",
  "theme": "09-community-civic"
 },
 {
  "slug": "draft-67-memorials",
  "title": "Draft 67- Memorials",
  "summary": "Draft newsletter (2007) listing 12 individuals honored through memorial contributions to CFPEI during 2006. Names include Lewis MacMillan, Debbie MacMillan-Murray, Eric Murray, and others from PEI community. Brief format emphasizes the Foundation's role in channeling remembrance into lasting charitable legacy. Reflects Glendenning's understanding of death as opportunity for community connection and perpetual giving in honor of the deceased.",
  "content_preview": "Community Foundation News\n\n\n\n           \n\n\n\nNo. \t\t\t\t\t\t              , 2007\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nMemorials\n\t\n\n\n\n\t\n\t\nDuring 2006,\n\tcontributions were received in honour of:\n\t\n\n\n\n\t\n\t\n\t\t\n\nLewis\n\t\tMacMillan, \n\t\t\n\t\t\n\nDebbie\n\t\tMacMillan,\n\t\t\n\nEric\n\t\tMurray, \n\t\t\n\t\t\n\nOlive\n\t\tand Jack Bigelow,\n\t\t\n\n Edith\n\t\tRobinson,\n\t\t\n\nBlair\n\t\tRamsay, \n\t\t\n\t\t\n\nLorne\n\t\tAcorn,\n\t\t\n\nAnne\n\t\tMcQuaid, \n\t\t\n\t\t\n\nMary C.\n\t\tMcQuaid, \n\t\t\n\t\t\n\nJoyce\n\t\tPert,\n\t\t\n\nRoss and\n\t\tLeila Nicholson\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n______________________",
  "theme": "09-community-civic"
 },
 {
  "slug": "elizabeth-reagh-2011-03-09",
  "title": "Elizabeth Reagh 2011 03 09",
  "summary": "Personal letter from Don Glendenning to Elizabeth Reagh (March 9, 2011) discussing legacy planning. Summarizes CFPEI credentials: 170+ community foundations in Canada, professional investment management, annual audits, transparent reporting, and experience administering 50+ endowments. Explains advantages of community foundation vehicles: low-cost alternatives to direct disbursements, perpetual income generation, and flexibility. Describes specific fund structures: Host Organization Funds (organizations entrustfunds for investment with access to accumulated income) and Agency Funds (charitable organizations establish permanent funds for ongoing program support). Offers free consultation and plans follow-up meeting.",
  "content_preview": "2011 03 09\n\n\n\n\n\n\n\n\n\n\nMs. Elizabeth Reagh\n\n17 West Street\n\nCharlottetown, PEI\n\nC1A 3S3\n\n\n\n\nDear Elizabeth,\n\n\n\n\nEnjoyed our conversation of the other day and appreciate your interest in discussing with the Community Foundation of Prince Edward Island the services it offers.  I know that we have spoken about the Community Foundation but thought I would provide you with a few key points \n\n\n\n\nThe Community Foundation of Prince Edward Island serves the entire Province, is governed by a volunteer board",
  "theme": "09-community-civic"
 },
 {
  "slug": "feb-11-board-committees-volunteers-advisors-past-directors-etc",
  "title": "FEb 11, Board Committees Volunteers, Advisors, Past Directors, etc",
  "summary": "CFPEI governance document (appears to be February 11, undated year) listing complete board structure. Don listed as \"Past President\" (62 Queen Elizabeth Drive, Charlottetown, C1A 3A9). Board includes President John Robinson, VP John Ives, Treasurer David Campbell, Secretary Margaret Ching. Director positions held by Alfred Fraser, Tilmon Gallant, Bruce Lewis, Doug MacDougall, Anne Nicholson, Elizabeth Noonan, George Wright. Shows Don's leadership transition and ongoing involvement via committees including \"New Initiatives\" chaired by Don, with Tilmon Gallant and Elizabeth Noonan as members. Lists volunteer advisors including Don Anderson, Donald Arsenault, Peggy Coady, Justice Norman Carruthers, and numerous others reflecting 18-year tenure built relationships.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\n\t\t\n\t\t\t\n\n\t\t\t\t\n\n\n\t\t\t\t\n\t\t\t\t\nExecutive\n\t\t\t\t\n\n\n\n\t\t\t\t\n\t\t\t\t\nJohn\n\t\t\t\tRobinson - President/Président\n\t\t\t\t\nP.O.\n\t\t\t\tBox 1, Albany, PE  C0B 1A0\n\t\t\t\t\nJohn\n\t\t\t\tIves - Vice President/Vice-président\n\t\t\t\t\n208\n\t\t\t\tKent Street\n\t\t\t\t\nCharlottetown,\n\t\t\t\tPE   C1A 1P2\n\t\t\t\t\nDon\n\t\t\t\tGlendenning - Past President\n\t\t\t\t\n62\n\t\t\t\tQueen Elizabeth Drive\n\t\t\t\t\nCharlottetown,\n\t\t\t\tPE   C1A 3A9\n\t\t\t\t\nDavid\n\t\t\t\tCampbell - Treasurer/Trésor\n\t\t\t\t\n227\n\t\t\t\tKeppoch Road",
  "theme": "09-community-civic"
 },
 {
  "slug": "future-plans",
  "title": "future plans",
  "summary": "Strategic planning document outlining Living Memorial Trust expansion plans. Defines living memorials and donation motivations. Describes CFPEI governance and permanent endowment framework. Documents inaugural planting of July 21, 2007 at Wood Islands with six red oak trees, made possible through Keuper family, Wood Island Development Corp, Department of Forestry, Department of Transportation and Public Works, and PEI Tourism. Details five future contribution categories: general contributions ($10+ with card notification), individual undesignated trees ($250+), individual designated trees ($500+), tree clusters ($1,000+), and memorial book maintenance. Outlines promotion strategy including press releases and website presence. Establishes administrative procedures for receipting, confidential naming, and online donations.",
  "content_preview": "November 19, 2007\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nLiving Memorial Trusts\n\n\n\n\n1. Background\n\n\n\n\nLiving memorials are green spaces set aside in memory of a person, place or event; the key characteristic is that it is a natural space and plant life continues to grow.   A living memorial may be as simple as a single tree or bush but also may be a garden, a park or a forest.  \n\n\n\n\nLiving Memorials are more than just a tribute to loved ones; living memorials enhance and beautify o",
  "theme": "09-community-civic"
 },
 {
  "slug": "generic-letter-4",
  "title": "Generic letter-4",
  "summary": "Fundraising letter for Education First Canada Inc. emphasizing education quality determines national futures and improvement needs public demand. Identifies weaknesses in education systems: autonomy, standards, flexibility, engagement. Notes information drives change and that education information is undersupplied compared to health/justice sectors. Describes working groups, invitation of award-winning teacher Elizabeth Jeffery, UPEI Dean of Education engagement on teacher training, and planned debates/competitions/presentations. Announces Community Foundation of PEI support. Requests both encouragement and multi-year financial commitment. Demonstrates Don's strategy of creating demonstration projects and engaging educational professionals.\n- **Key People**: Elizabeth Jeffery (award-winning teacher), UPEI Dean of Education (unnamed)\n- **Key Organizations**: Education First Canada Inc., Community Foundation of Prince Edward Island, UPEI\n- **Tags**: PROFESSIONAL, EDUCATION, FOUNDATION, COMMUNITY, CORRESPONDENCE\n- **Eulogy Relevance**: MEDIUM - Shows Don's ability to engage university partnerships and identify exemplary educators to drive reform initiatives.",
  "content_preview": "Education First Canada Inc.\n\n\n\n\n101 Kent St., PO Box 624 \n\nCharlottetown \n\nPEI C1A 1M0 Canada\n\n\n\n\nEmail: educ.first@gmail.com\n\nOctober 15, 2012\n\n\n\n\nPotential Funder\n\n1234 Local address\n\nAnywhere, PE,  C1A 1M0\n\n\n\n\nDear Mr. Funder:\t\t\n\n\n\n\nThis letter comes to introduce an organization and an idea; both designed to exert a long-term positive impact on public education.  In saying this, I refer to Education First Canada Inc. an organization devoted to improving education, not only for Islanders, but ",
  "theme": "09-community-civic"
 },
 {
  "slug": "george-rogers",
  "title": "George Rogers",
  "summary": "Personal letter from Don Glendenning (as CFPEI Director) to George Rogers in Calgary proposing the establishment of a heritage fund in memory of his mother, Irene Rogers, who made significant contributions to PEI's heritage preservation. Don articulates CFPEI's mission and how it provides a vehicle for recognizing and perpetuating charitable legacies. The letter demonstrates Don's personal touch in donor relations and his ability to articulate the Foundation's value proposition to potential donors across the country.",
  "content_preview": "Mr. George Rogers\n\nC/o Nesbitt Burns\n\nBankers Hall, West Tower\n\n4100-888 Third St. SW\n\nCalgary, Alberta\tT2P 5C5\n\n\n\n\nDear Mr. Rogers:\n\n\n\n\nDuring a recent conversation about the importance of preserving PEI’s heritage, the many contributions that your mother, Irene Rogers, made to PEI”s heritage were acknowledged.  I, too, although a newcomer to PEI some 40 years ago, am very aware of the work that she did and her appreciation of the Island’s way of life.\n\n\n\n\nWe believe that her contributions shou",
  "theme": "09-community-civic"
 },
 {
  "slug": "hall-and-stavert",
  "title": "Hall and Stavert",
  "summary": "Personal letter from Jim Stavert responding to inquiries about Hall and Stavert foundry castings. Jim notes his father and Harold Hall founded the foundry in 1933, castings were likely from 1940, and expresses interest in returning castings to PEI. The letter illustrates connections discovered during the agricultural heritage research initiative.",
  "content_preview": "Dear Mr. Heim:\n\n\n\n\nI was delighted with your telephone call about the Hall and Stavert casting in your possession.  Please excuse the delay in getting back to you.  \n\n\n\n\nAs I mentioned, my father and Harold Hall went into the foundry business together in 1933.  The castings in your possession would have been one of their items but I do not know how many would have been cast. Hall and Stavert is still operating but now we produce mostly marine propellers.  \n\n\n\n\nThe wheels, we think, would have be",
  "theme": "09-community-civic"
 },
 {
  "slug": "harris-summary-notes",
  "title": "Harris, Summary Notes",
  "summary": "Internal notes from August 25, 2010 meeting with Mary Beth Harris (former UPEI librarian). Documents her background, health considerations, and extensive charitable interests spanning humane societies, wildlife conservation, arts, heritage, and health organizations. Outlines Harris's values including respect for people and nature. Includes brainstormed giving options: Harris Award for Architecture, Harris Scholarship, Harris Gallery, and Harris Lifetime Achievement Award. Shows Don's systematic approach to understanding donors and tailoring solutions.",
  "content_preview": "August 25, 2010\n\nMs. Mary Beth Harris\n\nPark West Lodge, Room 302\n\n22 Richmond St\n\nCharlottetown, PEI\n\nPh. 569-2665\n\n\n\n\nBackground:\n\nWas librarian at UPEI\n\nSold home in Stratford about July, 2009 – probably through John Ives; perhaps some paintings or furniture not disposed of yet; \n\nSold or gave some pieces of art to Confederation Centre, still in discussion\n\nInterests - Loves dogs/animals, arts, landscape\n\nFriends/neighbours: Edith Robinson, Heather MacDonald, Helen Hazard was her mother’s sist",
  "theme": "09-community-civic"
 },
 {
  "slug": "heather-rae-johnston",
  "title": "Heather Rae Johnston",
  "summary": "A personal letter from Don Glendenning to Heather Rae Johnston (Seacay Corporation) thanking her for a match-grant challenge and reporting on recent growth in the Community Foundation. Illustrates Don's leadership in CFPEI and his skill in leveraging corporate partnerships for community impact.",
  "content_preview": "Heather Rae Johnston\n\n\n\n\nRe:  #??\n\n\n\n\nI know that we have recently submitted our final report under the above noted agreement; however, I want to add a personal note to again express my thanks to you and to the Seacay Corporation.\n\n\n\n\nThe Match-Grant offer presented CFPEI with a significant challenge but also gave us a great boost.  In addition to the financial support, it moved us to seek out community leaders to explain the role of a community foundation and to make the case for support.\n\n\n\n\nD",
  "theme": "09-community-civic"
 },
 {
  "slug": "hesta-leter-to-district",
  "title": "Hesta-leter to District",
  "summary": "A letter from Don Glendenning to the Eastern School District confirming establishment of the Hesta MacDonald library book endowment. Reflects Don's commitment to ensuring educational access and his role in implementing endowment policies.",
  "content_preview": "Dr. Sandy MacDonald\n\nEastern School District\n\n\n\n\nDear Dr. MacDonald:\n\n\n\n\nI am pleased to confirm an earlier telephone conversation and that an endowment has been established at the Community Foundation of Prince Edward Island for the purchase of library books for schools in the Eastern School District.\n\n\n\n\nThe Belfast Consolidated School has been selected for the current year with Queen Charlotte and Charlottetown Rural High School being eligible in future years on a rotating basis.\n\n\n\n\nWe will ",
  "theme": "09-community-civic"
 },
 {
  "slug": "hill-1",
  "title": "Hill-1",
  "summary": "This June 7, 2012 letter to Jamie Hill, CEO of iWave Information Systems Inc., solicits $20,000 in funding for Education First Canada's early initiatives. Don addresses Hill as someone who shares his belief in educational system transformation, noting that change requires external pressure. Education First Canada, supported by the Community Foundation of PEI, plans community conversations about quality education, media outreach, a network of educational innovators, and school engagement awards. Don emphasizes that his team consists of seasoned educators and that the Community Foundation will manage finances and charitable receipts. The letter demonstrates Don's early fundraising efforts and his engagement of the technology sector business community in education reform.",
  "content_preview": "Education First Canada\n\nPO Box 624, 101 Kent St. \n\nCharlottetown, PE\n\nC1A 1M0  Canada\n\nJune 7, 2012\n\nMr. Jamie Hill, CEO\n\niWave Information Systems Inc\n\n28 Hillstrom Ave.\n\nCharlottetown, PE  C1E 2C5\n\n\n\n\nDear Mr. Hill:\n\n\n\n\nYou know, I am sure, that I believe strongly in the need for change in our education system and am of the view that change will only happen with external insistence.  A new group, Education First Canada, is now incorporated and ready to commence work.\n\n\n\n\nOur plans for the rema",
  "theme": "09-community-civic"
 },
 {
  "slug": "ideas",
  "title": "IDEAS",
  "summary": "Brainstorming document outlining innovative funding ideas for the community foundation sector. Don compiles examples from other Canadian cities (Calgary, Winnipeg, Victoria) including capacity-building programs, vital signs community reports, match grant programs for arts, neighborhood watch initiatives, and 1% government endowment allocation proposals. Specific examples include Winnipeg's agency fund model (100+ charities), St. John Foundation initiatives, federal matching programs, and will-making promotion partnerships. The document reflects Don's practice of studying other foundations' successful models and adapting them to PEI's context, demonstrating his strategic learning approach.",
  "content_preview": "Propose\nto PEI or muniicpalities that they set aside 1% of their budget each\nyear to set up endowments or to encourage endwment building in the\nthird sector.\n\n\nIDEAS\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\n\n\n\n\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCentre\nfor Community Philanthropy - Calgary\n\n\n\n\n\n\nMatch\nGrant Program for the Arts\n\n\n\n\n\n\nLocals\nand visitors alike comment on the vigorous nature of the arts on PEI\nand, without doubt, the arts contribute to the quality of life of all\nIslanders.  But the arts, everywhere, struggle.  . Throu",
  "theme": "09-community-civic"
 },
 {
  "slug": "info-session-public-poster",
  "title": "Info Session-public Poster",
  "summary": "Public poster announcing CFPEI information sessions scheduled for February 12 at Hillsborough River Eco Centre (Mount Stewart) and February 19 at Dr. Roddie Community Centre (St. Peters), both at 10:00 am. Part of Don's systematic effort to educate island communities about charitable giving and foundation services.",
  "content_preview": "COMMUNITY FOUNDATION \n\n\n\nOF \n\n\n\nPRINCE EDWARD ISLAND\n\n\n\n\n\n\n\n\n\n\n\n\n\nLearn More About \n\n\n\nYour Community Foundation\n\n\n\n\n\n\n\n\n\n\n\nJoin\nus for coffee and a presentation at 10:00 am at one of the following\nlocations: \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFeb. 12 – Hillsborough\nRiver Eco Centre\n\n\n  Mount Stewart \n\n\n\n\n\n\n\n\n\nFeb. 19 – Dr. Roddie\nCommunity Centre\n\n\n  \t\t\t  St. Peters\n\n\n\n\n\n\n\n\n\n\n\nFor\nfurther information:\n\n\n\n\n\n\n\nCommunity Foundation of\nPrince Edward Island\n\n\nTel: 892-3440;  \n\n\n\nURL:www.cfpei.ca;\n\n\n\n\nEmail: foundation",
  "theme": "09-community-civic"
 },
 {
  "slug": "ings-bud",
  "title": "Ings, Bud",
  "summary": "Don's personal letter to Bud Ings regarding establishing a memorial endowment in the name of Connie (likely Connie Ings). Don recalls Connie's significant contributions to PEI, particularly her role in forming the Community Foundation, and proposes creating a permanent endowment to honor her interests in beautification and community service. The letter demonstrates Don's personal relationships with community leaders and his skill at recognizing and memorializing contributions to the Island.",
  "content_preview": "Bud Ings\n\n\n\n\nIt was great to see you recently if only for a few minutes.  That was my first visit to the Marina(?) and I was very impressed with the facilities and the atmosphere – and what a beautiful view over the Montague River..\n\n\n\n\nDuring our brief conversation, we spoke briefly about Connie; her contributions to the Island were varied and many.  Among them was her contribution to the formation of the Community Foundation of Prince Edward Island and, as you may recall, that was a subject of",
  "theme": "09-community-civic"
 },
 {
  "slug": "invitation-2",
  "title": "Invitation 2",
  "summary": "A formal invitation letter from Don Glendenning to stakeholders for the November 25, 2015 exploratory meeting on educational preparedness. Don references the CFPEI's 2013 Vital Signs report documenting \"preparedness gaps\" and recent informal community conversations expressing ongoing public concern. The meeting, held at R. Birt and Associates, aimed to bring together key institutional players (post-secondary institutions, employers, educators, youth advocates) to examine the issue and explore improvement measures. The letter reflects Don's collaborative leadership style and commitment to evidence-based institutional dialogue.",
  "content_preview": "1-3-2\n\nInvitation-2\n\n\n\n\nThis is a follow-up to my Email of October 29 with an invitation to a discussion on the issue of “preparedness” of Island youth for further education and for work.  As I pointed out, my concern is for the impact that the issue may be having on both youth and the community.  \n\n \n\nWe will meet in the 2nd floor board room of R. Birt and Associates, 27 Brackley Point Road, Charlottetown at 9:00 am. Wednesday, November 25, 2015 and  will end no later than 10:30.\n\n \n\nI’ll be ba",
  "theme": "09-community-civic"
 },
 {
  "slug": "invitation-to-sponsor-2",
  "title": "invitation to sponsor-2",
  "summary": "Formal letter from Don Glendenning to a prospective sponsor (addressed to \"Gerry\") soliciting $100 sponsorship for Beyond Measure. References previous education film screening and presents the film as addressing test-driven education causing student stress. Emphasizes that efficient curricula have become ineffective, leading to increased demand for school counselors. Invites participation and discussion; explains anticipated financial shortfall despite $5 admission; requests contribution from Community Foundation or direct mailing. Demonstrates Don's personal outreach style, connecting film themes to observable community consequences (counselor demand).",
  "content_preview": "Education\n20/20 Inc.\n\n\n101\nKent St., PO Box 624/rue Kent, BP 624\n\n\nCharlottetown,\nPEI C1A 1M0 Canada\n\n\nTel:\n902-892-2060\n\n\nEmail:\npei@education2020.ca\n\n_____________________________________________________________________________________\n\n\nDear Gerry:\n\n\nAs you may recall, our group sponsored an educational fil, earlier\nthis year; today we are announcing another, Beyond Measure,\nwhich comes very highly recommended.\n\n\n“Every day we hear stories about America’s\ntroubled education system. And we’re ",
  "theme": "09-community-civic"
 },
 {
  "slug": "island-foundation",
  "title": "Island Foundation",
  "summary": "June 2011 document authored by Don articulating a transformative vision for CFPEI evolution. Proposes rebranding as \"Island Foundation\" with significant expansion goals ($50-100M in assets), its own provincial legislation, and prominent Board oversight \"in perpetuity.\" Emphasizes commitment to undesignated funds for emerging needs and positioning as the leader in PEI's third sector. Outlines specific next steps including exploratory discussions, legislative tabling, and formal founding meeting, reflecting Don's strategic, long-term thinking about institutional development.",
  "content_preview": "CF2-Org\n\nJune\n6, 2011\n\nThe\nIsland Foundation\n\nBackground\n\nIn\n1993 The Community Foundation of Prince Edward Island was\nincorporated under  Part 2? of the Companies Act of Prince Edward\nIsland.  The Foundation is  a charitable organization with a focus on\nenhancing  the quality of life in the communities of Prince Edwards\nIsland.  It provides a means for individuals, family groups,\ncorporations and private foundations to support charitable activities\nof interest to them. \n\n\nRecently\nsome Director",
  "theme": "09-community-civic"
 },
 {
  "slug": "joann-thanks",
  "title": "JoAnn Thanks",
  "summary": "A personal thank-you letter from Don Glendenning (as Past President) to JoAnn McQuaid for her contributions to the Community Foundation. Provides insight into Don's leadership style, his appreciation for collaborative relationships, and his vision for CFPEI's future.",
  "content_preview": "May 1, 2005\n\n\n\n\n\n\n\nJoAnn McQuaid\n\n10 Shamrock Court\n\nCharlottetown,  PE  C1A 7X4\n\n\n\n\nDear JoAnn:\n\n\n\n\nJust a note to say thank you for your many contributions to the work of the Community Foundation of Prince Edward Island.\n\n\n\n\nI remember well the day that you, Henry Purdy and I had our first conversation about a secondment.   CFPEI is certainly a different organization today.  With your guidance and support, CFPEI has grown and prospered.  While we aren’t “there yet”, we’ve come a long way.  Whe",
  "theme": "09-community-civic"
 },
 {
  "slug": "ken-gillis-2",
  "title": "Ken Gillis-2",
  "summary": "A brief letter from Don (as CFPEI President) to Ken Gillis regarding IAHSP endowment establishment. Don explains that the IAHSP Board decided to establish an endowment at CFPEI with remaining funds, with grants to be made consistent with the original program objectives. The letter references pending payments to participating organizations upon completion of approved activities. This shows coordination between Don and Ken Gillis on program transition.",
  "content_preview": "President \n\nCFPEI\n\n\n\n\n\n\n\nIsland Arts and Heritage Stabilization Program\n\n\n\n\nAs you know, the Island Arts and Heritage Stabilization Program is ending and finds itself with funds not used under the project. \n\n\n\n\nAt the final meeting on xxx, the Board agreed that the outstanding funds be used to establish an endowment with the community Foundation with grants being made for purposes consistent with the original program. \n\n\n\n\nAt the same time, as you will see from the attachment, in the case of a f",
  "theme": "09-community-civic"
 },
 {
  "slug": "keuper-brochure-front",
  "title": "Keuper Brochure  Front",
  "summary": "Marketing brochure for the Community Foundation of PEI's \"Living Memorials\" initiative, promoting beautification of public spaces in Prince Edward Island. The bilingual document (English/French) presents the Foundation's contact information and vision for landscape enhancement projects. This represents Don's work developing donor communications and fundraising materials.",
  "content_preview": "The Community\n\t\t\tFoundation of\n\t\t\t\n\n\t\t\t           Prince Edward\n\t\t\tIsland\n\t\t\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\n\t\t\t\tQueen Square Centre\n\t\t\t\n\n\t\t\t\t119-121 Queen Street\n\t\t\t\n\n\t\t\t\tCharlottetown, PE\n\t\t\t\n\n\t\t\t\tC1A 4B3\n\t\t\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\n\t\t\t\tTel: \t(902) 892-3440\n\t\t\t\n\n\t\t\t\tFax: \t(902) 892-0880\t\n\t\t\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\n\t\t\t\tEmail:\n\t\t\tfoundation@comm-fdn.pe.ca\n\t\t\t\n\n\t\t\t\tWeb:  \n\t\t\twww.comm-fdn.pe.ca\n\t\t\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t\t\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\n\t\t\tLa Fondation\n\t\t\tcommunautaire de l'Île-du-Prince-Édouard\n\t\t\t\n\n\t\t\t\n\n\n\t\t\t\n\t\t\t\n\n\t\t\t\tPlace",
  "theme": "09-community-civic"
 },
 {
  "slug": "keuper-john-thanks",
  "title": "Keuper John  thanks",
  "summary": "A personal thank-you letter from Don (as Foundation Director) to John Keuper acknowledging his contribution to the Living Memorial Trust, which honors Charles Keuper's memory. Don notes the importance of the Keupers' initiative in enhancing Prince Edward Island's public spaces and commits to future correspondence regarding brochures and administrative details.",
  "content_preview": "December 16, 2006\n\n\n\n\n\n\n\nJohn Keuper\n\nWood Islands\n\n\n\n\nDear Mrs. Keuper:\n\nLiving Memorial Trust\n\n\n\n\n\n\n\nThank you for your contribution to the Living Memorial Trust with the Community Foundation of Prince Edward Island.  It is a fitting tribute to Charles’ memory.  In addition, it will continue to enhance Prince Edward Island for the benefit of future Islanders and visitors alike.  Without your initiative, it would not have happened.\n\n\n\n\nI am enclosing receipts for your donation and will be in to",
  "theme": "09-community-civic"
 },
 {
  "slug": "keupereelinoer-thanks",
  "title": "KeuperEelinoer  thanks",
  "summary": "A thank-you letter from Don to Elinore Keuper for her support in establishing the Living Memorial Trust honoring her husband Charles. Don expresses appreciation for their vision clarity and reflects on his learning about living memorials through their discussions, while wishing her well on a planned Arizona visit.",
  "content_preview": "December 16, 2006\n\n\n\n\n\n\n\nMrs. Elinore Keuper\n\n32 Pownal St.\n\nCharlottetown, PE\tC1A 3V9\n\n\n\n\n\n\n\nDear Mrs. Keuper:\n\nLiving Memorial Trust\n\n\n\n\n\n\n\nThank you for supporting the establishment of a Living Memorial Trust with the Community Foundation of Prince Edward Island.  It is a fitting tribute to Charles’ memory.  In addition, it will continue to enhance Prince Edward Island for the benefit of future Islanders and visitors alike.\n\n\n\n\nI enjoyed our discussions of the proposed fund and commend you an",
  "theme": "09-community-civic"
 },
 {
  "slug": "kevin-murphy",
  "title": "Kevin Murphy",
  "summary": "Fundraising solicitation to Kevin Murphy (President of Murphy Hospitality Group) for the Math on PEI numeracy skills analysis project. Maintains identical messaging with other June 2019 solicitations regarding the $15,000 cost, brainstorming methodology, and Community Foundation payment processing.",
  "content_preview": "June\n10, 2019F\n\nKevin\nMurphy, President\n\nMurphy\nHospitality Group\n\n96\nKensington Road\n\nCharlottetown\n, PEI, C1A 5J4\n\n\n\n\n\n\nDear:\n\nMath\non PEI\n\n\n\n\n\n\nAlthough\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen wondering why.\n\n\n\n\n\n\nIslanders\nneed math; citizens may not need a  high level but they need to be\nable to measure, sort, calculate, group and estimate numbers, space,\ntime  distance, etc.  and they need to do",
  "theme": "09-community-civic"
 },
 {
  "slug": "launch-letter-to-keuper-friends",
  "title": "Launch -Letter to Keuper Friends",
  "summary": "Formal letter from Norman Carruthers, President of Community Foundation of PEI, to friends of Dr. Charles Keuper announcing the establishment of a Living Memorial Trust endowment. Explains the trust's purpose to honor Keuper's legacy of preserving PEI's natural beauty and heritage. Describes initial tree planting at Trails PEI entrance in Wood Islands where Keupers first settled. Includes donation information and enclosed brochure. Shows collaborative effort between Keuper family, Foundation, and Glendenning.",
  "content_preview": "Dear\n\n\n\n\nAs a friend of Dr. Charles Keuper, you will know that he loved Prince Edward Island and worked diligently for the preservation of its beauty and heritage.\n\n\n\n\nTo continue his work and to honour his name, the Keuper family established a Living Memorial Trust at the Community Foundation of Prince Edward Island.  The Trust is in the form of an endowment and will provide grants in perpetuity for the enhancement of public spaces.\n\n\n\n\nWhile funds may be used for any public space, The Foundati",
  "theme": "09-community-civic"
 },
 {
  "slug": "launch-press-release",
  "title": "Launch-Press Release",
  "summary": "Official press release announcing the establishment of the Living Memorial Trust by Community Foundation of PEI. Details inaugural planting of native red oak trees at Wood Islands Trails PEI entrance in memory of Dr. Charles Keuper. Provides biographical information on Keuper (Texas physician, Harvard Medical School teacher, retired to PEI in 1979). Explains benefits of living memorials and solicits contributions. Attributes initial funding to Keuper family and lists contact information for Don Glendenning and Foundation office.",
  "content_preview": "Draft Press Release for July 21, 2007\n\n\n\n\nLiving Memorial Trust Established\n\n\n\n\nThe Wood Islands entrance to Trails PEI looks different today, and will be significantly different in 20 years, thanks to the planting of two clusters of native red oak trees.  The planting is the first initiative of the Community Foundation of Prince Edward Island under the newly established Living Memorial Trust from which grants will be made for the purpose of enhancing public spaces throughout Prince Edward Islan",
  "theme": "09-community-civic"
 },
 {
  "slug": "list-for-2006-annual-report",
  "title": "List for 2006 Annual Report",
  "summary": "Comprehensive 2006 donor and grant recipient list for CFPEI annual report. Documents 6 scholarships awarded (including recipients like Andrea Gallant, Carolyn Doucette, Ryan Keefe); memorial contributions (Lewis MacMillan, Eric Murray, and others); and major grants across diverse causes (schools, sexual assault crisis centre, disability organizations, veterans services). Lists over 150 individual and corporate donors, including Dr. Donald and Carol Glendenning among major contributors. Reflects the Foundation's broad community engagement under Don's leadership.",
  "content_preview": "SEQ CHAPTER \\h \\r 1\n\nScholarships (6 awarded)- 2006\n\n\n\n\nAndrea Gallant - Lowell Phillips\n\nCarolyn Doucette - Lorne and Ruby Bonnell\n\nRyan Keefe - Orin Carver\n\nRae-Anne McCourt - Summerside Natick\n\nJessica Hutchinson and Christopher Dahn - Joan Auld\n\n\n\n\nMemorial - 2006\n\nLewis MacMillan\n\nDebbie MacMillan - Murray\n\nEric Murray\n\nOlive and Jack Bigelow\n\nEdith Robinson\n\nBlair Ramsay\n\nLorne Acorn\n\nAnne McQuaid\n\nMary C. McQuaid\n\nJoyce Pert\n\nRoss and Leila Nicholson\n\n\n\n\nGrants  - 2006\n\n\n\n\nMirimichi Rural",
  "theme": "09-community-civic"
 },
 {
  "slug": "literacy-conclusions",
  "title": "Literacy-Conclusions",
  "summary": "A comprehensive analysis of PEI's literacy crisis with observations on service fragmentation, insufficient school accountability, stigma around literacy programs, and disconnect between provision and needs. Don recommends separating literacy from school contexts, establishing clear standards, offering flexible scheduling, and creating specialized reading clinics. Includes appendices with demographic data and practical guidance for parents and policymakers.",
  "content_preview": "Observations/conclusions\n\n\n\n\n\n\n\t\n\n\n\tClients fall into two broad\n\tcategories – adults and young people still in school; there has\n\tbeen little improvement in levels of literacy in either group in\n\tpast decade\n\t\n\n\n\tThere is little exchange of\n\tinformation among service providers \n\t\n\t\n\n\n\tServices to adults, except\n\tfor programs offered at Holland College, are quite ad hoc and often\n\tdepend on annual applications for funding  \n\t\n\t\n\n\n\tThere is a stigma attached to\n\tthe term literacy; literacy may be ",
  "theme": "09-community-civic"
 },
 {
  "slug": "literacy-letter-callbeck",
  "title": "Literacy letter Callbeck",
  "summary": "An October 26, 2009 letter from Don to Catherine Callbeck highlighting the Community Foundation's commitment to literacy issues and proposing an initiative to convene literacy stakeholders for dialogue. Don notes that despite a year of conversations and Foundation grant-making to home literacy projects, the fundamental problem remains: literacy providers operate in isolation without coordination. He proposes funding small-scale \"dialogue\" activities (copying, mailing, meeting space) to bring stakeholders together, offering personal attention to lead the initiative. This letter exemplifies Don's conviction that improved communication and coordination could leverage existing resources more effectively.",
  "content_preview": "October 26, 2009\n\n\n\n\nHon. Catherine Callbeck\n\nBedeque\n\nPEI\t\tC0B 1C0\n\nCanada\n\n\n\n\n\n\n\nDear Senator Callbeck:\n\n\n\n\n\n\n\n About a year ago we spoke on a number occasions about the importance of literacy and the need for training.  \n\n\n\n\nSince then, I have had a number of discussions with others on the subject and the Foundation has made a grant to the Summerside Home and School Association to assist in their project to encourage new mothers to read to their children.\n\n\n\n\nRecently, the Board of Governors ",
  "theme": "09-community-civic"
 },
 {
  "slug": "lm-montgomery-endowment-press-release",
  "title": "LM Montgomery Endowment Press release",
  "summary": "Press release announcing the L.M. Montgomery Land Trust Operating Endowment Fund partnership with Community Foundation of PEI. Highlights preservation of scenic coastal agricultural lands and Don's civic leadership role in facilitating such initiatives.",
  "content_preview": "FOUNDATION AND LAND TRUST PARTNER IN NEW FUND\n\n\n\n\nThe Community Foundation of Prince Edward Island and the L. M. Montgomery Land Trust are partnering in the establishment of an endowment for the preservation of scenic coastal agricultural lands in PEI.  The result is the L. M. Montgomery Land Trust Operating Endowment Fund established for the purpose of making grants annually towards the operating costs of the Trust.\n\n\n\n\nIn making the announcement, CFEI President, John Robinson, welcomed the est",
  "theme": "09-community-civic"
 },
 {
  "slug": "mailing-list",
  "title": "Mailing list",
  "summary": "List of 50+ Charlottetown and PEI area residents with addresses, appearing to be prospect/donor mailing list for fundraising outreach. Names include Cairns, Kennedy, MacLeod, Martin, Morrison, Mosher, and others. Likely used for \"Leave an Artistic Legacy\" campaign or CFPEI fundraising initiatives. Includes duplicates and incomplete entries.",
  "content_preview": "SEQ CHAPTER \\h \\r 1Barwise, Bob & Janet\n\nPO Box160 StnCentral, Ch’town,PEI, C1A 7K4\n\n\n\n\nCairns, Nancy\n\n1794 Rattenbury Rd  RR#1, Breadalbane,PEI\n\nC0A 1E0\n\n\n\n\nChristensen, Anne\n\n10106 Rt. 6, Kensington, PEI, C0B 1M0               \n\n\n\n\nConnolly, Paul & Etta\n\n42 Ambrose St., Ch’town, PEI, C1A 3P4 \n\n\n\n\nCook, David\n\n34 Sunset Dr., Ch’town, PEI, C1A 7S9\n\n\n\n\nCooke, Jeff & Margot\n\n37 Governor’s Lane, Stratford, PEI, C1B 1M2\n\n\n\n\nCooke, Dr. Raymond\n\n8 Shamrock Dr., Ch’town, PEI, C1A 7S4\n\n\n\n\nCottreau, Dr. ",
  "theme": "09-community-civic"
 },
 {
  "slug": "marla-2019",
  "title": "Marla-2019",
  "summary": "A personal thank-you letter from Don to Marla, acknowledging her years of service as a volunteer and employee of the Community Foundation of PEI. The letter reflects their warm relationship and Don's appreciation for her contributions to the Foundation's success story.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown,  PE\n\n\tC1A 3A9\n\n\n\n\nMarch 30, 2019\n\n\n\n\nDear Marla:\n\n\t\t\n\nWhile I did see the recent advertisement for an accountant at CFPEI, I did not know until you phoned that the changes included your departure,  While I do not know, nor actually need to know, the details, I want to thank you and acknowledge your years of service and many contributions to the Community Foundation of Prince Edward Island. \n\nI remember well  the day, although not the date, that I stopped ",
  "theme": "09-community-civic"
 },
 {
  "slug": "math-3-reference-2019-4",
  "title": "Math 3 -Reference-2019-4",
  "summary": "MATH: A PROBLEM TO BE SOLVED About math-3 --------------------------------------------------------------------------------------------------------------------------------------- DEFINITIONS: Education – any experience that has a formative effect on the way a person thinks, feels or acts Mathematics – the study of science of number, quantity, and space. Math education – the extent and nature of a...",
  "content_preview": "MATH: A PROBLEM TO BE SOLVED\n\nAbout math-3\n\n---------------------------------------------------------------------------------------------------------------------------------------\n\nDEFINITIONS: \n\nEducation – any experience that has a formative effect on the way a person thinks, feels or acts\n\nMathematics – the study of science of number, quantity, and space.\n\nMath education – the extent and nature of a person’s attitudes, skills an knowledge in and about the field of math.\n\nRelevance - \n\n\n\n\nEDUC",
  "theme": "09-community-civic"
 },
 {
  "slug": "mckenna-letter",
  "title": "McKenna letter",
  "summary": "Personal letter from Don Glendenning (Director, CFPEI) to David McKenna proposing an endowment fund with environmental focus. Shows Don's active fundraising and donor relations work: he drafts customized agreements, explains Foundation options, references recent successes (David A. MacKay Fund, 26 existing endowments totaling $700,000+), and offers to discuss further. Demonstrates Don's personal, direct approach to donor engagement and the Foundation's growth trajectory in 2006.",
  "content_preview": "Mr. David McKenna\n\n\n\n\nDear David:\n\n\n\n\nBased on a very brief conversation yesterday about endowment funds at the Community Foundation of Prince Edward Island, I decided to draft an agreement on the establishment of a McKenna Fund for your consideration.  This is a proforma agreement and contains our standard clauses.  Specific clauses are added, in the agreement or in an appendix if needed, to more adequately reflect the donor’s interests.\n\n\n\n\nAs you know, community foundations offer a wide range",
  "theme": "09-community-civic"
 },
 {
  "slug": "media-2-skill-delopment",
  "title": "Media-2 Skill Delopment",
  "summary": "Press release titled \"Skill development needs a context,\" reporting workshop discussions that settled on a definition: \"increasing one's skill to do 'something'\" (citizenship, employment, further study, or all three). The release emphasizes foundations in home and K-12 education, proposes an independent qualification authority for consistency across the province, and suggests documentation of skills learned on the job. Other ideas include short technical courses (three months), vouchers, competency lists for job seekers, and institutional cooperation. Don Glendenning is listed as contact.",
  "content_preview": "_____________________________________________________________________________\n\n\nFor immediate release\n\nSkill\ndevelopment needs a context\n\n\n\n\n\n\nThe\nmeaning of skill development is not clear; at least that was the view\nof participants at a recent workshop on the subject.  After some\ndiscussion the group settled on “increasing one’s skill to do\n“something”. That “something” could be citizenship,\nemployment, further study or for all three, but it needs to be clear.\n Furthermore, the foundation\nfor s",
  "theme": "09-community-civic"
 },
 {
  "slug": "media-4",
  "title": "Media-4",
  "summary": "Media release describing the upcoming award in accessible language. Explains that an Island school will receive a $2,500 cheque to spend as needed, awarded for demonstrating engagement in learning activities and community involvement. Notes that engagement comes in diverse forms (Future Local Forums for French students, Junior Achievement in Kinkora, translation services for newcomers, cross-cultural events, technology use). Emphasizes that engagement is school-wide, involving multiple classes and ages working together with community members, reflecting community interests and skills. States award is possible through an Island family's generosity who believes engagement and achievement are connected. Contact: Don Glendenning, 892-5859. Demonstrates Don's hands-on involvement as primary contact.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\n\n\n\n\n\n\nSchool engagement\n\n\n\n\n\n\n\n\nA couple of months from now an Island school or learning centre will\nreceive a cheque for $2,500, and they can spend it for whatever they\nwant.  They will receive the award because of the nature and  extent\nto which students are engaged in learning activities, and the\nengagement of parents and other community members as well.  And all\nthis happens because ",
  "theme": "09-community-civic"
 },
 {
  "slug": "media-challenge-2007",
  "title": "Media - Challenge 2007",
  "summary": "Press release announcing CFPEI's challenge to Souris residents to increase the Souris Fund by $5,000, with CFPEI matching with $1,000 annual grants over five years. Names interim committee (Margaret Ching, Carol Fraser, Thelma MacDonald, JoAnne Chisholm). Describes the Souris Fund as one of 35 CFPEI endowments supporting any charitable purpose in the area. Includes contact (Margaret Ching, 902-357-2818) for media inquiries.",
  "content_preview": "Foundation Issues Challenge to Souris Community\n\n\n\n\nThe Community Foundation of Prince Edward Island has challenged the residents of the Souris area to increase the existing Souris Fund; the fund now stands at $17,500. The Foundation will make grants to charitable organizations in the Souris area in the amount of $1,000 each year for the next five years on condition that the endowment be increased by $5,000 per year for the same period.  If the challenge is met, the fund should warrant grants of",
  "theme": "09-community-civic"
 },
 {
  "slug": "media-release-2",
  "title": "Media release 2",
  "summary": "Follow-up media release inviting applications for the 2017 Excellence in Education Award, expanding on the award's focus on community organizations. Recaps previous award winners and highlights the philosophy that education is a community endeavor. Includes Don's quote about community-led education initiatives, repositioning the award to recognize efforts beyond traditional school settings.",
  "content_preview": "_____________________________________________________________________________\n\n\n\n\n\n\n\n\nFor immediate release\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApplications now being received\n\n\n\n\n\n\n\n\nApplications are now\nbeing received by Education 20/20 Inc. for an Excellence in Education\naward. The 2017 Award will recognize a community organization or\nagency for its efforts to improve the quality of education for its\ncitizens.    \n\n\n\n\n\n\n\n\n\nCommunity groups are\ninvited to send submissions, not over 3 pages in length; projects\nshoul",
  "theme": "09-community-civic"
 },
 {
  "slug": "mike-arnold",
  "title": "Mike Arnold",
  "summary": "This is a draft version of the Vital Signs sponsorship solicitation, addressed to Mike Arnold with editorial notes suggesting uncertainty about co-authorship (\"John Robinson/Don Glendenning?\"). The letter is substantively similar to File 5 but includes slightly different language and proposes $20,000 sponsorship from \"Homburg enterprises\" versus the final letter's broader solicitation. The document shows the revision process Don employed when developing important sponsorship requests.",
  "content_preview": "Mike Arnold\n\n\n\n\n\n\n\nVital Signs\n\n\n\n\n\n\nThis\nletter comes as a follow-up to a recent brief conversation about a\nnew initiative, Vital Signs, being planned by the Community\nFoundation of Prince Edward Island.  First a brief note about the\nFoundation.\n\n\n\n\n\n\nThe\nCommunity Foundation of Prince Edward Island (CFPEI) is an\nincorporated, non-profit organization that provides a 'user-friendly'\nvehicle for donors to create endowment funds to support charitable\nactivities. Income generated from these investm",
  "theme": "09-community-civic"
 },
 {
  "slug": "notes",
  "title": "Notes",
  "summary": "Comprehensive planning notes for an Education 20/20 initiative titled \"Employability Skills: a community profile.\" Addresses background issues (education-jobs mismatch, employment insecurity, need for skills development), proposes creating a community profile of employability skills and piloting an employability centre. Notes include potential survey populations (recent graduates, students, employers, employees, public), funding considerations, and strategic actions (media, research, demonstration projects, panel discussions). Work was conducted in collaboration with the Community Foundation of Prince Edward Island. Shows sophisticated program planning and community development methodology.\n- **Key People**: None specifically named\n- **Key Organizations**: Education 20/20 Inc., Community Foundation of Prince Edward Island, Conference Board of Canada\n- **Tags**: PROFESSIONAL, EDUCATION, COMMUNITY, FOUNDATION, ADMINISTRATIVE\n- **Eulogy Relevance**: HIGH - Documents Don's collaborative approach to community workforce development and strategic partnerships with the Community Foundation of PEI, aligning with his later leadership roles.",
  "content_preview": "COMMUNITY\n FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n\n\n\nEmployability\nSkills: a community profile\n\n\n\n\n\n\n\nIntroduction/Background\n\n\n\n\n\n\nCurrent\nInterest in employability arises from;\n\n\t\n\n\n\tMismatch\n\tbetween education and jobs\n\t\n\nthe\n\tchanging nature in public employment policy, with increasing\n\temphasis being given to skills-based solutions to economic\n\tcompetition and work-based solutions to social deprivation.\n\t\n\nDifficulty\n\tfor recent graduates finfing full time jobs\n\t\n\nLokelihood\n\tthat people wi",
  "theme": "09-community-civic"
 },
 {
  "slug": "peila-film",
  "title": "PEILA Film",
  "summary": "Dated January 18, 2016, this letter thanks Dr. Ron MacDonald and the PEI Literacy Alliance for their $100 sponsorship of the film screening \"Most Likely to Succeed.\" Don expresses delight with both the turnout and the post-screening discussion at the theatre, as well as the facilitated discussion later at the Haviland Club. The letter treats the sponsorship as an invoice, requesting that the Literacy Alliance's cheque be made payable to the Community Foundation of Prince Edward Island. This brief note exemplifies Don's graciousness in acknowledging support and his collaborative approach to educational initiatives.",
  "content_preview": "January\n18, 2016\n\n\t\n\nDr. Ron MacDonald,\nPresident\n\nPEI\nLiteracy Alliance\n\nPO Box 20107,\n\nCharlottetown, PE C1A 9E3\n\n\n\n\n\n\n\n\n\n\n\nDear\nRon:\n\n\n\n\n\n\nI\nwant to thank you and the Prince Edward Island Literacy Alliance for\nyour financial support for the presentation of the film, Most\nLikely to Succeed. \nWe were delighted with the turn out and with the discussion in the\ntheatre following the viewing.  But I also want to thank you for\nfacilitating the discussion later at the Haviland Club.\n\n\n\n\n\n\nPlease\ncons",
  "theme": "09-community-civic"
 },
 {
  "slug": "press-release-1",
  "title": "Press Release-1",
  "summary": "Draft press release announcing establishment of Living Memorial Trust with Birch Crossing, Elmwood, PEI as the Foundation's designated 2008 planting site. References the previous site at Wood Island where trees were planted in memory of Dr. Charles Keuper, a physician who came to PEI in 1979 and worked to protect and enhance the Island's natural beauty. Details that the Living Trust was established through Keuper family efforts to provide environmental enhancement and community memorialization. Explains benefits of living memorials and provides foundation contact information. Signed by Don Glendenning.",
  "content_preview": "Draft Press Release for       , 2008\n\n\n\n\nLiving Memorial Trust Established\n\n\n\n\nIslanders have another option when contributing to the Living Trust of The Community Foundation of Prince Edward  Island; the Foundation, in partnership with the Department of tourism, has designated Birch Crossing, Elmwood, PEI  as its planting site for 2008.  Space has ben set aside for planting a cluster of trees on each side of the entrance to The Confederation Trail  as well as sites for general planting and name",
  "theme": "09-community-civic"
 },
 {
  "slug": "press-release-site",
  "title": "Press Release-site",
  "summary": "Draft press release describing a site inspection at Birch Crossing, Elmwood, PEI by Living Trust committee members and Department of Tourism officials to assess readiness for memorial and friendship tree planting. Explains the Living Trust initiative as a service allowing donations for tree planting that provides both tribute and environmental benefits including wildlife shelter, erosion reduction, and air quality improvement. Notes that focus is on Confederation Trail entrances but grants may enhance any public space. Provides contact information and donor tax receipt details. Signed by Don Glendenning.",
  "content_preview": "Draft Press Release for       , 2008\n\n\n\n\nCheck Readiness of Site\n\n\n\n\nMembers of the Living Trust committee of the  Community Foundation of Prince Edward Island visited, together with officials of the Department of Tourism, visited birch Crossing, Elmwood, PEI yesterday to check the site for planting of memorial and friendship trees later this year.  The site is one of two currently designated so far but others are planned for future years. Space has ben set aside for planting a cluster of trees ",
  "theme": "09-community-civic"
 },
 {
  "slug": "prince-street-notes",
  "title": "Prince Street notes",
  "summary": "Detailed evaluation notes on Prince Street Elementary School documenting the factors that led to the school being selected for the 2015 Excellence in Education Award. Lists 30+ salient points about the school's educational approach, including student values framework (PRINCE acronym), school mascot and song, student presentations, community partnerships, inclusive practices, student recognition programs, differentiated instruction, and family engagement. Notes show comprehensive assessment of school's holistic approach to student development and community involvement. School enrolled 260 students and was led by Principal Erin Johnston.",
  "content_preview": "EDUCATION 20/ 20 INC.\n\nEducation Excellence Award\n\nNotes \n\nSchool:  \tPrince Street Elementary School, \n\n60 Upper Prince Street, Charlottetown, PE  C1A 4S3 \n\nTelephone: \t(902) 368-6950, Facsimile: (902) 368-6959\n\nPrincipal:\tErin Johnston\n\nProposer:\tKelly Gillis, Vice Principal\n\nEnrolment:\t260 students\n\n\n\n\nSalient points\n\n  \nA variety of sound and innovative practices\n  \nNomination that was rich in detail\n  \nVariety of activities\n  \nName: Proud, Respect, Inclusive, Never give up, Caring and  Empat",
  "theme": "09-community-civic"
 },
 {
  "slug": "program-review-2",
  "title": "Program Review-2",
  "summary": "A revised January 2005 memo from Don to Ken (CFPEI Executive perspective), ccing Katy. Don reports the CFPEI Executive confirmed 2005 plans following JoAnn's secondment ending March 31 and Marla MacDonald's hiring as part-time office administrator. He frames the IAHSP mid-term review as appropriate timing given the program's completed selection process, institutional analysis of first candidates, signed agreements, and upcoming second round. Objectives: confirm program meets goals, identify challenges, identify operational improvements, and extract lessons for Round Two. Proposes simple external consultant review with standardized interviews of organizations, board, partners, and potentially unsuccessful applicants.",
  "content_preview": "Draft\n\n\n\n\nDate:\t\tJanuary 17, 2005\n\n\n\n\nTo:\t\tKen\n\nCc:\t\tKaty\n\n\n\n\nFrom:\t\tDon\n\n\n\n\nSubject:\tIAHSP Review\n\n\n\n\nIn recent weeks I have become concerned about the implementation of the IAHSP.  Let me be more specific.\n\n\n\n\nWe are half way through the project; I think that we are well behind schedule\n\nThere is always a perception in projects such as this that the bulk of the money flows to administration and to consultants.  Because we have not yet flowed money to any of the organizations, this perception a",
  "theme": "09-community-civic"
 },
 {
  "slug": "proposal-writer",
  "title": "Proposal writer",
  "summary": "Proposal for a Development Specialist position at CFPEI aimed at increasing off-island funding access for PEI nonprofit organizations. Identifies problem: smaller NGOs lack capacity and resources for proposal development and grant prospecting. Proposes components including a resource centre, trained staff for database searches, referral services, professional proposal writer, and technical support. Addresses budget considerations including staffing model and potential cost recovery options.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n\n\n\nDATE:\t\tDecember 6, 2010\t\n\n\n\n\nPROJECT TITLE:\tDevelopment Specialist\n\n\n\n\nCONCEPT:\tIncrease funding available to third sector organizations in PEI by providing technical support in their efforts to access off-island financial support devoted to the task.  \n\nSupport to include \n\naccess to a well-equipped resource centre,\n\nprospecting, \n\nproposal preparation CFPEI develop the  capacity to prepare proposals, to provide that service to other organizat",
  "theme": "09-community-civic"
 },
 {
  "slug": "prospec-black-1",
  "title": "Prospec -Black-1",
  "summary": "Personal letter from Don Glendenning to Professor R.D.H. Black dated December 1, 2004. Don references coffee conversation about estate planning and charitable giving. Positions Black as \"long-time friend\" to CFPEI and early contributor; acknowledges his brother's role as executor. Educates about community foundations' three roles: endowment building, grantmaking, and community leadership. Reflects Don's sophisticated approach to donor cultivation and his ability to articulate the Foundation's mission. Signed as \"Director\" (likely Director of CFPEI or the Arts & Heritage Stabilization Program).",
  "content_preview": "December 1, 2004\n\n\n\n\n\n\n\nProfessor R. D. H. Black\n\n42 Marjorie Crescent,\n\nStratford, PEI\t\tC1A 7T9\n\n\n\n\n\n\n\nDear \n\n\n\n\nThis note is a brief follow-up to a conversation over coffee about estate planning and charitable giving.  \n\n\n\n\nYou, Roger, were an early contributor and have been a long-time friend to the Community Foundation of Prince Edward Island (CFPEI) and, therefore, are familiar with our role and services.  You also know most if not all of the people involved with CFPEI since its inception; ",
  "theme": "09-community-civic"
 },
 {
  "slug": "prospect-hesta-1",
  "title": "Prospect Hesta-1",
  "summary": "Letter from Don Glendenning (signed \"Director\") to Dr. Hesta MacDonald dated January 10, 2005, establishing terms for an endowment fund. Letter confirms their discussions and documents understanding regarding: fund naming, donation amount ($_____ left blank in draft), permanent endowment status, annual accounting, management fees (1%), reinvestment provisions, and Foundation governance. Demonstrates Don's sophisticated fundraising and donor relationship management skills, with careful attention to legal and financial detail. Professional yet warm tone. Lists comprehensive terms protecting both donor interests and Foundation's operational needs.",
  "content_preview": "Letterhead\n\n\n\n\nDraft - January 10, 2005\n\n\n\n\nDr. Hesta MacDonald\n\n206 Spring Park Road\n\nCharlottetown, PE\tC1A 3Y9\n\n\n\n\nDear Dr. MacDonald:\n\n\n\n\nThis will confirm our recent discussion and your interest in establishing the _______________ Endowment.  As you know, I believe that the establishment of an endowment is an appropriate way to reflect your long term interest in the betterment of your community.\n\n\n\n\nBased on our discussions, it is my understanding that:\n\n\n\n\nThe Fund shall be known as the  __",
  "theme": "09-community-civic"
 },
 {
  "slug": "purdy-opeiorder-of-prince-edward-island",
  "title": "PURDY - OPEIOrder of Prince Edward Island",
  "summary": "Formal nomination letter from Don supporting Henry Purdy for the Order of Prince Edward Island, emphasizing their 50-year relationship. Don highlights Purdy's founding role at Holland College, artistic reputation, community involvement, and creative contributions, presenting Purdy as exemplary of civic engagement and artistic excellence.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown PEI  \n\nC1A 3A9\n\nMarch 4, 2020\n\n\n\n\nOrder of Prince Edward Island\n\nLegislative Assembly\n\n197 Richmond Street\n\nPO Box 2000\n\nCharlottetown, PE  C1A 7N8\n\n\n\n\nDear Sir:\n\nHenry Purdy\n\n\n\n\nI am pleased to support the nomination of Henry Purdy to the Order of Prince Edward Island. I have known Henry for fifty years and know him to be a most worthy candidate.\n\n\n\n\nHenry was a Founding member of Holland College, he was highly valued instructor, energetic and creative Di",
  "theme": "09-community-civic"
 },
 {
  "slug": "rbc-lead-second-page",
  "title": "RBC lead second page",
  "summary": "This document contains the final page of the Royal Bank lead donor proposal (see entry #17). It includes the budget breakdown, explanation of the Community Foundation of PEI's administrative role, and the specific invitation for RBC to serve as lead supporter with a $10,000 commitment. The closing statement emphasizes that \"Ensuring a quality education for every Canadian requires new thinking, new approaches and new partners\" and appeals to RBC as a potential partner whose support would turn ideas into realities. This second page, preserved separately, likely served as a follow-up or emphasis document in Don's fundraising process.",
  "content_preview": "Our group cannot make this happen alone; funds are needed firstly to continue the initiatives mentioned above, but also to support new initiatives such as user surveys, community discussions and additional incentives.  Consequently, we are looking for partners and supporters; our short term goal for support of the above initiatives is $22,000 broken out as follows:\n\n\n\n\n  \nGathering and disseminating information\t$15,000.\n  \nPromoting and awarding  incentives\t\t$   2,000\n  \nWorkshops\t\t\t\t\t$   2,500\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "remarks",
  "title": "Remarks",
  "summary": "Speaking notes for Don Glendenning before and after the Beyond Measure screening. Pre-screening remarks introduce Education 20/20's mission as a charitable, unaligned organization focused on education not merely schooling, offering monthly newsletters, school awards, workshops, and community convening. Don articulates personal conviction: education is the most important issue; government has narrow schooling-focused view while he advocates broader educational transformation. Notes his belief that citizens have lost control of schools and dissatisfaction is widespread. Post-screening remarks facilitate discussion based on the film and transition attendees to Haviland Club for continued dialogue. Demonstrates Don's philosophical grounding and facilitation skills.",
  "content_preview": "Beyond Measure-2017\n\nREMARKS-BEFORE\n\n\n\n\nWelcome all - special guests\n\n\n\n\nEducation 20/20\n\n  \nIdentify Directors: Tanya Craig, Donald DesRoches, Don Glendenning, Ambrt Jadis, Maureen Kerr, Katherine McQuaid,\n\n\n  Tim McRoberts, Anne Moore, Alice Taylor, Bill Whelan, Bill, Tom White-Hassler, \n\n  \nCharitable\n  \nUnaligned\n  \nFocus on education not just schooling\n  \nA place for people with an interest to meet, share and work together \n  \nInforming and convening\n  \nMonthly bilingual newsletter\n  \nAnnua",
  "theme": "09-community-civic"
 },
 {
  "slug": "reporter-2007-2",
  "title": "Reporter-2007-2",
  "summary": "CFPEI Community Reporter newsletter (Vol 6, No. 1, June 2007, draft version 2). Newsletter showcasing foundation activities, programs, and impact to stakeholders. Shows editorial development process for institutional communications.",
  "content_preview": "Community\n\n\n\nReporter\n\n\nVol: 6 No. 1\tJune 2007\n\n\n\n\n\n\n\n\n\t\n\n\n\t\n\t\n\n\tThe Newsletter of the Community Foundation of Prince Edward\n\tIsland\n\t\n\n\t\n\n\n\t\n\t\n\n\t\t\n\n\n\t\nPresident’s\n\tMessage\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\nNew\n\tmessage needed\n\t\n\n\tI would like to note especially, the personal and financial support\n\tof Directors; first awards from The Dr. Donald K. Taylor Fund and\n\tThe PEI Association of Architects Scholarship Funds; the increase in\n\tdonations to Island arts and cultural organizations from US\n\tcitizens, a ",
  "theme": "09-community-civic"
 },
 {
  "slug": "request-for-feedback-community-foundation-of-pei",
  "title": "Request for Feedback -Community Foundation of PEI",
  "summary": "A strategic planning document requesting feedback from Foundation stakeholders on building capacity in PEI's third sector. Don articulates the Foundation's role as a community development agency rather than merely a charity, emphasizing capacity-building, partnership facilitation, and advocacy for the non-profit sector. His vision includes increasing Island awareness, achieving operational self-sufficiency, and leveraging the Foundation's unique broad mandate to strengthen PEI communities.",
  "content_preview": "B\nuilding\nCapacity of PEI’s Third Sector \n\n\n\nAn\nInitiative of the Community Foundation of PEI \n\n\n\nA\nThree-Year Strategy \n\n\n\n\n\n\n\n\n\nPre-Session\nRequest for Feedback \n\n\n\n\n\n\n\n\n\nThe\nCommunity Foundation of PEI (CFPEI) has engaged MRSB Consulting\nServices to assist in the development of A\nStrategy to Build Capacity of the Third Sector in Prince Edward\nIsland\n– a CFPEI-lead initiative.  During the strategic planning session\nto be held on Thursday, January 20th\n(4:00 pm to 8:30 pm), we will discuss key ",
  "theme": "09-community-civic"
 },
 {
  "slug": "resignation",
  "title": "Resignation",
  "summary": "A September 2005 resignation letter from Don to Ken Gillis (IAHSP Board Chair), ccing President of CFPEI John Robinson. Don cites two concerns: (1) the Board declined his recommendation to hire an external consultant for mid-term review, instead undertaking incomplete self-review; (2) on the day addressing additional six organizations, he abstained from voting due to lack of comfort with available information about Round One strengths/weaknesses. Don reiterates recommendation for external consultant review before further financial commitments, states this would improve program delivery, and expresses continued support for the program's potential. This resignation demonstrates Don's high standards for accountability, his principled stand on governance issues, and his willingness to step down over matters of organizational integrity.",
  "content_preview": "September 13, 2005\n\n\n\n\nKen Gillis, Chair\n\nIAHSP Board\n\nWest Royalty \n\nPEI\n\n\n\n\nDear Ken:\n\n\n\n\nAs you know I have been involved with the Island Arts and Heritage Stabilization Program since its inception.  I believe in the program and its potential for having a positive impact on the arts and heritage sector in Prince Edward Island and was delighted, therefore, to become a member of the decision-making Board.\n\n\n\n\nIt is with considerable regret, therefore, that I tender my resignation effective imme",
  "theme": "09-community-civic"
 },
 {
  "slug": "robinson-cfpei",
  "title": "Robinson-CFPEI",
  "summary": "A comprehensive tribute to John Robinson's leadership and transformative impact on the Community Foundation of PEI, which grew to $13 million in assets under his direction. Don praises Robinson's business acumen, community engagement including summer visitor programs, and vision of CFPEI as essential provincial infrastructure, while describing him as a valued friend.",
  "content_preview": "John Robinson\n\nI’m pleased to say a few words about John Robinson and to thank him for his support and leadership in the life of the community in general and the work of  the Community Foundation in particular\n\nI’ve known John for 20 years, first as a successful Island business man and entrepreneur, a man, well known in the agriculture industry for progressive farming practices, leadership in the sector and stewardship of the land.  While his business was farming, his interests included the agri",
  "theme": "09-community-civic"
 },
 {
  "slug": "robinson-p2",
  "title": "Robinson p2",
  "summary": "This is the concluding page of a nomination letter for John Robinson for the Governor General's Award for a smart and caring Canadian. Don praises Robinson's leadership of the Community Foundation of Prince Edward Island, noting his role in growing foundation assets from under one to over seven million dollars. Don highlights Robinson's commitment to community foundations, his status as a respected community member, world traveler, gracious host, and good friend, positioning him as embodying the concept of a smart and caring community.",
  "content_preview": "John is currently leading the Foundation efforts in the area of development; he sees the Foundation as a key component of the provinces infrastructure, a component committed to building a pool of funds to be available in perpetuity for the betterment of the Island community – and he is having  considerable success.  Under his direction, and thanks to his energy and leadership, Foundation assets grew from under one to over seven million dollars – and he has visions for continuing growth.\n\nIn addi",
  "theme": "09-community-civic"
 },
 {
  "slug": "robinson",
  "title": "Robinson",
  "summary": "A full nomination letter to the Office of the Secretary to the Governor General of Canada, dated approximately 2015. Don supports John Robinson's nomination for the Governor General's Award, detailing Robinson's 20-year relationship with Don, his success as an Island businessman and progressive farmer, and his family's engagement in church, community, and arts/culture. The letter emphasizes Robinson's leadership with the Community Foundation since 1999, including establishing sound investment policies, engaging summer visitors, and growing assets significantly. Don concludes that Robinson exemplifies community values and deserves the award.",
  "content_preview": "Office of the Secretary to the Governor General of Canada\n\nChancellery of Honours\n\nRideau Hall\n\n1 Sussex Drive\n\nOttawa ON K1A 0A1\n\n \n\n\n\n\nJohn Robinson\n\nI am honoured to support the nomination of John Robinson for the Governor General’s Award for a smart and caring Canadian.\n\nI’ve known John for 20 years, first as a successful Island business man and entrepreneur, a man, well known in the agriculture industry for progressive farming practices, leadership in the sector and stewardship of the land.",
  "theme": "09-community-civic"
 },
 {
  "slug": "roundtable",
  "title": "Roundtable",
  "summary": "A formal proposal for a one-day Literacy Roundtable convened by the Community Foundation to bring together practitioners, providers, and stakeholders for dialogue and information sharing. The invitational event would focus on \"the interface between learner and teacher\" and accommodate diverse providers. Participants would present concerns in succession without debate, followed by thematic discussion of topics including diagnosis, teaching methodologies, assessment, and reporting. The proposal emphasizes non-attributable discussion to encourage candor, with expected deliverables including scheduled follow-up discussions, fact sheets, and potentially a \"Society for the Promotion of Literacy.\" This reflects Don's belief in the power of structured dialogue to overcome institutional silos.",
  "content_preview": "Educ-Proposal-2\n\n Subject:\tLiteracy Roundtable\n\n\n\n\nBackground:\t\n\n\n\n\nEvidence abounds as to the importance of literacy for both our individual and community welfare.  Becoming literate is a very personal experience.  In PEI, responsibility for literacy lies with a number of agencies and organizations.  A couple of years ago, the Foundation was in touch with a number of providers and, while there is a wealth of information and services available, there appears to be little coordination or exchange",
  "theme": "09-community-civic"
 },
 {
  "slug": "rural-and-north-1",
  "title": "Rural and North 1",
  "summary": "Proposal for rural and northern development program targeting Western PEI. Objective: build/strengthen community capacity of third sector in the region. Proposed activities: engage representatives from community organizations to identify regional needs and priorities; assess mandates and capabilities of agencies to identify service gaps; offer capacity building workshops on anticipated topics (budgeting, business plans, organizational analysis).",
  "content_preview": "Rural and Northern Development\n\n\n\n\nBackground:\tRefer to background notes used for building communities\t\n\nObjective:\tTo build/strengthen community capacity of third sector in Western PEI.\n\nActivities:\n\nEngage representatives of community organizations in a process to identify regional needs and priorities.\n\nAssess mandates and capabilities of agencies serving the area  with a view to identifying service gaps (Include a self assessment) \n\nOffer capacity building workshops to organizations in the a",
  "theme": "09-community-civic"
 },
 {
  "slug": "schurman-2",
  "title": "Schurman 2",
  "summary": "A follow-up letter dated May 4, 2013, updating Michael Schurman on Education 20/20 Inc.'s progress since February 2012. Don reports that workshops have been held, awards are on schedule, and a newsletter has been distributed. He mentions additional committee work organizing community workshops, website completion, expanded board membership, and investigation of adult reading levels. Don requests sustained support of $1,000 annually for three years and emphasizes that education change requires public support and information dissemination. He reiterates that the Community Foundation will receive and receipt donations.",
  "content_preview": "101\nKent St., PO Box 624 \n\n\nCharlottetown\n\n\n\nPEI\nC1A 1M0 Canada\n\nTel:\n902-892-2060\n\n\n\n\n\n\nMay 4, 2013\n\n\n\n\n\n\nMr. Michael  S.\nSchurman, President\n\nSchurman Family\nFoundation\n\n42 Mullaghmore Drive\n\nStratford, PEI  C1B 1P2\n\n\n\n\n\n\n\n\n\n\n\nDear\nMr. Schurman:\t\t\n\n\n\n\n\n\nThis\nis a follow-up to my letter of  February 1 in which I spoke about\neducation, the need for change, the newly created Education 20/20\nInc. and about plans for workshops, a newsletter, and award to\nschools; since then workshops have been held",
  "theme": "09-community-civic"
 },
 {
  "slug": "schurman-trust-agreement-2",
  "title": "Schurman Trust Agreement-2",
  "summary": "Draft legal document for the Robert C. Schurman Memorial Trust Fund (September 2007). CFPEI's institutional framework for managing memorial trusts. Shows Don's role in establishing structured philanthropic vehicles for donors.",
  "content_preview": "Draft\nRobert C. Schurman Memorial Trust Fund DG 2007-09-17\n\n\n\n\n\n\n\n\n\n\n\n\n\nCOMMUNITY\nFOUNDATION OF PRINCE EDWARD ISLAND\n\n\n119-121\nQueen St., Charlottetown,\n\n\nPrince\nEdward Island, C1A 4B3\n\n\n\n\n\n\n\nPhone:\n902-892-3440   Fax: 902-892-0880   Email:\nfoundation@cfpei.ca\n\n\n\n\n\n\n\nCharitable\nRegistration: Canada-890011190 RR0001; USA- 30-0050801\n\n\n\n\n\n\n\n\n\n\n\n\nWe,\nThe Trustees of the Robert C. Schurman Memorial Trust Fund, (The\nDonors), are now desirous of transferring the capital of the said\nTrust to the Commun",
  "theme": "09-community-civic"
 },
 {
  "slug": "sd-2011-03-proposal-research",
  "title": "SD 2011-03 Proposal Research",
  "summary": "Dated January 25, 2011 (author attribution omitted in document), this proposal addresses the nonprofit sector's capacity challenge in securing available funding. Don notes that six arts organizations eligible for federal matching grants lack capacity to apply, and larger organizations have reduced fundraising due to budget constraints. He proposes CFPEI provide selective assistance to third-sector organizations: identifying funding opportunities matching organizational interest, assessing application requirements and internal documentation availability, and providing application preparation support. Initial funding would be required, with long-term sustainability through service fees or tariffs on successful projects. The proposal reflects Don's understanding of nonprofit sector constraints and CFPEI's potential leverage role.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\n\n\n\nSD-\t\t2011-\n3\n\nDate:\t\tJanuary\n25, 2011\t\n\nPrepared\nby:\t\n\n\n\n\n\n\nTo:\t\tDirectors\n\n\n\n\n\n\nSubject:\n \tProposal Research and Technical Support\n\n\n\n\n\n\nBackground\n\n\n\n\n\n\nCFPEI\nhas encountered promising funding opportunities for itself and other\nthird sector organizations  but it appears that small organizations\nhave neither the time nor expertise in preparing proposals even when\nthe potential and payoff is obvious.  For example, at least six arts\norganization",
  "theme": "09-community-civic"
 },
 {
  "slug": "services-for-non-profits",
  "title": "Services for Non Profits",
  "summary": "This comprehensive promotional document describes CFPEI's services for non-profit organizations as of 2011. It lists hosted organization funds (cemetery, masonic, and other charity funds), describes core services including professional fund administration, grant-making expertise, low-cost management, donor relations customization, and perpetual stewardship. The document includes CFPEI's mission statement emphasizing endowment building for community vitality, highlights a 12-person volunteer board (including Don), lists recent achievements (over $60,000 annual grants, $1.5M+ portfolio, leadership capacity-building), and provides ten reasons donors choose community foundations. This represents CFPEI's professional positioning during Don's active tenure as a director.",
  "content_preview": "“SERVICES\n\tFOR NON-PROFITS”\n\t\n\n\n\n\t\n\n\n\n\n\n\tHOSTED\n\tORGANIZATION FUNDS\n\t\n\n\n\n\t\n\t\nCemetery\n\tFunds\n\t\nDundas\n\tCemetery Fund\n\t\nHighfield\n\tCemetery\n\t\nOld\n\tProtestant Burying Ground\n\t\nTryon’s\n\tPeople Cemetery\n\t\n\n\n\n\t\n\t\nMasonic\n\tFunds\n\t\nT.\n\tArthur Dawson Masonic\n\t\n\n\t Fund\n\t\nC.\n\tGordon Lord Scholarship\n\t\n\n\tFund\n\t\nMacMillan-Bagnall\n\tShrine\n\t\n\n\t Trust\n\t\n\n\n\n\t\n\t\nOther\n\t\nArchitects\n\tAssn. of PEI\n\t\nHospice\n\tAssociation\n\t\nALS\n\tSociety of PEI\n\t\nPEI\n\t4H Trust Fund\n\t\nAnonymous\n\t#2\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n",
  "theme": "09-community-civic"
 },
 {
  "slug": "shane-connolly",
  "title": "Shane Connolly",
  "summary": "Letter from Don Glendenning to Shayne Connolly, President of ADVOCIS (financial advisors), dated June (year not specified but context suggests 2004-2005). Don educates about community foundations as \"new breed\" of charitable organization, community-based rather than cause-based, increasingly chosen as legacy vehicle. Lists seven key reasons to use CFPEIs: continuity, transparency/accountability, low administration fees (1%), professional investment service, principal maintenance, adaptability, and flexibility. Emphasizes CFPEI scholarship flexibility (follows students between institutions, on/off island). Discusses customized granting programs matching donor interests. Positions CFPEI as best vehicle for creating lasting donor legacies. Reflects Don's sophisticated understanding of competitive fundraising landscape and professional relationship development with financial planners.",
  "content_preview": "Shayne Connolly, President\n\nADVOCIS\n\n124 Sydney St.\n\nCharlottetown,  C1A 1G4\n\n\n\n\nDear Shayne:\n\n\n\n\nThis is a follow-up to our telephone conversation of Friday, June 3.\n\n\n\n\nAs you know, community foundations are a new breed of charitable organization in Canada in that they are community based rather than cause based, and focus on carrying out a donor’s wishes.  Increasingly community foundations are becoming the vehicle of choice for people who wish to customize their legacies in the form of endow",
  "theme": "09-community-civic"
 },
 {
  "slug": "shea-pei-mutual",
  "title": "Shea, PEI Mutual",
  "summary": "A February 6, 2014 letter to the Windsor Foundation describing Education 20/20's three-pronged strategy: independent information via monthly newsletters and website, engagement through workshops across PEI (first held January 20, 2014 in Stratford Town Hall with good attendance), and awards/incentives addressing education sector gaps. Don emphasizes workshop success and plans for repeat sessions, describing a participant's comment that independent organization convening such meetings is itself a breakthrough. He outlines incentive ideas (math clubs, professional development, system improvements, creativity workshops) and seeks $22,000 support over 18 months with detailed budgets. The Community Foundation administers contributions.",
  "content_preview": "101\nKent St., PO Box 624/rue Kent, BP 624\n\n\n\t\t\t\t\t\t\t\n Charlottetown,\nPEI C1A 1M0 Canada\n\n\n\t\t\t\t\t\t\t\t\t\nTel:\n902-892-2060\n\n\n\t\t\t\t\t\t\t\n              Email:\npei@education2020.ca\n\n\t\t\t\t\t\t\t\t\tWeb:\nwww.education2020.ca\n\n\n\n\n\n\n\n\n\n\n\n\n\n             February 6, 2014\n\n\tWindsor\nFoundation\n\n\n\n\n\n\n\nOver\nthe past few months, I’ve been working with a small group of\nIslanders who believe that education is important, that it\nneeds some changes and that the key to change is an informed and\nengaged public.  We are also of th",
  "theme": "09-community-civic"
 },
 {
  "slug": "summercr",
  "title": "SummerCR",
  "summary": "CFPEI Summer 2010 newsletter (June, Vol. 9 No. 2) showcasing the Catherine G. Hennessey Endowment Fund establishment honoring heritage preservation work. Announces Summer Islander Lecture Series partnership with Tryon Area Historical Society featuring speakers on Island agriculture, radio history, lighthouses, and forestry. Documents 5th annual US Citizens Day celebration on July 4th welcoming American summer residents. Reports on 2009 Annual General Meeting with board transitions and new member appointments. Highlights various donor contribution options (life insurance, securities, wills/trusts). Lists Dr. Don Glendenning among current board members and acknowledges Glendenning Family Fund contributions.",
  "content_preview": "Vol. 9 No. 2\n\n\n\n\tJune, 2010\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCatherine\nG. Hennessey Endowment Fund\n\nT\nhe\nCommunity Foundation of Prince Edward Island is (Pleased or  proud?)\nto announce the recent establishment of the Catherine G. Hennessey\nEndowment Fund.  Catherine’s dedication to (preservation of) Island\nheritage is(Well known? And  what better way to acknowledge her work\nthan with the establishment of an endowment fund which will ensure\nthe preservation of heritage and urban planning to the City ",
  "theme": "09-community-civic"
 },
 {
  "slug": "summersiide-todo-list",
  "title": "Summersiide todo list",
  "summary": "Project management document dated January 18, 2007 for the February 8, 2007 Agricultural Heritage meeting with Tony Glencross as chair. Don's responsibilities included preparing the agenda, advertising in the Guardian, writing press release, providing camera/photos, and preparing multiple handouts (agricultural brochure, \"Made in Prince Edward Island,\" names/addresses sheet, inventory sheet, CFPEI newsletter). The distribution of tasks shows Don's administrative role in community foundation projects.",
  "content_preview": "January 18, 2007\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARDISLAND\n\n\n\n\nAgricultural Heritage Project\n\n\n\n\nTo-do List\n\n\n\n\n\n\n\nDate:\t\tThursday, February 8, 2007\n\nTime:\t\t9:30 – 12:00 am\n\nLocation:\tSt. Eleanor’s Recreation Centre\n\nConference Room A, Research Centre\n\n440 University Ave, Charlottetown\n\n\n\n\nChair:\t\tTony Glencross\n\n\n\n\nTo–do list\n\n\n\n\nFacilities\tReserve room - Tony\n\n\t\tCoffee – none available\n\n\t\tArrange for flipchart and pens – Tony, would they be available?\n\n\t\tForm for addresses of participants -",
  "theme": "09-community-civic"
 },
 {
  "slug": "sustainabilit-centre",
  "title": "Sustainabilit Centre",
  "summary": "January 2006 proposal for Organization Sustainability Centre/Program to strengthen NGO governance and management. Comprehensive program with six components: problem definition (critical emergency assistance up to $1K), organizational assessment ($2.5K for capacity evaluation), strategic planning support, volunteer recruitment/development, technology/information management, and skills development workshops. Targets arts and charitable organizations existing 3+ years, excluding educational institutions and professional organizations. Reflects CFPEI's sophisticated understanding of nonprofit sector challenges and commitment to building sustainable organizational infrastructure in PEI communities.",
  "content_preview": "Draft January 25,2006\n\n\n\n\nCOMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nOrganization Sustainability Centre/Program\n\nCentre for Sustainability\n\n\n\n\nBackground\n\n\n\n\n\n\n\nObjectives\n\n\n\n\nTo assist NGOs/ Charitable/arts and cultural organizations to strengthen governance and management practices through:\n\nAssess their strengths, weaknesses, challenges and opportunities\n\nIncrease capacity to plan and implement \n\nImprove the handling of information through the application of technology\n\nPartnerships and",
  "theme": "09-community-civic"
 },
 {
  "slug": "tracking-2004",
  "title": "Tracking-2004",
  "summary": "An administrative tracking document dated September 27, 2004, documenting ongoing CFPEI activities and action items. Don is listed as lead on multiple initiatives including negotiating JoAnn's secondment, organizing Board table storage, and administrative activities. The document reflects his active involvement in foundation operations and demonstrates his collaborative work with John Robinson, JoAnn, and other board members.",
  "content_preview": "TIME \\@ \"MMMM d, yyyy\" September 27, 2004\n\nCommunity Foundation of Prince Edward Island\n\nRecord of Administrative Activities\n\n\n\n\nActivity\t\t\t\t   Lead\t\t  Action\n\n  \n    \n      \n        \nAction Required\n        \n\n\n        \n1Negotiate JoAnn’s secondment\n        \n Complete audit of IAHSP \n        \nFollow up with Linkletter\n        \nConfirm Grants chair\n        \nOrganize reception\n        \nFollow-up with Arts Council\n        \n\n\n        \nNegotiate Agreement with Summerside Legion\n        \n\n\n        \nDi",
  "theme": "09-community-civic"
 },
 {
  "slug": "upson-draft-letter",
  "title": "Upson Draft letter",
  "summary": "Personal letter from Don Glendenning to Mr. Upson (possibly \"Upsen\") following a visit to his home with Norman (Carruthers), Diane, and Carol (Don's wife). Enclosing draft endowment agreement and proposing a reception at Upson's home for summer visitors interested in CFPEI. Reflects Don's personal cultivation of major donors, strategic relationship-building, and planning for the 2007 US Citizens Day follow-up event.",
  "content_preview": "Dear Mr.Upson or is it Upsen?\n\n\n\n\nIt was good to see you and Cathy on Wednesday.  We enjoyed our visit, your beautiful home, the fantastic view and your hospitality.  I know that I speak for Norman and Diane as well as Carol and myself.\n\n\n\n\nAs a follow-up to our conversation, I am enclosing a draft agreement for the establishment of a permanent endowment in the Upson name.  It is a proforma agreement and we would be happy to customize it further to reflect your interests.  We discussed a undesig",
  "theme": "09-community-civic"
 },
 {
  "slug": "us-day-cooke-us",
  "title": "US Day - Cooke US",
  "summary": "This letter from Don to Harry McLellan at Cooke Insurance invites sponsorship of CFPEI's annual US Day Reception for American citizens (summer residents and year-round inhabitants). The reception, held July 4th for five years, provides informal gathering with light food, cash bar, speakers, national anthems, and US flags, typically attracting 75-125 people. Guest speakers have included the US Consul General from Halifax. The letter solicits $250 sponsorship to support the event. This initiative demonstrates Don's strategic recognition of summer residents' charitable interest and his ability to design engaging programs building community bonds and foundation awareness among affluent US citizens.",
  "content_preview": "2011 03 21\n\n\n\n\n\n\n\nHarry McLellan\n\nCooke Group\n\n125 Pownal St\n\nCharlottetown, PE C1A 3W4\n\n\n\n\nDear Harry,\n\n\n\n\nThanks for seeing me on Thursday.  Given that I had left my file in the car, I decided to follow up with this note.\n\n\n\n\nThe Community Foundation of Prince Edward Island (CFPEI) is a volunteer driven, registered, non-profit, charitable organization.  Our mission is to improve the quality of life on PEI through the creation and building of endowment trust funds that will enhance life for all",
  "theme": "09-community-civic"
 },
 {
  "slug": "volunteer-compliance",
  "title": "Volunteer-compliance",
  "summary": "A job description for a Volunteer Compliance position within CFPEI, dated September 30, 2005. The role involves monitoring CFPEI's commitments to donors, CCRA (Canada Revenue Agency), and contractual obligations, including review of donor agreements, agency funds, investment policies, and granting procedures. Demonstrates Don's attention to organizational governance and compliance matters.",
  "content_preview": "Date:\t\tSeptember 30, 2005\n\n\n\n\nSubject:\tDescription of role\n\n\n\n\nPosition:\tVolunteer – Compliance\n\n\n\n\nAs a community foundation, CFPEI has commitments to donors and to CCRA.  As a business, CFPEI has contractual obligations and as a good citizen wishes to operate in an open and transparent fashion.  Commitments include the following:\n\n\n\n\nAgreements with major donors\n\nAgreements for agency funds\n\nRequirements of CCRA\n\nInvestment policies and procedures\n\nSpecial project funds (IAHSP)\n\nGranting polic",
  "theme": "09-community-civic"
 },
 {
  "slug": "volunteer-information",
  "title": "Volunteer-Information",
  "summary": "Operational guidelines for a volunteer media relations position at CFPEI (February 2, 2007). The volunteer would handle media releases, photography, interviews, and event coverage reporting to a Volunteer Coordinator. This document illustrates Don's systematic approach to volunteer management and organizational structure at the Foundation.",
  "content_preview": "February 2, 2007\n\n\n\n\nCOMMUNIITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nVolunteers \n\n\n\n\nInformation\n\n\n\n\nThis is a volunteer position reporting to Volunteer coordinator but working directly with individual Directors depending on the story.\n\n\n\n\nQualifications\n\n\n\n\nDemonstrated ability to:\n\nCommunicate with a variety of people\n\nTake photos\n\nWrite clearly \n\nMaintain confidentiality\n\nAssume responsibility for own work\n\n\n\n\nDuties\n\n\n\n\nPrepare media releases \n\nInterview sources\n\nCheck facts\n\nCover CFPEI e",
  "theme": "09-community-civic"
 },
 {
  "slug": "volunteers",
  "title": "Volunteers",
  "summary": "A comprehensive draft volunteer opportunities document dated May 19, 2005, listing 16 volunteer positions for CFPEI including photographer, website coordinator, IT support, comptroller, media liaison, fund development, and outreach roles targeting specific constituencies (Summer Islanders, Islanders Away, Seniors, Family reunions). Shows Don's systematic approach to building organizational capacity through volunteer engagement.",
  "content_preview": "Draft\t TIME \\@ \"MMMM d, yyyy\" May 19, 2005\n\n\n\n\nCOMMUNITY FOUNDATION F PRINCE EDSWARD ISLAND\n\n\n\n\nVolunteer Opportunities\n\n\n\n\n\n\n\nPhotographer – to take photos as required.\n\n\n\n\nWebsite coordinator – ensure that our website provides appropriate and recent information and reflects the CFPEI image\n\n\n\n\nIT User Support - to maintain the hardware and software aspect of the CFPEI's computer systems including installation of new software, resolution of operating issues, debugging, system optimizing, virus ",
  "theme": "09-community-civic"
 },
 {
  "slug": "wellington-announcement",
  "title": "Wellington announcement",
  "summary": "Public press announcement for the March 25, 2014 Education and Preparedness workshop. Promotes the event as addressing youth challenges on PEI, featuring presentations on youth survey findings from Community Foundation of PEI, and round-table discussions on preparedness issues. Contact information lists Don Glendenning as the primary contact (892-5859), identifying him as the public face of Education 20/20 on this initiative.",
  "content_preview": "Announcement\n\n\n\n\n\n\n\nEducation and preparedness\n\nThe challenges of young people on PEI will be the subject of a workshop on Tuesday, March 25, 2014 in Wellington, PEI.. The workshop will lead off with a review of a recent study of issues important to youth commissioned by the Community Foundation of Prince Edward Island.  Following a presentation by Steve McQuaid, Vice President of the Foundation and Katherine MacDonald, Researcher, participants will engage in a round-table discussion about the f",
  "theme": "09-community-civic"
 },
 {
  "slug": "wi-draft-letter",
  "title": "WI draft letter",
  "summary": "Draft letter from Don Glendenning to Women Institutes soliciting sponsorship for Youth In Philanthropy (YIP) program. Notes recruitment/retention challenges for charitable board members, especially in smaller communities (uses cemetery trustees as example). Describes YIP initiative: school-based groups explore community needs related to youth, allocate $1,000 for grants, establish endowment funds. Seeks $2,500 sponsorship per school or donations. Proposes introducing program in at least three schools in coming year for minimum three-year commitment. Includes enclosures about CFPEI and YIP project.",
  "content_preview": "January 18, 2011\n\n\n\n\nPresident\n\nWomen Institutes\n\nNOTE:I think that there is a PEI President as well as a president for individual institutes.  Seems to me that the National President is from PEI this year.\n\n\n\n\nDear \n\n\n\n\nIn the course of our activities at CFPEI, we have become aware of a major concern among charitable organizations about their ability to recruit, develop and retain board members.  The issue is quite serious; it seems, especially in smaller communities Trustees for cemeteries are",
  "theme": "09-community-civic"
 },
 {
  "slug": "windsor-foundation",
  "title": "Windsor Foundation",
  "summary": "A February 17, 2014 letter to the Windsor Foundation (Scotiatrust, Halifax) describing Education 20/20 Inc.'s founding mission and three-pronged strategy. Don explains the organization's governance by a non-partisan volunteer board and its mandate to support learning culture and ensure quality education for all Canadians. He details the strategy: independent information (monthly newsletter, website hub for surveys/announcements/papers); engagement (workshops across PEI starting January 20, 2014 with good attendance); and awards/incentives (addressing education sector gaps). Don outlines longer-term aspirations including community facilitators, expanded incentives, technology clips, student math clubs, professional teacher support, and creativity workshops. Seeking $22,000 short-term ($10,000 annually for three years), Don emphasizes innovation and requests the Windsor Foundation's partnership. The Community Foundation administers funds.",
  "content_preview": "February 17, 2014\n\n\n\n\nThe Windsor Foundation\n\nScotiatrust\n\nPO Box  457, Halifax Central\n\nHalifax, Nova Scotia,  B3J 2P8\n\n\n\n\nDear Sir:\n\n\t\n\nOver the past few months, I’ve been working with a small group of Islanders who believe that education is important, that it needs some changes and that the key to change is an informed and engaged public.  We are also of the view that the school system is unlikely to make the necessary changes by itself; so, we’ve established an independent group, Education 2",
  "theme": "09-community-civic"
 },
 {
  "slug": "wrap-up-memo-to-johnjohn",
  "title": "Wrap-up memo to JohnJohn",
  "summary": "Memo from Don to President John Robinson discussing scholarship administration improvements, referencing discussions with Gordon MacKay (UPEI), Paul Schurman, and Dr. Bonnell. Recommends CFPEI take leadership role in handling all scholarship applications, develop universal application forms, and review grant disbursement schedules. Illustrates Don's continued strategic input after presidency and focus on operational excellence and centralized administration.",
  "content_preview": "John\n\n\n\n\nCarver Scholarship\n\n\n\n\n\n\n\nAs you know, we have b been reviewing our agreements and procedures, especially, procedures for handling scholarships.  As part of the process, discussions were held with Gordon MacKay, UPEI, Paul Schurman and Dr. Bonnell.  The outcome is that CFPEI can now take the leadership role in dealing with applications for all our scholarships.  The file contains the relevant correspondence especially as it relates to the Bonnell and Carver Scholarships.\n\n\n\n\nI believe t",
  "theme": "09-community-civic"
 },
 {
  "slug": "wrap-up",
  "title": "Wrap up",
  "summary": "Alternative post-event summary showing slightly different financial accounting: 4 sponsors x $100 = $400, cash $51, totaling $451 revenue against $1,089.81 expenses, yielding $638.81 loss with $100 pending sponsorship, for net film loss of $538.81. Documents sponsorship pending from Alice Taylor and deposits split between Community Foundation ($200) and Credit Union ($251). The two wrap-up versions suggest ongoing financial tracking and reconciliation, typical of conscientious organizational management.",
  "content_preview": "Beyond\nMeasure\n\nWrap\nUp \n\n\nOctober\n17, 2016\n\n\n\n\n\n\n\n\n\n\n\n\t\n\nFilm\n\t– Beyond Measure:\n\t16, 2016 at City Cinema\n\t\n\nCommittee:\n\tKatherine,\n\tMaureen and Don\n\t\n\t\n\t\n\nAttendance-\n\t12, I think\n\t\n\nParticipation\n\tat Haviland Club: Five\n\t\n\nSponsors:\n\tRobinson, Taylor, Whelan, Holland College, Glendenning \n\t\n\t\n\nFacilitators:\n\tSteve McQuaid and Donald Arsenault\n\t\n\nExpenditure:\n\t\n\t\n\n\n\t\n\nFilm\n\trental \t$500 (US)\n\t\n\nShipping\n\t$\t100(US)\n\t\n\nTotal:\n\t\t\t$600{US)  \t$842.92(Cdn)\n\t\n\nCity\n\tCinema\t\t\t$230.00(Cdn)\n\t\n\nReturn\n\ts",
  "theme": "09-community-civic"
 },
 {
  "slug": "yac",
  "title": "YAC",
  "summary": "This document provides detailed analysis of Youth Advisory Committee (YAC) models used by community foundations across Canada, particularly the Fundy Foundation. It describes how YACs operate—student self-selection, monthly meetings, philanthropic needs assessment, local charity visits, and grant recommendations. The document outlines funding requirements ($2,500 for granting, $500 for expenses, $1,000 for overhead) and proposes CFPEI establish at least one YAC by September 2011 with a three-year commitment. It includes specific proposals for volunteer liaison positions and donor sponsorship recruitment.",
  "content_preview": "Youth in Philanthropy (YIP)\n\n\n\n\nMany community foundations operate YIP programs.  YIP’s are intended to provide opportunities for high school students to become involved in philanthropy and community development.  One model involves students in a single school; another model involves students in a community who may not all be from the same school.\n\n\n\n\nEach year in September, a Youth Advisory Committee is established.  Students self select and run the show; it may be simply a club that meets at n",
  "theme": "09-community-civic"
 },
 {
  "slug": "yip-press-release",
  "title": "YIP-Press release",
  "summary": "Public announcement of the Youth in Philanthropy program launch, distributed by Jeniene Peake (Community Foundation contact). Announces the program target of youth ages 15-18, program components (monthly meetings studying community needs, organizational site visits, proposal solicitation and assessment, grant recommendations, endowment establishment), and first-year funding allocation ($1,000 grants per group, $500 endowment matching, administrative costs). Notes informal community interest and foundation's search for donors and sponsors, with program commencement at the beginning of school year 2011.",
  "content_preview": "Youth in Philanthropy \n\n\n\n\nA Youth in Philanthropy (YIP) program is in the making at the Community Foundation of Prince Edward Island.  The program is intended for young people between 15 and 18 years and will help them gain awareness of needs in their communities and to gain experience in dealing with philanthropic matters.\n\n\n\n\nThe program will be offered through schools and youth organizations and will include, monthly meetings to study philanthropic needs the local community, visits to local ",
  "theme": "09-community-civic"
 },
 {
  "slug": "yip-speaking-notes-montague",
  "title": "YIP- Speaking notes - Montague",
  "summary": "Speaking notes from January 26, 2012 Montague Rotary Club presentation on CFPEI's Youth in Philanthropy (YIP) initiative by Don Glendenning. Outlines CFPEI background (established 1993, improving quality of life, 171 Canadian community foundations), examples of endowments and grants, and YIP program targeting youth aged 15-18. YIP youth councils self-select, meet monthly, assess community needs especially for youth, make grant decisions, and establish endowments. Annual costs are $2,500 per YIP site with $1,000 direct community distribution and $500 endowment challenge. Presentation invites Rotarians to sponsor YIP expansion.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nYouth in Philanthropy\n\n\n\n\nSpeaking notes – Montague Rotary\n\nWednesday, January 26, 12:15 pm\n\n\n\n\n1 Background on CFPEI\n\nRecognize – Andrew Daggett and Jeniene Peake \n\nFormer Directors – Connie Ings, Alfred Fraser, Anne Nicholson, Lou Ann Thompson\n\nBud Ings, Joe Spriet\n\nEstablished 1993\n\n171 in Canada\n\nImproving the Quality of Life on PEI\n\nBuilds endowments and makes grants\n\nUsed by individuals and organizations who have ideas and resources\n\nAllow p",
  "theme": "09-community-civic"
 },
 {
  "slug": "yip-speaking-notes-susmmerside",
  "title": "YIP- Speaking notes - Susmmerside",
  "summary": "Speaking notes from September 20, 2011 Summerside Rotary Club presentation introducing YIP program. Recognizes former directors Paul Schurman, Mary Wilcox, Dave Anderson. Details CFPEI directors including John Robinson, Tom Davies, Rod Nicholson, Stanley Macdonald, Jim Travers, Steve McQuaid, Rogers Bell, Tracey Laughlin, Andrew Daggett, Carol Fraser, Joyce Gaudet. Reports approximately $70,000 annual grants (exceeding $1,000,000 cumulatively since inception), specific scholarships and grants to regional institutions. Describes YIP youth councils as school-based clubs meeting monthly to assess local youth needs and allocate grants. Seeks Summerside Rotary sponsorship for YIP expansion to the area.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nYouth in Philanthropy\n\n\n\n\nSpeaking notes – Summerside Rotary\n\nTuesday, September 20, 2011 07:15 am\n\n\n\n\nOpening comments\n\nThanks for kind words\n\nCommend Rotarians\n\n\n\n\nRecognize Rod Nicholson\n\n\n\n\nBackground on CFPEI\n\nFormer Directors – Paul Schurman, Mary Wilcox, Dave Anderson\n\nEstablished 1993\n\n175 in Canada\n\nFocus on Improving the Quality of Life on PEI\n\n\n\n\nDirectors – John Robinson\n\nTom Davies\n\nRod Nicholson\n\nStanley Macdonald\n\nJim Travers\n\nSteve",
  "theme": "09-community-civic"
 },
 {
  "slug": "yip-speaking-notes",
  "title": "YIP- Speaking notes",
  "summary": "General speaking notes on Youth in Philanthropy program (undated, likely 2010-2011). Outlines CFPEI background (established 1993, 171 Canadian chapters), mission to build endowments and make grants allowing charitable legacy preservation. Identifies needs including finding/retaining trustees and addressing youth volunteerism gaps. YIP focuses on local communities with youth aged 15-18, typically school-based. Youth Advisory Councils self-select, meet monthly, identify youth needs, receive guidance and funds, expected to establish endowments. Benefits include community learning, leadership development, parliamentary procedure, proposal review/assessment skills. Startup costs $2,500 increasing to $3,000-$4,000 by year three per YAC.",
  "content_preview": "COMMUNITY FOUNDATION OF PRINCE EDWARD ISLAND\n\n\n\n\nYouth in Philanthropy\n\n\n\n\nSpeaking notes\n\n\n\n\nBackground on CFPEI\n\nEstablished 1993\n\n171 in Canada\n\nBuilds endowments\n\nMakes grants\n\n\n\n\nAllow people to leave charitable legacy together\n\nCFPEI administers estate\n\nNeed\n\nNeeds study\n\n-finding members\n\n-Retaining members\n\nDiscussions with existing trusts\n\n-succession\n\n- investment\n\n- liability\n\nYouth in Philanthropy\n\nFocus on local community\n\nEngage youth  aged 15-18\n\nUsually has a school base\n\n\n\n\n\n\n\nY",
  "theme": "09-community-civic"
 }
]