[
 {
  "slug": "0-introduction-2015-11-15t15-16-34",
  "title": "0 Introduction @2015-11-15T15;16;34",
  "summary": "Don's introduction to his \"About Education\" project, establishing that while families and individuals bear primary responsibility for education, the topic is important and complex enough to warrant professional expertise and societal support. This philosophical statement reflects his career-long conviction that education requires systematic attention and informed leadership.",
  "content_preview": "Introduction\n\n\n\n\n\n\n\n\n\n\n\nThe\nresponsibility for a person’s education rests first with family and\nlater with the individual himself or herself, but it is such an\nimportant issue and so complex that most homes and most individuals\nneed help.  Governments help, especially with education for the\nyoung, for two reasons, (1) to encourage and support citizens to\ndevelop their personal capabilities and (2) to ensure that our\ncommunities have the people needed to sustain themselves\n\n\n\n\n\n\nIt\nis important, ",
  "theme": "01-autobiography"
 },
 {
  "slug": "06-community",
  "title": "06 Community",
  "summary": "This extensive document (spanning ~5800 words) provides comprehensive history of Black River as Don recalls it. Coverage includes the physical geography of the river, early settlement by United Empire Loyalists and Scottish settlers post-1776, the progression from forestry to farming, and economic activities including shipbuilding, lumber, and fishing. Don documents place names (Upper Black River, Middle Black River, Little Branch, Fowlie's Mill, McKenzie Settlement), major institutions (four schools, two churches, community hall), the mill economy (Fowlie's gristmill and sawmill, John W. MacNaughton's operation), and the impact of WWII on community stability. He includes personal economic data from his brother Walter's 1947-48 record book showing butter prices (45 cents/lb), egg prices (30 cents/dozen), and woodcutting/threshing crew practices. The document captures Don's detailed knowledge of community infrastructure and traditional rural life before modernization.",
  "content_preview": "THE COMMUNITY OF BLACK RIVER IN 1939\n\n\n\n\n\n\n\nAlthough these notes focus on the community in 1939, a bit of background may be in order.\n\n\n\n\nThe Black River\n\n\n\n\nThe Black River is about 7 miles south of Chatham, New Brunswick and, like most rivers in Eastern New Brunswick, flows from west to east eventually emptying from the south into Bay du Vin which is part of the Miramichi River estuary.  Black River is thought to have received its name xxx.  The Eastern boundary of the Black River was the Vict",
  "theme": "01-autobiography"
 },
 {
  "slug": "20-east-or-west",
  "title": "20 East or West",
  "summary": "A detailed autobiographical narrative covering Don's 1969 decision to move to Prince Edward Island. Describes his departure from Ottawa's Training Branch (1962-1968) due to restructuring and loss of collegiality, his interview process for a Nanaimo community college presidency, and his deliberate choice to decline British Columbia in favor of PEI after an unsatisfactory conditional job offer. Demonstrates his character: intellectual rigor (organizational theory from Indiana), respect for organizational culture, and principled decision-making. Includes memorable anecdote about the Board's assumption that \"given the opportunity, one would choose BC over any other offer.\"",
  "content_preview": "East or West\t\t\n\n\n\n\n\n\n\nPeople leave current jobs or positions more often than they seek new ones.  That was certainly the case with my leaving Ottawa in 1969.\n\n\n\n\nBy the end of spring semester, 1962, my course work at Indiana University in Bloomington, Indiana, was completed, a thesis topic approved but the actual writing had not started.  Carol had worked ever since we were married, but now we had an addition to our family, a six month old baby boy.  I sought full time work.\n\n\n\n\nCanada had just ",
  "theme": "01-autobiography"
 },
 {
  "slug": "2004-education-or-schooling",
  "title": "2004-Education or Schooling",
  "summary": "A thought-piece dated July 24, 2004, in which Don challenges the common conflation of education with schooling. Drawing on Good's Dictionary and quotations from George Bernard Shaw and Bud MacDougall, Don argues that education encompasses learning from home, church, peers, travel, and community—not just formal schooling. He critiques schools for narrowly focusing on academic disciplines and advocates for including teamwork, problem-solving, and life skills in educational transcripts and student evaluation.",
  "content_preview": "July 24, 2004\n\n3-Education or Schooling\n\n\n\n\n\n\n\nRecently my wife mentioned that a daughter of a friend, or a friend of a friend’s daughter, had difficulty finding a job.  My wife commented further that she was surprised, in that the young lady in question “had a good education”.   I asked, “How do you know?”  My wife replied, “She has a Master’s Degree from” and she named the university.  I responded, “I understand that, but how do you know that she has a good education?”   This points to a very ",
  "theme": "01-autobiography"
 },
 {
  "slug": "2011-03-01-viewd-and-vignettes",
  "title": "2011-03-01 viewd and vignettes",
  "summary": "Another version of \"Holland College: Views and Vignettes - As I Remember\" (ISBN 978-0-9739752-2-2, 2011), dated March 1, 2011. Contains identical structure and content as other 2011 versions, showing Don's iterative refinement of the manuscript through early 2011. Title page shows \"Charlottetown, PEI\" and the testimonial from Malcolm S. Knowles about Holland College being a prototype for future higher education.",
  "content_preview": "As\nI Remember:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHolland\nCollege:\n\nViews\nand Vignettes \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDonald E. M. Glendenning\n\n\nCharlottetown, PEI\n\n\nISBN 978-0-9739752-2-2\n\n\n2011\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTestimonial\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I have been telling educators around the world that I view\nHolland College to be the prototype of what all higher education will\nbecome as w",
  "theme": "01-autobiography"
 },
 {
  "slug": "2011-biographical-notes",
  "title": "2011 Biographical notes",
  "summary": "*",
  "content_preview": "Donald Glendenning\n\n 62 Queen Elizabeth Dr.\n\nCharlottetown, P.E.I.\n\nCIA 3A9 Canada\n\n\n\n\nTel: (902) 892-5859\n\n\n\n\nBIOGRAPICAL NOTES\n\n\n\n\nSCHOOLING\n\nIndiana University, Bloomington, Indiana. 1960-1962, PhD in Education 1964\n\n\n\n\nBradley University, Peoria, Illinois, summer school 1953 plus, full time 1956-57; BSc. (Education);  Education 1957; MSc (Education) 1958;\n\n\n\n\nUniversity of London, Institute of Education, London, England, 1955-56, Certificate of Education 1956\n\n\n\n\nNew Brunswick Institute of T",
  "theme": "01-autobiography"
 },
 {
  "slug": "6-bio-notes-4-2012",
  "title": "6-Bio notes-4, 2012",
  "summary": "A 2012 biographical statement with full credentials (C.M. Ph.D designation). Comprehensive overview from childhood in Little Branch through teaching career, federal training specialist role, and 18-year tenure as Holland College founding president (1969-1987). Emphasizes the College's international reputation for innovative competency-based education. Details post-retirement consulting, contributions to Canadian Vocational Journal and Community Foundation publications. Lists honors: Order of Canada, Atlantic Canada Innovator Award finalist, UPEI honorary degree. Notes family: married to Carol Chesney of Peoria, Illinois; two children and two grandchildren.",
  "content_preview": "Donald Ernest Malcolm Glendenning, C.M. Ph.D\n\n62 Queen Elizabeth Drive\n\nCharlottetown, PE  C1A 3A9\n\n\n\n\n\n\n\nDonald Glendenning was born and raised in New Brunswick and taught at the elementary, secondary and postsecondary level.  He attended the Little Branch School, is a graduate of the Miramichi Rural High School, Teachers' College and the New Brunswick Institute of Technology (now the New Brunswick Community College) and studied at the University of London (England) on a Lord Beaverbrook Overse",
  "theme": "01-autobiography"
 },
 {
  "slug": "6-biog",
  "title": "6-Biog",
  "summary": "A substantially similar version to \"6-Bio for Black River 2012.docx,\" emphasizing his rural NB roots, teaching career progression, federal government training specialist role, and Holland College founding presidency. Highlights his publications (Family Chronicle), CVA Journal contributions, Community Foundation newsletter editing, and active involvement in public education advocacy through letters to editors. Describes personal pursuits: genealogy research, gardening, reading, and involvement with the Community Foundation of Prince Edward Island.",
  "content_preview": "Donald E. M. Glendenning\n\n\n\n\nDon Glendenning was born and raised in Little Branch, Black River, New Brunswick.  He attended the Little Branch School and is a graduate of the Miramichi Rural High School. \n\nFor a number of years, he taught in New Brunswick, first at Kouchibouguac, then at the Miramichi Rural High School and the New Brunswick Institute of Technology.  After a number of years as a training specialist with the Federal government, in Ottawa, he moved to Prince Edward Island where he w",
  "theme": "01-autobiography"
 },
 {
  "slug": "82-whither-bound",
  "title": "82 Whither bound",
  "summary": "Don expresses frustration with education system direction, noting changes often unlinked to improving student skills, knowledge, or attitudes. Reframes education's purpose as helping Islanders develop abilities needed for thriving in daily life, not merely what happens in schools. Questions whether limiting education to government-delivered schooling represents too narrow a vision. Criticizes focus on \"excellence\" without linking to actual learning outcomes. Highlights Saskatchewan Teachers' Federation calls for shared accountability, provincial education councils, and education hubs. Reviews Hechinger Report's coverage of US education trends and contributes financially to the publication. Discusses CVA-ACFP newsletter focus on teacher competencies and university relevance. Reflects Don's broader systemic critique and search for coherent education vision beyond institutional reporting.",
  "content_preview": "Open\n\tEducation\n\t\n\n\tNo. 82\t\t\t\t   \t\t\t                                 \n\t      November 20, 2019\n\t\n\n\tNothing\n\tis so unequal as the equal treatment of un-equals – John Terry\n\n\n\n\t\n\n\n\t\n\n\n\n\tWHITHER\n\tBOUND?\n\t\n\n\tIt’s\n\tunclear to me what our education system is up to; we hear about\n\tchanges in schools but seldom are the changes linked to improving\n\tthe skills, knowledge or attitudes of students; to paraphrase\n\tTalleyrand, it’s time for education to establish underlying\n\tprinciples instead of simply repor",
  "theme": "01-autobiography"
 },
 {
  "slug": "99-2-rating-scale",
  "title": "99 -2 Rating Scale",
  "summary": "Don recounts observing a handyman's consistent, self-directed, quality work and wonders why schools don't develop similar practical rating scales for employment-bound students and vocational learners. He advocates for rating scales with five or six competency levels that focus on practical attributes (speed, accuracy, initiative, safety, quality) rather than abstract grades. This approach, he argues, enables self-assessment discussion and strengthens soft skills and personal attributes. He also notes Ontario's 2020 math curriculum redesign incorporating financial literacy and coding, suggesting this reflects growing recognition that math education must connect to real-world application.",
  "content_preview": "Open Education\n\nNo. 99\t\t   \t\t\t                                        \t                 February 20, 2020\n\nStudents said “they wanted instruction that feels relevant, more career pathways, teachers that slow down and after school clubs for socializing, getting homework help, and learning to navigate their schools and communities” -\tWashington Post\n\nRATING STUDENT PROGRESS\n\nHad someone doing some work around my cottage recently, just handyman stuff – fixing stairs, staining deck, repairing railin",
  "theme": "01-autobiography"
 },
 {
  "slug": "bio-notes-3",
  "title": "Bio notes-3",
  "summary": "Duplicate of earlier \"6-Bio notes-3.doc,\" an author biography with comprehensive educational and career overview plus substantial publications list: federal support review (1991), DACUM methodology books (1997-1998), competency education manual (1996), standards guide (2000), Presbyterian history of Black River (2003), Family Chronicles compilation (2005), and genealogy work (2007), plus unpublished Carol Chesney Glendenning genealogy. Emphasizes his consulting work in education and governance across Canada and overseas, Community Foundation directorship, and editorial contributions to professional publications.",
  "content_preview": "ABOUT THE AUTHOR\n\n\n\n\nDonald Glendenning was born and raised in New Brunswick and taught at the elementary, secondary and postsecondary level.  He attended the Little Branch School, is a graduate of the Miramichi Rural High School, Teachers' College and the New Brunswick Institute of Technology (now the New Brunswick Community College) and studied at the University of London (England) on a Lord Beaverbrook Overseas Scholarship.  He holds a B.Sc. and MSc. from Bradley University and a Ph.D. from I",
  "theme": "01-autobiography"
 },
 {
  "slug": "bookclub",
  "title": "bookclub",
  "summary": "Carol Glendenning's personal memoir covering her childhood in Illinois (born Henry, Illinois; parents farmed), early loss of mother (died one week after Carol's birth), and upbringing by aunt Esther Jardine and uncle in Peoria. Documents rural childhood, school experiences, friendships, radio shows (Lone Ranger), reading (Nancy Drew), sports, family picnics, 1940s fashion, visit to Chicago at age 16, and entry into nursing training (1957) at Methodist Hospital Peoria. Confirms Carol was from Peoria (raised by aunt) prior to meeting Don at Bradley University. Demonstrates Carol's own substantive life narrative and reflective character.",
  "content_preview": "I was born in Henry,Illinois, a small town of under 1000 people, nestled on the banks of the Illinois river.My parents lived on a farm. Unfortunately my mother died a week\n\nAfter I was born due to an infection.My sister, Marjorie, was 6.\n\nMy father had a housekeeper come in and my sister later went to live with an aunt and uncle in Milwaukee. I stayed on the farm until I was 4 or so and then went to live with\n\nMy father’s sister and her husband in Peoria,Ill a short distance away. I stayed there",
  "theme": "01-autobiography"
 },
 {
  "slug": "boxing-match",
  "title": "Boxing Match",
  "summary": "Don's vivid childhood memory of June 22, 1938, when Joe Louis defeated Max Schmelling in a famous rematch. Don was eight years old, sitting with his mother across the road from Uncle Jim's house where men gathered to listen to the radio broadcast. The incident captures the excitement of a historic boxing moment during a period of rising anti-German sentiment and Don's childhood in rural New Brunswick.",
  "content_preview": "Boxing Match\n\n\n\n\nJune 22, 1938 was a beautiful sunny summer day.  I recall sitting under the apple tree in the front yard with Mum.  Across the road, a few people gathered at Uncle Jim’s to listen to the radio.  Uncle Jim had removed the lower sash of the kitchen window so the men could hear the broadcast better.  It was a rematch between boxing great, Joe Louis, and Max Schmelling.  Mum would not let me go across to listen although I could still hear from across the road.\n\n\n\n\nFeelings ran high.",
  "theme": "01-autobiography"
 },
 {
  "slug": "carol",
  "title": "Carol",
  "summary": "A home-exchange advertisement letter dated 2005 from Don and Carol seeking a non-simultaneous March exchange with June/July/September availability. The letter describes their Charlottetown home (3 bedrooms, 2 bathrooms in a residential area, 5 minutes from Victoria Park) and pitches Prince Edward Island as a summer destination with theater, beaches, and scenery. Provides personal details about Don's retirement life and travel interests with his wife Carol.",
  "content_preview": "Dear\n\n\n\n\nWe are a retired couple looking for  a non-simultaneous exchange for the month 0f  March\n\n\n\n\n\n\n\n2005, and our house is available for June, July  or Sept  2005 as we will be at our cottage \n\n\n\n\nduring those months.\n\n\n\n\nWe live in Prince Edward Island off the east coast of Canada. It is a delightful place to \n\n\n\n\nVisit in the summer months with live theater, beaches, beautiful scenery .\n\n\n\n\nFor more info visit PEI’s  tourist website.\n\n\n\n\nOur home with 3 bedrooms, two bathrooms, and all mo",
  "theme": "01-autobiography"
 },
 {
  "slug": "collecting-sap",
  "title": "Collecting Sap",
  "summary": "Brief account of Don's spring chores on the family farm: tapping maple trees on the ridge with his brother Ken, collecting sap in milk cans and barrels, and his mother's labor-intensive process of boiling sap into syrup and sugar. Don recalls his responsibility for keeping the woodbox filled during the long boiling process.",
  "content_preview": "Collecting Sap\n\n\n\n\nWe always tapped a few maple trees on the ridge when the nights were cool and the days were warm.  The sap was good to drink but had little if any taste.\n\n\n\n\nI recall occasions of going to the Ridge with Ken early in the morning to empty the sap buckets.  Ken hitched the horse and we took milk cans, of the kind used to ship cream to the creamery and I recall once taking the barrel from the churn to bring the sap to the house.\n\n\n\n\nOn occasion, and maybe frequently, Mum would bo",
  "theme": "01-autobiography"
 },
 {
  "slug": "dad",
  "title": "Dad",
  "summary": "Don's personal memoir of his father Elmer Glendenning, recounting scattered memories including conversations on a porch couch, waving to Richard Godfrey, a harrowing experience with horses during a storm inside Victoria bridge, his father's death in 1938, and the large funeral that followed. These intimate recollections reveal Don's close family connections and early life experiences in rural New Brunswick.",
  "content_preview": "Dad\n\nJune 26 ?1875-May 18 or 19, 1938 – about midnight\n\n\n\n\n\n\n\nI’ve told quite a bit about my father in my family documents and family chronicles so will not repeat it here.\n\n\n\n\nActually remember very little direct contact with my father\n\n\n\n\nDad had made a wooden couch, it was in the front porch, porch was across the whole front of the house and closed in; Dad was stretched out on the couch and I was stretched out with him; it may have been the tome either Grace or Venetia was getting or had just",
  "theme": "01-autobiography"
 },
 {
  "slug": "dentist",
  "title": "Dentist",
  "summary": "Brief account of Doug Dower, a resident dentist in Black River who operated from David Murdoch's house (north side of river below Uncle Jack Godfrey's property). Don recalls his brother-in-law Cameron Russell and brother Norman visiting Dower for tooth extractions on Sunday afternoons without anesthesia. Dower later closed his office, moved to Chatham, and eventually established a fishing/hunting camp near Horton's Creek bridge.",
  "content_preview": "Dentist\n\n\n\n\nAt one time, Black River had a resident dentist in the person of Doug Dower.  His office was set up David Murdoch’s house on the north side of the river just below Uncle Jack Godfrey’s.  I cannot recall whether this was a full-time or part time office.  I do remember, though, that Cameron Russell, my brother-in-law, went to him one Sunday afternoon to have a tooth extracted – extracted, as I recall, without the aid of laughing gas or freezing; Norman remembers going to Doug Dower als",
  "theme": "01-autobiography"
 },
 {
  "slug": "elmer",
  "title": "Elmer",
  "summary": "Biographical portrait of Elmer Alton Glendenning's early life and career in the USA before 1910 return to Canada. Documents Glendenning family migration to Portland, Maine (siblings including Venetia, Margaret, Frank, Raymond, Guy) and family valuing of education (Uncle Chip's business course, Uncle Guy's dentistry study, Aunt Margaret's nursing). Traces Elmer's work progression: likely started in woods of Maine/New Hampshire (near Skowhegan, Millinocket, Berlin); worked lumbering in New Hampshire with horses, establishing record lumber cut on camp wall (recalled by multiple family members). Pre-1910, Elmer and brother Frank operated Glendenning Bros. & Co. cartage business from 24 Hammond Street, Portland (ice delivery service, general team work). Sent money to parents until age 30. Briefly describes Wisconsin work period: January 25, 1910 letter from Wisconsin to sister Jeannie; September 18, 1910 autograph album entry as \"Wausau, Wisconsin\" address; July 18, 1910 postcard from dam work at Rothschild, Wisconsin. Notes dam construction work (logging improvement and power generation purposes). Recounts author's 1993 Portland visit finding East Portland/Munjoy Hill completely rebuilt. Places Elmer within context of Maritimer migration wave to \"Boston States\" for economic opportunity.",
  "content_preview": "Elmer Alton Glendenning\n\n\n\n\n\n\n\n\nGlendennings seemed to have been well\nestablished in Portland at the turn of the century with Venetia, the\noldest child likely having played the role of \"host\" as\neach new family member moved south.  Venetia's address was Falmouth\nForeside which is just north of Portland and between Portland and\nFreeport.  Falmouth Foreside still exists although it may be\nconsidered part of the Portland metropolitan area.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWe do not know the year that Dad went\n\tto t",
  "theme": "01-autobiography"
 },
 {
  "slug": "fowlies-mill",
  "title": "Fowlies Mill",
  "summary": "Don documents Fowlie's Mill on the Little Branch River, citing an 1833 Gleaner quote praising George Fowlie's new gristmill producing \"superior quality\" flour. The sawmill was constructed adjacent to the gristmill; in 1939, the gristmill was defunct but the sawmill still operated, both water-powered. Don recalls the old gristmill served as a training center for carpentry and blacksmithing around 1939-40 as part of a national program for unemployed youth. He mentions boarding participants including Hes Ross and Hugh Gibson. Photographs from Everard and Bertie MacLean (dated 1940) show John Fowlie, his horse and cart with mill ends, and George R. Fowlie operating the sawmill. This demonstrates Don's access to community archival materials and personal anecdotes about pre-war employment programs.",
  "content_preview": "Fowlie's Mill\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nAlthough\n\tthere were a number of sawmills in the area, it appears as though\n\tthe first gristmill, paddled powered, was located on the Little\n\tBranch River.  LOOKING\n\tBACK: A History of Bay du Vin New Brunswick\n\tprovides the\n\tfollowing quotation from the Gleaner in 1833:\n\t\n\n\n\n\t\n\t\n\"“Mr.\n\tGeorge Fowlie erected a grist mill on the Little Black River, which\n\tcommenced grinding last week.  We have seen some bread made of the\n\tflour manufactured ",
  "theme": "01-autobiography"
 },
 {
  "slug": "hallmore-tractor-2",
  "title": "Hallmore tractor-2",
  "summary": "September 1, 2008 updated version of the Hall and Stavert tractor story. Provides refined narrative of how Don learned of the tractor's existence through Jim Stavert (son of founder), researched the manufacturer, and ultimately connected with Dr. Arleon Kelley to help locate it in Illinois. Shows Don's collaborative approach and dedication to reuniting Island artifacts with their heritage.",
  "content_preview": "Sept 1, 2008\n\nAgricultural Heritage Project\n\n\n\n\nBackground notes on the Hallmore Tractor\n\n\n\n\n\n\n\nHall and Saver was a partnership of Harold Hall and Stafford Stanley established in Charlottetown the 1930s.  They operated a foundry and produced equipment primarily for the agricultural and fishing industry.  Around 1940, they produced a conversion tractor.\n\n\n\n\nMost farm tractors were purpose built, however, during the period, a number of companies built conversion kits that allowed a farmer to conv",
  "theme": "01-autobiography"
 },
 {
  "slug": "intro",
  "title": "Intro",
  "summary": "Introduction and foreword to Don Glendenning's autobiography/memoir \"A Round Trip from Little Branch: Recalling the Journey.\" Authored by Don himself with some sections completed by family members. Covers his birth Sept 8, 1929 in Little Branch, ninth and last child of Elmer and Jeannie Glendenning. Documents his education (St. Pauls Presbyterian Church, Little Branch School, Miramichi Rural High School), left home at 16 for higher education, 50+ year career in education (teacher, administrator, Holland College president 1969-1987, consultant). Married Carol Louise Chesney of Illinois Jan 31, 1958; two children Brian and Janet. Notes extensive work in New Brunswick, Ontario, BC, Indiana, and PEI. Table of contents indicates extensive biographical documentation. Critical foundational document for understanding Don's life trajectory and achievements.",
  "content_preview": "A ROUND TRIP FROM LITTLE BRANCH\n\n\n\n\nRecalling the Journey \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nby\n\n\n\n\nDonald Ernest Malcolm Glendenning. C.M., Ph.D, LLD\n\n1929 - 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFOREWARD\n\n\n\n\n\n\n\nOn Sunday evening, September 8, 1929 at Little Branch, Northumberland County, New Brunswick, Mrs. Elmer Glendenning gave birth to a son, Donald Ernest Malcolm.  He was the ninth and last child in the family.\n\n\n\n\nDon grew sup in the community, attended St. Pauls Presbyterian Chu",
  "theme": "01-autobiography"
 },
 {
  "slug": "land-grants-on-the-little-black-river",
  "title": "Land Grants on the Little Black River",
  "summary": "Dated August 18, 2004, this detailed genealogical document lists original land grants along Black River and tributaries with grantee names, acreage, and dates. Don traces his maternal ancestry through Jubal Watling (his grandfather), noting grants of 100 acres at Lot 30 in the Meadows on April 20, 1881. He documents Jubal Watling's children, neighbors' grants from 1812-1881, and traces the family's property history. Don recalls his mother Jane (born 1890) walking to school from the Meadows property. The document notes that buildings have \"long since disappeared\" and \"the community has disappeared\" with forest reclaiming cleared fields. This demonstrates Don's deep genealogical research and family connection to early settlement patterns.",
  "content_preview": "TIME \\@ \"MMMM d, yyyy\" August 18, 2004\n\n\n\n\nLand Grants on the Little Black River\n\n\n\n\nThe following is a list original grants along the Black river and its tributaries..  Information was gathered from two sources  \n\n\n\n\nAs a starting point, I decided to follow the pattern of settlement.  This means starting at the mouth of the river and working my way to its origin at the Meadows.\n\n\n\n\nLot No.\tGrantee\t\tAcres\t\tDate Granted\n\n\n\n\n \t1      \tEnoch Godfrey\t\t140 Acres\t1812-06-03\t\n\n\n\n\n\t2      \tAlexander McD",
  "theme": "01-autobiography"
 },
 {
  "slug": "little-branch-school",
  "title": "Little Branch School",
  "summary": "Extensive first-person memoir written by Don describing his childhood schooling at Little Branch School in Black River. Details about four one-room schools in the area, daily challenges including lack of running water, physical punishment with strapping, and ingenuity in student life. Notable anecdotes: water carried from Don's house, eating lunch from Dominion shortening pails cooled in the brook, and being contracted to start the school fire at 7:30 am. Describes transition to Miramichi Rural High School in January 1940 with its modern amenities and influence of Macdonald Schools. Sent to Kaye Lister for retired teachers magazine in March 2007.",
  "content_preview": "~~~~~~\n\n\n\n\nAs I Recall:\n\n\n\n\nSome memories of the Little Branch School\n\n\n\n\nThere were four one-room schools in Black River; I lived near, and attended, the Little Branch School as did my brothers and sisters before me.  Although I lived close to the school, many students lived a mile or more away.  For most students, the Little Branch School provided their entire formal schooling; a fortunate few stayed with relatives and attended high school in Loggieville or Chatham.\n\n\n\n\nThe Little Branch Schoo",
  "theme": "01-autobiography"
 },
 {
  "slug": "memories-2011",
  "title": "MEMORIES-2011",
  "summary": "Collection of Don's personal recollections from St. Paul's Presbyterian Church in Black River, including memories of gas lamps, oyster suppers, and early automobiles. Don shares vivid details of childhood experiences attending services and traveling by horse and wagon to church. The document captures his appreciation for small-town community traditions and religious life.",
  "content_preview": "MEMORIES\n\n\n\n\nThe writer has many fond memories of St. Paul’s Presbyterian Church and decided to share some as part of this record.  A request for recollections was sent to others but the list was short, except for relatives, because of the lack of current addresses.  The comments received are included in random order below.\n\n\n\n\nI remember:\n\n\n\n\n  \nThe hissing of the gas lamps.  There were three, two double lamps over the main aisle and a single lamp over the choir stand.  As dusk began to settle,",
  "theme": "01-autobiography"
 },
 {
  "slug": "near-fire",
  "title": "Near fire",
  "summary": "Don recalls a dangerous near-fire in the family home when a cracked furnace allowed flames into the brick chamber while cats disturbed insulation material on top. His brother Kenneth extinguished the fire and the furnace was later replaced with help from Norman MacKenzie.",
  "content_preview": ".\n\n\n\n\nA Near-fire\n\n\n\n\nKen and I were recalling a near fire at home, I am not sure of the year.  As I recall, Ken, Norm and I were hauling wood one spring day, although there was still lots of snow around.  We were hauling the wood on a large hand-sled, John’s sled we always called it.  Ken smelled smoke and was met by smoke when he opened the cellar door.\n\n\n\n\nAt our place, the furnace firebox was set inside a brick box about 5’x5’ x5’.  Another brick wall was built outside the first leaving an a",
  "theme": "01-autobiography"
 },
 {
  "slug": "st-paul-s-memories-of",
  "title": "St. Paul's Memories of",
  "summary": "Don's personal memoir of his early years at St. Paul's Presbyterian Church in Black River Bridge, New Brunswick, written for the church's anniversary. Describes his father's involvement in church construction, his mother's active membership, childhood experiences of worship and community, and the important role church life played in his family. Reveals formative influences on Don's character and values.",
  "content_preview": "Memories\n\n of \n\nSt. Paul’s Presbyterian Church\n\nBlack River Bridge, NB\n\nJuly 00, 2023\n\nOn this anniversary occasion, I am pleased to provide a few recollections about my life and times in St. Paul’s Presbyterian Church in Black River Bridge, New Brunswick. Although I actually participated in the official opening on July 20, 1930, my memories of the event are a bit hazy.  I understand, however, that older siblings were actually at a church event when I arrived at Little Branch on a Sunday evening",
  "theme": "01-autobiography"
 },
 {
  "slug": "transportation",
  "title": "Transportation",
  "summary": "Part of 'The Family Chronicle' newsletter (No. 69, May 21, 2004) documenting Don's family connections in Scotland and the United States. Includes correspondence from new owners of Callister Hall (ancestral Glendenning home in Scotland) and death notices of Don's grandfather Walter Glendenning (1908, Falmouth, Maine) and grandmother Elizabeth Peters Glendenning (1915). Also discusses early transportation in rural New Brunswick, including the first automobiles (Fred A. Fowlie, Harrison Smith, Malcolm MacNaughton) and Dr. MacKenzie's early snowmobile. Notably, Don's sister Venetia was born on the day their grandmother died.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n69\t\t\t\t\t\t\t\t\t\t              May 21, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nDon\n\tGlendenning at Callister, Scotland - 1988\n\t\n\n\n\n\t\n\t\nCallister\n\tHall\n\t\n\n\n\n\t\n\t\nReaders\n\twill remember an earlier chronicle with a photo of Callister Hall in\n\tScotland where my Great Grandfather, John Glendinning was born on\n\tApril 2, 1807.  The latest descendant to",
  "theme": "01-autobiography"
 },
 {
  "slug": "watlings-at-the-meadows",
  "title": "Watlings at the Meadows",
  "summary": "Don's genealogical research distinguishing between three different Jubal Watlings and documenting the land grants and property locations of the Meadows community (near Black River). Includes property petitions and crown land grants from the 1850s onward, naming neighbors and acreage. Don recalls childhood visits to the property picking blueberries and notes that the community has since reverted to forest, preserving family memory of a lost settlement.",
  "content_preview": "Watlings at the Meadows\n\n\n\n\nJanet Watling asked recently about the early Watlings at the Meadows.  It is confusing because, as we know, there were at least three Jubal Watlings.\n\n\n\n\nJubal 1 married Susan Leach.  I have no evidence that they came to Canada or Black River.\n\n\n\n\nA Jubal Watling, I believe to be Jubal 2 married to Christina MacNaughton,    petitioned (F4243) for 50 acres of land “situate as follows: on the South side of Black River adjoining south of William McBeath’s meadow lot and ",
  "theme": "01-autobiography"
 },
 {
  "slug": "wool-and-yarn",
  "title": "Wool and Yarn",
  "summary": "Recollections related to sheep farming, wool processing, and yarn production in the Miramichi region. Documents traditional agricultural and textile activities that provided supplementary income and self-sufficiency for rural families.",
  "content_preview": "Wool and Yarn\n\n\n\n\nWe always kept a few sheep, perhaps a dozen or so – nor am I sure of the breed although I know they were white.  The sheep had their own shed at the top of the hill where we coasted.  It was easy to climb onto the roof of the sheep shed and jump off into the snow bank, which curled around it.  \n\n\n\n\nEach spring there were new lambs, usually twins but sometimes only one; they always seemed sickly and some had to be nursed with a bottle.  Sometimes they were brought into the house",
  "theme": "01-autobiography"
 },
 {
  "slug": "102-9-role-of-gov",
  "title": "102-9 Role of Gov",
  "summary": "A different draft letter responding to questions about education received during the Christmas season. Uses a bullet-point format to outline organizational and systemic issues in PEI's education system, including lack of autonomy for schools, limited accountability, and politicization. Notes plans for future commentary on teaching/learning models.",
  "content_preview": "Editor\n\nDear\nSir\t\n\n\nRe-setting\ndirection\n\nOver\nthe Christmas season, I was asked on a number of occasions for my\nviews on education; I thought I would make those views the subject of\nthis, my first letter in the new year.  In brief, public concern is\ngrowing an optimism yhat improvement is on the way is falling.   On\nthe organization side:\n\n\t\n\nInformation\n\tis an education service and should be expanded. \n\t\n\t\n\nRole\n\tof Department  should expanded from that of delivering programs to\n\tone of encour",
  "theme": "08-correspondence"
 },
 {
  "slug": "2005-ord4er-of-canada",
  "title": "2005-Ord4er of Canada",
  "summary": "October 2005 letter from Don Glendenning (C.M.) to Rideau Hall supporting Wade MacLaughlin's nomination for Order of Canada. Signed as C.M. (Companion of the Order of Canada), confirming Don's own Order of Canada status and his respect for MacLaughlin's university leadership contributions.",
  "content_preview": "October 24, 2005\n\n\n\n\n\n\n\n62 Queen Elizabeth Drive\n\nCharlottetown, PE C1A 3A9\n\n\n\n\n\n\n\n\n\n\nMs Jacqueline Barton\n\nResearcher and Regional coordinator\n\nOrders Section\n\nRideau Hall\n\n1 Rideau Street\n\nOttawa, Canada K1A )A1\n\n\n\n\nDear Ms Barton:\n\n\n\n\nI am delighted to add my support to the name of Wade MacLaughlin for membership in the Order of Canada.\n\n\n\n\nI have known the MacLaughlin family for many years and they were and are well established and respected on Prince Edward Island.  I got to know Wade first",
  "theme": "08-correspondence"
 },
 {
  "slug": "2011-02-11-draft-letter",
  "title": "2011-02-11 Draft letter",
  "summary": "Personal letter from Don Glendenning to Mary Beth Harris (February 15, 2011) following their charitable consultation meeting. Advises Harris to consult financial advisors regarding charitable contributions from art sales, provides an amended organization list, presents sample calculations for a $500,000 endowment, and explains CFPEI's model of establishing permanent charitable plans rather than relying on wills. Demonstrates Don's consultative approach and emphasis on flexibility for donors to modify charitable priorities without legal costs.",
  "content_preview": "February 15, 2011\n\n\n\n\nMs. Mary Beth Harris\n\nPark West Lodge, Room 302\n\n22 Richmond St\n\nCharlottetown, PEI C1A 1H4\n\n\n\n\nDear Mary Beth:\n\n\n\n\nFirst, thank you for the opportunity to discuss you charitable interests with John Robinson and myself on Friday, February 11.  Hopefully, it was useful to you as you consider making provision to continue your exploration.\n\n\n\n\nHere are some specific observations:\n\n\n\n\n1\tGiven your plans to sell some paintings and make charitable contributions with the income, w",
  "theme": "08-correspondence"
 },
 {
  "slug": "2016-amendment-baksh-5",
  "title": "2016 Amendment Baksh-5",
  "summary": "February 16, 2016 letter from Don Glendenning (President, CM designation) to Ms. Mezaun Baksh at CRA providing Certificate of Amendment from Minister of Industry. Notes Don's travel absence (Feb 19 - Mar 18) but commits to email contact. Shows continued engagement in organizational amendment/registration process post-rejection.",
  "content_preview": "February\n16, 2016\n\n\n\n\n\n\n\n\n\n\n\nMs. Mezaun Baksh\n\nCharities Analyst,\nCharities Directorate\n\nCanada Revenue\nAgency\n\nOttawa, ON  K1A 0L5\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Ms. Baksh:\n\n\n\n\n\n\nEducation\n20/20 Inc. – file 3050233\n\nCertificate\nof amendment\n\n\n\n\n\n\nFurther to your\nletter of January 20, 2016. I am pleased to provide a copy of the\nCertificate of Amendment issued by the Minister of Industry, along\nwith his supporting documentation.  If you need any additional\ninformation, do not hesitate to let me know.\n\n\n\n\n\n",
  "theme": "08-correspondence"
 },
 {
  "slug": "chapman-2015-12-17t09-55-48",
  "title": "Chapman @2015-12-17T09;55;48",
  "summary": "A letter of nomination from Don (as President Emeritus of Holland College) recommending Mike Chapman for membership on the Learning Partners Advisory Council, highlighting Chapman's extensive career in electronics education and Holland College's trades training programs. The letter demonstrates Don's ongoing engagement with educational institutions and his willingness to mentor and advocate for colleagues.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown\n\nPEI C1A 3A9\n\n\n\n\nNovember 16, 2015\n\nLearning Partners Advisory Council\n\nPO Box 2000\n\nCharlottetown, PEI\n\nC1A 7N8\n\nDear Sir:\n\nMr. Mike Chapman\n\n505 Keppoch Rd\n\nStratford PE C1B 2J8\n\nTel: 902-5659-4038\n\nEmail: mikechapman@eastlink.ca\n\n\n\n\nI am pleased to nominate Mike Chapman as a member of the newly formed Learning Partners Advisory Council.  Mike was born in Cambridge, England, graduated in electronics from Bottisham College, and spent a number of years in ",
  "theme": "08-correspondence"
 },
 {
  "slug": "craig-2015-12-31t01-34-15",
  "title": "Craig @2015-12-31T01;34;15",
  "summary": "A letter of nomination from Don recommending Tanya Craig for the Learning Partners Advisory Council, citing her background in community development, youth programming, and educational engagement in Stratford, PEI. The nomination reflects Don's continued leadership in PEI educational and community initiatives during his retirement years.",
  "content_preview": "62 Queen Elizabeth Drive\n\nCharlottetown\n\nPEI C1A 3A9\n\n\n\n\nNovember 16, 2015\n\nLearning Partners Advisory Council\n\nPO Box 2000\n\nCharlottetown, PEI\n\nC1A 7N8\n\nDear Sir:\n\n\n\n\nMs Tanya Craig\n\n41 Rodgerson Crescent,\n\nStratford, PE  C1B 2G7\n\nTel: 902-314-4030    Email:tjcraig@eastlink.ca\n\n\n\n\nDear Sir: \n\n\n\n\nI am pleased to nominate Tanya Craig as a member of the newly formed Learning Partners Advisory Council.\n\n\n\n\nTanya was born in Charlottetown, attended West Kent Elementary School, Queen Charlotte Junior",
  "theme": "08-correspondence"
 },
 {
  "slug": "governor-general",
  "title": "Governor General",
  "summary": "Letter from Don Glendenning to Secretary to the Governor General discussing proposals for an Order of Canada Association. Presents Don's vision for fellowships, conferences focused on Canada's future, and community engagement—reflecting his thought leadership on national service and civic responsibility.",
  "content_preview": "Stephen Wallace\n\nSecretary to the Governor General\n\n1 Sussex Drive\n\nOttawa, Canada1A 0A1\n\n\n\n\nDear Sir:\n\n\n\n\nI am delighted to receive your letter and certainly support the establishment of an Order of Canada Association as outlined in your letter; while I do not know all the Members of the Order on PEI personally, I expect there will be considerable interest in such an activity.\n\nAs for particular initiatives, my mind turns such thing as:\n\n  \nAn annual local or provincial gathering with national ",
  "theme": "08-correspondence"
 },
 {
  "slug": "letter-1",
  "title": "Letter 1",
  "summary": "Letter from Don Glendenning to David Cadogan discussing governance and tax implications of the Cadogan Foundation's relationship with CFPEI. Demonstrates Don's expertise in charitable law, CRA interpretation, and his hands-on involvement in foundation governance decisions.",
  "content_preview": "Mr. David Cadogan\n\nPO Box 397\n\nMiramichi, NB\n\nE1N 3A8\n\n\n\n\nDear David:\n\nCadogan Foundation\n\n\n\n\nThis is a follow-up to our recent telephone conversation about community foundations generally and the possibility of a “home” for the Cadogan Foundation within the Community Foundation of Prince Edward Island.\n\n\n\n\nFirst of all, I apologize for the long delay in responding to your questions.  The idea of direct delivery was not on our radar screen as such.  On only one or two occasions that I recall, di",
  "theme": "08-correspondence"
 },
 {
  "slug": "letter-ask",
  "title": "Letter-ask",
  "summary": "Fundraising letter from Don Glendenning soliciting donations for the Citizen's Math project through Community Foundation of PEI. Explains that Education 20/20's innovative approach starts with surveying math skills needed in daily life rather than traditional curriculum development. Notes the $15,000 project cost with half for facilitator fees, the rest for analysis and local support. References that most people capable of leading such analysis have retired or moved away, demonstrating Don's resourcefulness in bringing in Meg Savory from British Columbia. Shows his vision of practical math education and commitment to educational innovation in PEI.",
  "content_preview": "1-8-math \n\nDear\n\nMATH FOR EVERY-DAY LIVING\n\n\n\n\nCurriculum development normally starts with an analysis of the subject under study; Education 20/20 believes that, instead, it should start by making a survey of math skills needed in every-day life.    This model engages learners early in the application of math to solving life’s daily prob0erms. It asks the question “how much math do you need to be a good citizen?”.  Education 20/20 Inc. proposes to ask Islanders just that question.\n\n\n\n\nEducation ",
  "theme": "08-correspondence"
 },
 {
  "slug": "letter-quality-education",
  "title": "letter Quality Education",
  "summary": "Philosophical letter defining quality education through UNICEF criteria (healthy learners, safe environments, relevant content, learner-centered processes, outcomes including attitudes/skills/knowledge). Don situates education as support for the \"road of life\" journey and argues these criteria reflect community concerns better than standardized test results alone. Advocates supplementing PISA/PCAP with broader quality measures.",
  "content_preview": "March 21, 2016\n\n\n\n\nDear Editor:\t\n\n\n\n\nA Quality Education\n\n\n\n\nThe road of life is a way of describing our journey between birth and death, and education provides help as we travel.  Help comes in many forms and from many people and its focus is on increasing and improving the knowledge, skills and attitudes needed to meet challenges along the way.  As a result, our quality of life will depend, to a large degree, on the quality of education that we experience.  \n\n\n\n\nIn 2000, UNICEF identified the ",
  "theme": "08-correspondence"
 },
 {
  "slug": "letter-to-school",
  "title": "Letter to school",
  "summary": "Official congratulation letter dated May 19, 2016, from Don Glendenning (as President of Education 20/20) to Natalie MacNeill, Director of Fund Development at Grace Christian School, notifying the school of winning the 2016 Excellence in Education Award. Glendenning commends the school for integrating technology comprehensively across all aspects of school life, not merely providing tools but embedding them meaningfully into educational objectives. Notes the judges' impressment with how Grace Christian combines clear educational objectives, early engagement, and a remarkable range of activities for a small school. Letter expresses intent to visit for award presentation.",
  "content_preview": "May\n19, 2016\n\n\t\n\n\n\n\n\n\n\n\nNatalie MacNeill\n\n\nDirector of Fund\nDevelopment \n\n\n50 Kirkdale\nRd\n\nCharlottetown, PE  C1E 1N6\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear\nMs. McNeill:\n\n\n\n\n\n\n\nCongratulations; Grace\nChristian School has been selected for this year’s Excellence\nin Education Award.\n\n\n \n\nWe were greatly\nimpressed by the manner and extent to which Grace Christian School\nuses technology to enhance learning and teaching.  Your educational\nobjectives are clear, engagement starts early and you have an amazing\nrange of a",
  "theme": "08-correspondence"
 },
 {
  "slug": "letter",
  "title": "Letter",
  "summary": "This is a fundraising letter dated July 10, 2019, written by Don Glendenning introducing the concept of numeracy to potential donors. Don explains that while PEI math test scores have risen, practical numeracy skills remain weak on the shop floor. He proposes a DACUM analysis to identify the 100+ math skills needed for everyday island life at a cost of $15,000, noting his prior success using this methodology at Holland College. The letter invites donations through the Community Foundation of PEI. This document showcases Don's continued professional engagement, his understanding of applied mathematics education, and his fundraising acumen in retirement.",
  "content_preview": "July\n10, 2019\n\n\n\n\n\n\n\n\n\n\n\nDear:\n\nMath\non PEI\n\n\n\n\n\n\nAlthough\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen wondering why.\n\n\n\n\n\n\nAll\nIslanders need math. they need to be able to measure, sort,\ncalculate, group and estimate numbers, space, time, distance, etc. \nand they need to do it quickly, easily, accurately; and consistently.\n This approach to math is called numeracy and it involves the\napplication of math ",
  "theme": "08-correspondence"
 },
 {
  "slug": "letterhead-word-top-bot-blank",
  "title": "Letterhead -Word-top&bot - blank",
  "summary": "Formal letter from Don Glendenning to Ray Murphy (Murphy Pharmacies) requesting financial support for a math education initiative on PEI. Demonstrates Don's research into numeracy issues and his strategy of engaging business leaders in educational improvement. References his DACUM-style brainstorming methodology (two-day sessions) and his establishment of a Community Foundation fund for contributions, showing his fundraising approach and commitment to practical education solutions.",
  "content_preview": "February\n20,  2019\n\nRay\nMurphy, President\n\nMurphy\nPharmacies\n\nCharlottetown\n\n\n\nPII,\nC1A xxx1-1-2\n\n\n\n\n\n\nDear\n\nMath\non PEI\n\n\n\n\n\n\nFor\nsome time now, I’ve been exploring math education in PEI.  Although\nPEI math scores on National and international tests have risen,\nfriends tell me that math has not improved on the shop floor; I’ve\nbeen wondering why.\n\n\n\n\n\n\nI’ve\nbeen looking around and may have found the answer.  Islanders need\nmath, most of us, citizens, for example, don’t need a  high level. \nBut ",
  "theme": "08-correspondence"
 },
 {
  "slug": "letterhead-word-top-bot",
  "title": "Letterhead -Word-top&bot",
  "summary": "Formal solicitation letter from Don Glendenning to Karen Jackson of PEI Union of Public Sector Employees requesting a $1,500 lead grant to support innovative educational initiatives in Souris. Demonstrates Don's collaborative fundraising approach, emphasis on innovation in education, and partnership with community organizations. Notes Education 20/20's incorporation (2012), charitable status (2015), and activities including awards, newsletters, workshops, and consultations.",
  "content_preview": "January\n31, 2018\n\nKaren\nJackson, President\n\nPEI\n Union of Public Sector Employees:\n\n4\nEnman Crescent\n\nCharlottetown.\nPEI   C1E 1E6\n\n\n1-1-2\n\nDear\nMs. Jackson:\n\nSupporting\nInnovation in Souris\n\n\n\n\n\n\nFirst\nlet me commend you for your “UPSE Has a Heart” initiative, I\nnever really doubted it but it is great to see it reaffirmed.\n\n\n\n\n\n\nEducation\n20/20 Inc.  is an independent, broad based not-for-profit education\ngroup  that was incorporated in 2012 and received a charitable number\nin 2015 (822339-4). ",
  "theme": "08-correspondence"
 },
 {
  "slug": "pro-forma-numeracy",
  "title": "Pro forma-Numeracy",
  "summary": "A November 30, 2014 solicitation letter from Don Glendenning to Roger Birt seeking support for a numeracy education research project. Don identifies a gap in PEI's math education: although test scores have improved, workers lack practical numeracy skills. He frames numeracy (quick, accurate application of mathematical knowledge) as a solution and proposes funding a $15,000 analysis of math skills used by Islanders. The letter reveals Don's sophisticated understanding of educational assessment, his willingness to bring in external expertise when needed, and his ability to identify specific, measurable problems and propose data-driven solutions. This correspondence exemplifies his role as an educational innovator and leader.",
  "content_preview": "November 30, 2014\n\n\n\n\n\n\n\nMr. Roger\nBirt, President\n\n\nR. Birt and\nAssociates\n\n\n27 Brackley\nPoint Road\n\n\nCharlottetown,\nPE  C1A 6Y1\n\n\n\n\n\n\n\n\n\n\n\n\nDear Mr.\nBirt:\n\n\n\n\n\n\n\nFor some\ntime now, I’ve been exploring math education in PEI.  I encountered\na conundrum; although PEI math scores on National and international\ntests have risen, friends tell me that it is not reflected on the\nshop floor.\n\n\nI asked\nmyself why:\n\n\n•\tWhen\nwere you last asked about the math your workers need?\n\n\n•\tHow\nmuch math do Islande",
  "theme": "08-correspondence"
 },
 {
  "slug": "summary-of-responses-from-directors",
  "title": "Summary of responses from Directors",
  "summary": "Email thread from December 2018 following the unsuccessful 2019 award application cycle. Don Glendenning initiates discussion with stakeholders about future directions after receiving no applications despite past success. Contributors include Sharon Cameron (describing the SEAM/STAR poverty intervention program), Bill Whelan (suggesting focus on student interest/talent identification for career alignment), and Katherine McQuaid (expressing surprise at low interest). The correspondence reveals Don's collaborative leadership style, his willingness to engage with experts for input, and his commitment to understanding barriers to program participation. The discussion led to future directions emphasizing numeracy education.",
  "content_preview": "On Wed, Dec 26, 2018, 5:02 PM Don Glendenning <pei@education2020.ca wrote:\n\nI regret to report that we had no applications for this year’s education award; this letter comes to seek and share some ideas as to how to respond. \n\nTo recap, for the past five years we have offered an Education Award in the amount of $2,500.  The purpose of the award varied  from year to year.  The first two awards recognized engagement, the third recognized the application of technology throughout a school and last o",
  "theme": "08-correspondence"
 }
]