[
 {
  "slug": "chronicle-001",
  "title": "Family Chronicle No. 1: Why A Newsletter",
  "summary": "First Family Chronicle newsletter (May 5, 1997) explaining the genealogical scope: Glendenning and Watling families, with ancestors including Harley, Peters, Sealey, Beattie, Rae, MacDonald, McAskill, MacNaughton, Leach, and Jardine. Don describes his 40+ year research beginning with his Great-Grandfather John Glendinning's family Bible (emigrated Scotland 1830). Provides earliest Glendinning information: John Glendinning born April 2, 1807 at Callister Hall, Scotland, married Margaret Harley August 23, 1833. Discusses Harley and Knowles connections, Peters lineage through his grandmother Elizabeth Peters Glendenning. Notes the striking pattern of few males in the Glendenning line producing male offspring. Shows Don's meticulous record-keeping and deep family knowledge from the project's inception.",
  "content_preview": "The  Family  Chronicle\n\nno.1\t\t\t\t\t\t\t\t\t\t           1997 05 05   \n\nWhy A Newsletter\n\n\n\n\nThe Chronicle is an occasional Newsletter devoted to genealogy.  More specifically, it deals with the genealogy of my father, Elmer Alton Glendenning, and mother, Jane Elizabeth Jardine Watling.  It=s purpose is to both share and seek information.  It will be published from time to time as the spirit moves me.\n\n\n\n\nIn addition to Watling and Glendenning, my ancestors include people named Harley, Peters, Sealey, B",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-002",
  "title": "Family Chronicle No. 2: Jardine Connection",
  "summary": "Second Family Chronicle (November 4, 1997) explores ancestral origins and family connections. Don notes a discrepancy regarding his Great-Grandmother—he believes it was Elspeth Jardine (not Elizabeth). Includes a 1991 Scot's Magazine letter from Denis Glendining about ancestors and historical records. Provides earliest documented family dates and discusses how many generations removed Don is from various ancestral lines (6th generation Glendenning, 5th generation Watling/MacDonald/MacAskill/MacNaughton/Leach/Rae, etc.). Fascinating section on \"Wanderers\" describing how many Glendennings and Watlings emigrated to Portland, Maine and other US locations in the early 1900s, including Don's parents' journey. Vividly describes Jane Watling (Don's mother) arriving in Portland January 24, 1908—the day Portland City Hall burned.",
  "content_preview": "The Family Chronicle\n\nno.2\t\t\t\t\t\t\t\t\t\t       1997 11 04\n\n                                                                   ______________________________             \n\nJardine Connection\n\n\n\n\nThere is a discrepancy between my information and that found in the recent Jardine history.  I believe that my Great Grandmother was Elspeth Jardine who married John MacDonald; the Jardine family history shows Elizabeth Jardine married to John MacDonald.  I would appreciate help in sorting this out.\n\n\n\n\nScots",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-003",
  "title": "Family Chronicle No. 3: “Mac” MacDonald",
  "summary": "Third Family Chronicle (December 1, 1997) clarifies \"Mac\" MacDonald's full name as Hugh McGraw MacDonald (died 1914, Newcastle Bridge). Reports on a November 15 Watling descendants gathering at Black River with ~20 attendees sharing local history. Provides detailed land history of Alexander MacDonald property, noting his original grant and its subsequent division between children John and Jessie. Documents extensive Peters family information from Joy Glendenning Winton, including siblings of Don's grandmother Elizabeth Peters Glendenning. Updates on Jardine family genealogy and mentions Don's son Brian's correspondence with another Brian Glendenning in Australia. Includes information on other Glendinning families descended from Scottish emigration.",
  "content_preview": "The Family Chronicle\n\nNo. 3\t\t\t\t\t\t\t\t\t\t        1997 12 01\n\n                                                                                                                              “Mac” MacDonald\n\n\n\n\nThanks to David Taylor, the mystery of “Mac” MacDonald has now been cleared up.  His full name was Hugh McGraw MacDonald.  He died in 1914 while working on the Newcastle (Morrisey) Bridge.  Thanks, David.\n\n\n\n\nWatling Descendant’s Gathering\n\n\n\n\nOn Saturday evening, November 15, about 20 people (I ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-004",
  "title": "Family Chronicle No. 4: Callister Hall",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n4\t\t\t\t\t\t\t\t\t\t        1998 06 07\n\n___________________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nCallister\n\tHall\n\t\n\n\n\n\t\n\t\nMy\n\tGreat-grandfather, John Glendinning was born at Callister Hall,\n\tDumfriesshire, Scotland on April 2, 1807.  Callister Hall still\n\tstands, although it was believed to have suffered severe fire damage\n\tin earlier years.  At one time it was said to have served as a\n\tstage-coach stop and Inn.  The photo of me in front of Callister",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-005",
  "title": "Family Chronicle No. 5: Recently, I reviewed Mum=s Autograph Album. Many of the pages are loose and some may be missing, how",
  "summary": "Fifth Family Chronicle (October 31, 1998) analyzes Don's mother's autograph album, dating entries from 1910-1915. First entry: mother Jane Watling Glendenning, Portland Maine, December 1, 1910. Earliest entry by Don's father E. A. Glendenning from Wausau, Wisconsin, September 18, 1910 (before their marriage). Describes their wedding in New Brunswick October 18, 1910, followed by December 1910 Christmas entries in Bonny Eagle, Maine, and February 11, 1911 in Parksville, Tennessee (dam construction). Documents entries from family and friends from various locations including Tennessee, Nova Scotia, and Maine. Notes interesting entries by Uncle Guy Glendenning (1915, between enlistment dates) and mentions mysterious references to Pine Point and other southern locations. Shows Don's mother maintained a rich social circle during early married years.",
  "content_preview": "The Family Chronicle\n\nNo.5\t\t\t\t\t\t\t\t\t          1998 10 31\n\n\n\n\n\n\nRecently, I reviewed Mum=s Autograph Album. Many of the pages are loose and some may be missing, however, here are some observations based on the  entries we have:\n\nThe entry on the first page reads as follows:\n\n\n\n\nDear Friends:\n\nMy album=s open.  Come and see.\n\nWhat! Won=t you waste a line on me?\n\nWrite but a line, a work or two\n\nThat memory may revert to you.\n\nJ. Watling Glendenning\n\nPortland, Maine\n\nDecember 1st, 1910\n\nBonny eagle,",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-006",
  "title": "Family Chronicle No. 6: CHRISTMAS ISSUE – 1998",
  "summary": "Sixth Family Chronicle (November 20, 1998) is a Christmas issue recounting Don's childhood Christmas memories at Black River. Vivid anecdotes: mother saying \"Santa's birdie\" was checking if children were being good; magic pantry drawer that produced extra goodies for visiting relatives; stockings with oranges, candy, nuts, pennies; sad memories of Uncle Chip dying suddenly Christmas Eve 1948 (heart attack while shopping), and two fatal car accidents (Earl Taylor 1969, Gerald and Elaine Taylor 1994). Positive gift memories include a wind-up caterpillar tractor and a train set. Notable entries: 1958 family trip to Florida with siblings in a new Buick; Christmas 1958 at home with homegrown meal; 1957 Christmas in Stamford, Connecticut when Don gave Carol (his wife) a diamond engagement ring. Reveals Don's warm family relationships and sentimental nature.",
  "content_preview": "The Family Chronicle\n\nno.6\t\t\t\t\t\t\t\t\t\t           1998 11 20\n\n_____________________________________________________________________\n\n                                                                                                                                  \n\n\tCHRISTMAS ISSUE – 1998\n\n\n\n\nI=ve decided to make this my Christmas letter and, in it, to record, as best I can remember, some Christmas events and activities.  Memory plays tricks and so, the events and the dates my not be exactly as desc",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-007",
  "title": "Family Chronicle No. 7: Issue Number",
  "summary": "Seventh Family Chronicle (August 8, 1999) provides a comprehensive timeline of Don's parents' lives and work. Father (Elmer Alton Glendenning) born June 29, 1875; mother (Jane Elizabeth Watling) born February 28, 1890. Key dates: mother arrived Portland January 24, 1908 (Portland City Hall fire day); married October 18, 1910; worked Tennessee dam construction (Ocoee River dams 1911-1913); operated Little Branch Post Office November 1, 1914 to August 1, 1916; purchased multiple properties including Jessie MacDonald property July 21, 1914. Documents children's births: Grace (September 23, 1911), Walter (September 29, 1913), Venetia (May 14, 1915), Lillian (January 8, 1917). Notes Margaret Virginia died January 13, 1918 in Hampton, Virginia; John born December 14, 1919. Father died May 18, 1938 at home, buried May 21; mother died March 24, 1964 in Miramichi Hospital, buried March 28. Lists properties acquired and construction projects but notes many details lost to time.",
  "content_preview": "The Family Chronicle\n\nNo.7\t\t\t\t\t\t\t\t\t           1999 08 08\n\n\n\n\n\n\nIssue Number\n\n\n\n\nThe last issue, No. 8 was mis-numbered; The next one, whenever that is, will be No. 9.\n\n\n\n\nMum and Dad\n\n\n\n\nAs reported in the last Newsletter, Mum and Dad operated the Post Office at Little Branch from 1914 to 1916.  Because of this new information, I decided to review some of their early dates. \n\n\n\n\nJune 29 1875\tDad was born presumably in Canobie, NB\n\nFeb. 28 1890\tMum was born presumably in Upper Black River above M",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-008",
  "title": "Family Chronicle No. 8: Little Branch Post Office",
  "summary": "Eighth Family Chronicle (May 30, 1999) documents Little Branch Post Office history through archival records showing postmasters from 1871-1928, confirming Don's parents Elmer and Jane Glendenning served November 1, 1914 to August 1, 1916. Notes that Aunt Tine MacKenzie likely ran the post office in the Jessie MacDonald house 1902-1907 (between her husbands Tom Adams and John MacKenzie). Information about a separate Watling Post Office (1911-1928). Clarifies the Daly/Daley name change (Carson Daley changed spelling after WWII). Provides detailed genealogy of Aunt Tine's families: children from Tom Adams marriage (James, Jubal Willard, Gertrude) and from John MacKenzie marriage (Norman, Jean, Edith). Corrects earlier error: Alex MacDonald's first wife was Ethel MacTavish (not Catherine McGraw), second wife Beatrice Shuttleworth. Discusses cemetery records and the Alexander MacDonald property division.",
  "content_preview": "The Family Chronicle\n\nNo.8\t\t\t\t\t\t\t\t\t\t           1999 05 30\n\n\n\n\nLittle Branch Post Office\n\n\n\n\nThe Archives has a database, searchable through the Internet, on post offices and postmasters. In checking the Little Branch Post Office, I found the following:\n\nPostmaster\t\tDates\t\t\t\tCause of vacancy\n\nAlexander Cameron\t1871-11-01   to 1876-03-30\tResignation\n\nJohn MacNaughton\t1876-08-01 to 1883-08-20\tResignation, closed\n\nAlexander Cameron\t1884-11-01  to 1887-03-22\tResignation\n\n           (Re-opened)\n\nGeorg",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-009",
  "title": "Family Chronicle No. 9: Correction",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.9\t\t\t\t\t\t\t\t\t\t           1999\n\n                                                                                                                                  \n\n\n\n\nCorrection\n\n\n\n\nWalter Glendenning was born Sept 29, 1913 not Sept. 23 as given in the last Family Chronicle.  My records were correct but I copied it incorrectly.  Sorry.\n\n\n\n\nAn Added Focus\n\n\n\n\nWhile I will continue to search for family connections and dates, I plan to devote more attention to family members, f",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-010",
  "title": "Family Chronicle No. 10: Another Cousin",
  "summary": "Tenth Family Chronicle (December 1, 1999) uses Crown land grant records to document early settler families. Alexander McDonald Sr. granted Lot #2 (225 acres) June 3, 1812—property now owned by Norman Glendenning. Lists other original grantees (Sinclair, Fowlie families) with acreages and dates. References \"Pioneers of the Bay Chaleur\" showing John Glendinning purchased Lot #7 in Salmon Beach (granted to Fidele and Joseph Arceneau 1812), sold 1855 to Abram Buttimer, and received Canobie land grant 1868. Documents land grants to Glendenning males: John Glendinning Jr. (Canobie, Lot #31, August 17, 1868), Walter Glendenning (Canobie, Lot #30, February 17, 1873), Atton E. Glendenning (Canobie, Lot #28, July 6, 1901). Notes unusual practice: settlers often occupied land years before receiving title. Mentions FWH's \"Boyhood Memories of New Brunswick\" (c. 1940) manuscript at Mount Allison University describing Canobie life. Queries about Miller's Bridge origin and other local place names.",
  "content_preview": "The Family Chronicle\n\nNo.10\t\t\t\t\t\t\t\t\t\t           1999 12 01\n\n_____________________________________________________________________ \n\n\n\n\n\n\n                                                                                                                               \n\nAnother Cousin\t\t\n\n\n\n\nCameron MacDonald pointed out that the headstone in the Black River Cemetery belonging to William and Margaret Godfrey includes the following AJohn William, infant son of Kenneth and Katherine MacDonald@.  That wo",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-011",
  "title": "Family Chronicle No. 11: Friends",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.11\t\t\t\t\t\t\t\t\t\t           1999 11 01\n\n                                                                                                                                  \n\n\n\n\nFriends\n\n\n\n\nWhile looking through old family photos, I identified the following as family friends of Mother=s\n\n:\n\nMrs. Jennison, I believe was the person Mum worked for when she went to Portland in 1908.  Presumably Mother looked after the children - there appear to have been 2.  Marshall Walker who was ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-012",
  "title": "Family Chronicle No. 12: WW1",
  "summary": "Family Chronicle newsletter (No. 12) dated March 5, 2000, authored by Don. Covers WW1 military service of extended family (Uncle Guy Wellington Glendenning, Aunt Margaret Violet Glendenning, 10+ other Glendennings), Home Children immigration records, possible unknown uncle Walter Glendenning, and nostalgic recollections of pre-refrigeration food storage methods (basement ice, brook cooling). Reveals Don's genealogical research interests and family storytelling tradition. Warmly reflects on childhood hardships and innovation.",
  "content_preview": "The Family Chronicle\n\nno.12\t\t\t\t\t\t\t\t\t\t           2000 03 05\n\n                                                                                                                                  \n\nWW1\n\n\n\n\nThere were over 600,000 Canadians overseas during WW1.  Most served in the Canadian Expeditionary Force; many served in the British army.  The Canadian Archives has developed a database of most but not all of the names.  For anyone wishing to search, the web site is Awww.archives.ca@  A search revea",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-013",
  "title": "Family Chronicle No. 13: Re-union",
  "summary": "Thirteenth Family Chronicle (August 20, 2000) reports on family reunion July 28-30 (most readers attended). Friday: registration and conversation; Saturday: homestead breakfast, plaque unveiling, time capsule burial, oak tree planting, \"highland games,\" barbeque, evening entertainment under tent; Sunday: church service with family choir, open house, barbeque. Notes positive feedback about younger folks reminiscing. Announces Reunion No. 23 for Saturday, July 28, 2001. Queries about spring still flowing on side of road below concrete post (historically used for watering horses and cows). Notes possible \"black sheep\"—John Watling convicted of crime and transported to America aboard Thames in April 1753 (not an ancestor). Discusses possible branch of Glendennings: Bill Glendenning from New Mills, NB, grandfather Walter Glendenning, Glendennings in Galloway near Rexton. Notes Uncle Guy visited Florida friend in Dorchester, NB (presumed WWI buddy); friend had son named Glendenning (Glenn Steeves) after Uncle Guy, lived/lives in Moncton. Personal anecdotes about Uncle Brydone delivering groceries by truck, skinny dipping incident, old swimming hole, stubbed toe on fence post, Queen Mother's 1939 visit to Newcastle and the King and Queen's motor tour to Fredericton.",
  "content_preview": "The Family Chronicle\n\nNo.13\t\t\t\t\t\t\t\t\t           August 20, 2000\n\n                                                                                                                                  \n\nRe-union\n\n\n\n\nWe had a great gathering on July 28 - 30; most readers were there so I will keep this item short.\n\n\n\n\nFriday evening was registration and conver- sazione; Saturday morning saw people gather at the old homestead for breakfast, unveiling of a plaque, burial of a time capsule and planting of a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-014",
  "title": "Family Chronicle No. 14: Home-made Saw",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.14\t\t\t\t\t\t\t\t\tSeptember 17, 2000\n\n                                                                                                                                  ____________\n\nHome-made Saw\n\n\n\n\nWinter was the time to cut wood, not only for our own use but to sell; we usually sold 24' furnacewood.  The yard above the house would have a huge pile left in long lengths.  In the spring, the wood cutter would be set up to cut the wood into stove (16 in.) or furnace (24 in.) len",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-015",
  "title": "Family Chronicle No. 15: Alexander MacDonald",
  "summary": "Fifteenth Family Chronicle (December 7, 2000) documents deaths and life histories from newspaper records and church documents. Alexander MacDonald (1843 death notice, age 68): native of Assynt Parish, Rosshire, Scotland, emigrated 1803, died October 31 of dropsy after 8-month illness, leaving wife Grace MacAskill, two sons, six daughters. Grace (MacAskill) MacDonald (1874 death): widow, age 93, native of Co. Sutherland, Scotland, emigrated 1803, died February 23. Elspeth (Jardine) MacDonald (Don's Great-Grandmother): died September 12, 1907 of \"debility,\" buried St. Stephen's Cemetery (husband John MacDonald presumed buried there but unconfirmed). Jubal and Grace (MacDonald) Watling: Jubal died February 19, 1915 (Gazette); Grace died September 28, 1934 (Chatham Gazette). Grace's funeral account: conducted by three ministers, pallbearers included Norman MacKenzie, Walter Glendenning, Gordon MacNaughton, Alex Newton, Jubal Dickson, James Jardine. Interment St. Stephen's Cemetery. Jessie MacDonald documented as Third Class Teacher, District 11, Parish of Chatham (April-June 1860); school register shows 38 pupils; contract with trustees from October 15, 1858 Napan. Donald Ernest Watling: St. Stephen's records show Donald Cameron Watling born February 23, 1892—Uncle Ern's birthday.",
  "content_preview": "The Family Chronicle\n\nNo.15\t\t\t\t\t\t\t\t\t\t  December 7, 2000\n\n                                                                                                                              _____\n\n\n\nAlexander MacDonald\n\n\n\n\nThe GLEANER and Northumberland, Kent, Gloucester and Restigouche Commercial and Agricultural Journal (p30) reports the following death in 1843:\n\n\n\n\nAOn the 31st of October, of dropsy, after an illness of eight months, which he here with truly Christian resignation to the divine will,",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-016",
  "title": "Family Chronicle No. 16: Happy New Year",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.16\t\t\t\t\t\t\t\t\t\t    January 30, 2001\n\n                                                                                                                                  ____\n\n\n\nHappy New Year\n\n\n\n\nI=ve been doing some work on Carol=s side of the family so will share a few notes.\n\n\n\n\nAncestral Names\n\n\n\n\nDirect ancestral names on Carol=s side include Chesney, McChesney, Scott Merritt, Murphy, Frank, Vogt, Walder, Unrah,  \n\n\n\n\nWilliam McChesney, Carol=s GGGG Grandfather, was born",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-017",
  "title": "Family Chronicle No. 17: Early Names",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.17\t\t\t\t\t\t\t\t\t\t\n February 16, 2001\n\n________\n\n\n\tEarly Names\n\t\n\n\n\n\t\n\t\nThe\n\tfollowing information about early names of the area was taken from\n\tAGeographical\n\tNames of New Brunswick, 1875.@\n\t\n\n\n\n\t\n\t\nMiramichi\n\twas Aprobably\n\tnamed by Cartier in 1535 from Montagnais Maissimeu\n\tAssi A\n\tmeaning Micmac Land.   Northumberland\n\tStraight appears to\n\thave been named by Admiral Colville\n\taround 1877 after his\n\tflagship, Northumberland.  Before that, it was known as\n\tRed Sea. \n\tNorthum",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-018",
  "title": "Family Chronicle No. 18: Early Names",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.18\t\t\t\t\t\t\t\t\t\t\n February 18, 2001\n\n \n                                                                     \n                                                          __________\n\n\n\tEarly Names\n\t\n\n\n\n\t\n\t\nThis\n\tis a follow-up to Issue No. 17\n\twith additional\n\tinformation about early names of the area was taken from\n\tAGeographical\n\tNames of New Brunswick, 1875.@\n\t Chatham\n\twas once known as Spruce Tree after a large Spruce tree growing on\n\tWater Street.  The name changed to Chat",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-019",
  "title": "Family Chronicle No. 19: Early Names",
  "summary": "Third installment on place names (Bathurst, Canobie, Salmon Beach, New Bandon). Documents original land grants in Canobie from 1868-1946, listing multiple Glendenning and related family land holdings. Notes discrepancies in family records (spelling variations). Includes observations about John Glendinning Sr.'s property purchases and family movements. Don's systematic genealogical research methodology is clearly demonstrated.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.19\t\t\t\t\t\t\t\t\t\t\n February 19, 2001\n\n \n                                                                     \n                                                          __________\n\n\n\tEarly Names\n\t\n\n\n\n\t\n\t\nThis\n\tis a follow-up to Issues No. 17\n\tand 18 with\n\tadditional information about early names of the area taken from\n\tAGeographical\n\tNames of New Brunswick, 1875.@\n\t \n\t\n\t\n\n\n\n\t\n\t\nBathurst,\n\toriginally named St. Peters in 1671, was named for the Third Earl of\n\tBathurst in 1826.  ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-020",
  "title": "Family Chronicle No. 20: I am thankful to Jeannie Glendenning for the following two items.",
  "summary": "Contains newspaper obituaries for Mrs. Jubal Watling (Grace MacDonald, 1848-1934) and Jubal Watling (1823-1915). Personal reminiscences about childhood woodcutting, maple syrup collection, and working with his brother Ken. Announces the establishment of the Glendenning Family Fund in honor of Elmer and Jane (Watling) Glendenning. Includes internet search results on name frequency and references St. Stephen's Church history and the Harper family.",
  "content_preview": "The Family Chronicle\n\nNo.20\t\t\t\t\t\t\t\t\t\t      May 18, 2001\n\n                                                                                                                                  __________\n\n\n\nI am thankful to Jeannie Glendenning for the following two items.\n\n\n\n\nMrs. Jubal Watling\n\n\n\n\nThe Tri- Weekly (Chatham, NB) included the following item for September 28, 1934.\n\n\n\n\nAMany friends in Little Branch and vicinity heard with regret of the death of Mrs. Jubal Watling, which occurred at her ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-021",
  "title": "Family Chronicle No. 21: Petitions for Crown Land",
  "summary": "Don documents Crown Land petitions from New Brunswick Provincial Archives, detailing property claims by Jubal Watling, John Glendinning Sr., Walter Glendenning, and John Glendenning Jr., with dates and lot numbers. Includes a tangential note on the \"Pious Pirate\" Captain George Watling of the Bahamas. Documents his grandfather Walter Glendenning's extensive land holdings in Canobie and speculates on family property transfers and inheritance patterns. Research-focused with genealogical documentation.",
  "content_preview": "The Family Chronicle\n\nNo.21\t\t\t\t\t\t\t\t\t\t      June 18, 2001\n\n                                                                                                                                  __________\n\nPetitions for Crown Land \n\n\n\n\nA recent search of the internet reveals information available from the New Brunswick Provincial Archives about petitions for land from the Crown.  Preliminary information is available on line but actual photocopies are also available for $5 00 each.  I ordered a few cop",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-022",
  "title": "Family Chronicle No. 22: I am drafting this newsletter on Remembrance Day to record the names of family members who were in t",
  "summary": "Compiled on Remembrance Day, this issue documents family members' military service across WWI, WWII, and the Boer War. Includes Don's uncles, siblings, and first cousins with service details (units, dates, decorations). Notable entries: Don's uncle Guy Wellington Glendenning (55th Battalion, wounded three times, leg amputated), Uncle Donald Ernest Watling (26th Battalion, MM), brother Kenneth in RCAF (1942-1945, reenlisted to 1984). Don notes the North Shore Regiment's D-Day landing at Saint-Aubin-Sur-Mer. Important family contribution record.",
  "content_preview": "The Family Chronicle\n\nNo.22\t\t\t\t\t\t\t\t\t\tNovember 11, 2001\n\n                                                                                                                                  __________\n\n\n\nI am drafting this newsletter on Remembrance Day to record the names of family members who were in the service; not all served in a theatre of war.  While I have included all I am aware of, it is likely that some have been omitted and the information on some may even be incorrect.  I would welcome a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-023",
  "title": "Family Chronicle No. 23: The previous newsletter listed names of relatives who served in a branch of the military.  In this n",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.23\t\t\t\t\t\t\t\t\t\tNovember 24, 2001                                                                                                                        __________\n\nThe previous newsletter listed names of relatives who served in a branch of the military.  In this news letter, I decided to jot down some wartime recollections.  I recognize that what I say may not even be accurate but these jottings are my recollections.  These notes are in random order.\n\n\n\n\nI was age 10 when w",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-024",
  "title": "Family Chronicle No. 24: Annan",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.24\t\t\t\t\t\t\t\t\t\t\n   March 30, 2002\n\n \n                                                                     \n                                                              _\n\n\n\tAnnan\n\t\n\n\t\n\n\n\t\n\n\n\n\t\n\t\nIn\n\t1956 I visited James Glendenning in Annan, Scotland, the place from\n\twhich our Great Grandfather sailed.  In fact, I stayed a couple of\n\tnights with two of his maiden aunts.  James operated a men’s\n\tclothing store; he has since died and the store is operated by his\n\tson, Walter",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-025",
  "title": "Family Chronicle No. 25: Winner Announced",
  "summary": "Third-party donation form for Glendenning Family Fund held by Community Foundation of Prince Edward Island (Revenue Canada Business No. 89001 1190 RR 0001). Form requests donor name, address, postal code, phone, signature, and gift amount. Foundation address: Suite 105, Queen Square Centre, 119-121 Queen Street, Charlottetown, PE. Not personally written by Don; included in Family Chronicle for fundraising purposes. Administrative document demonstrating his involvement in institutional fundraising and community legacy building.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.25\t\t\t\t\t\t\t\t\t\t\n   July 9, 2002\n\n                                               \n                                                                     \n            __________\n\nWinner Announced\n\t\n\n\n\n\t\n\t\nThe\n\tMiramichi Historical Society conducted a writing contest on topics\n\trelated to Black River.  First prize went to Barry MacKenzie of\n\tNapan for “The ‘MacKenzie Settlement’ and Klondike Will’”.\n\t Another prize went to Justin Morris who wrote on St. Stephens\n\tChurch.  A full",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-026",
  "title": "Family Chronicle No. 26: My search for Watling roots has been less extensive than that on the Glendenning side, nevertheless,",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.26\t\t\t\t\t\t\t\t\t\t    July 9, 2002\n\n                                                                                                                                  __________\n\nMy search for Watling roots has been less extensive than that on the Glendenning side, nevertheless, I will record what I have and add as time and energy permit.  Some time ago, Edith (MacKenzie) Schickle gave me a copy of information given to her by Ernie Watling.  Much of the information which follow",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-027",
  "title": "Family Chronicle No. 27: Family Reunion – 2002",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.27\t\t\t\t\t\t\t\t\t\t\n   September 1, 2002\n\n                                               \n                                                                     \n            __________\n\n\n\t\n\n\n\t\n\t\nFamily\n\tReunion – 2002\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nVenetia,\n\tKen, Don & Norm at family reunion on July 27, 2002.  Photo taken\n\tat Ken and Verne’s cottage in Point Aux Carr\n\t\n\n\n\n\t\n\t\nYankee\n\tToast\n\t\n\n\n\n\t\n\t\nMy sister,\n\tLillian, recalled how much she enjoyed Mum’s Yankee Toast.  I\n\tvaguely recall it ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-028",
  "title": "Family Chronicle No. 28: News",
  "summary": "Photo of Walter Glendenning (1913-1998) and cousin George Elbridge Watling (b. 1913), possibly from Hampton, Virginia. Detailed MacNaughton family genealogy connecting back to Dunderave Castle, Scotland, and establishing connection to Don's maternal grandmother Christina (married Jubal Watling). Lists Jubal and Christina's eight children. Includes farm anecdotes: feeding pigs, cooking turnips in outdoor shed, childhood burn injury, bullchasing incident in 1930s. Combines genealogical documentation with vivid domestic memories.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.28\t\t\t\t\t\t\t\t\t\t\n   September 28, 2002\n\n                                               \n                                                                     \n            __________\n\n\tNews\n\t\n\n\n\n\t\n\t\nThe\n\treadership of the Chronicle\n\tis growing and I am delighted, as a result, to re-establish contact\n\twith three “first cousins once removed” - Donald Edge, Shirley\n\tMacKay and Tina (Watling) Newton.  Great to hear from you and\n\tthanks, Donald, for the family tree information.  I ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-029",
  "title": "Family Chronicle No. 29: MOTHERS",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.29\t\t\t\t\t\t\t\t\t\t    October 17, 2002\n\n                                                                                                                                  __________\n\n\n\n\n\n\nMOTHERS\n\n\n\n\nThe lamp is lit in the window\n\nAnd back of it is her chair\n\nAnd as I look across, it seems\n\nShe surely must be there.\n\n\n\n\nI picture too her little room\n\nSo very neat and snug\n\nHer very fingers made it so\n\nOh yes, the braided rug.\n\n\n\n\nThe cushion on her rocking chair,\n\nThe quilt upo",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-030",
  "title": "Family Chronicle No. 30: From left to Right: Roy Watling, George Watling, Norman Glendenning, Unknown. Walter Glendenning, Wi",
  "summary": "Includes photo of six family members and friends (Roy Watling, George Watling, Norman Glendenning, and others, undated ~1941). Attempts to reconstruct list of teachers at Little Branch School (Margerite Bell, Katie MacNaughton Neilson, Annie Ellis, and others). Anecdote about 1937-38 winter: Ken staying at Point Aux Carr, attempting rabbit trapping with Fowlie Gillis and his brother Norm. Includes humorous poem \"The Muddy Trail\" (attributed to anonymous \"old tax-payer\") about conditions on Black River's South Side road, likely written 1968-1974.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.30\t\t\t\t\t\t\t\t\t\t\n   November 17, 2002\n\n                                               \n                                                                     \n            __________\n\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\tFrom left to Right: Roy\n\tWatling, George Watling, Norman Glendenning, Unknown. Walter\n\tGlendenning, Winfield Watling, Kenneth Glendenning\n\n\n\t\n\tTeachers\n\t\n\n\n\n\t\n\t\nDuring a\n\trecent visit to the Miramichi, Venetia, Ken and I were trying to\n\trecall our teachers at the Little Bran",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-031",
  "title": "Family Chronicle No. 31: George Emerson at Little Branch?",
  "summary": "References childhood geography memory aid (\"George Emerson's Old Grandfather...\"). Attributes \"The Muddy Trail\" to Murdoch Sullivan (1968-1974), includes Sullivan's follow-up poem \"The Road We Long Waited For Come At Last\" (1974) celebrating road paving. Describes 1948 arrival of electric power to Black River, recalls house wiring by Harry Simmonds, electric water pump (Christmas 1950), and brother Norm's innovations. Notes 1812 description of Suffolk County, England. Anecdotes about Little Branch School teachers and Fraser MacKay. Personal memoir content.",
  "content_preview": "The Family Chronicle\n\nNo.31\t\t\t\t\t\t\t\t\t\t   December 5, 2002\n\n                                                                                                                                  __________\n\nGeorge Emerson at Little Branch?\n\n\n\n\n  Although I was quite good at spelling, geography was always tricky.  The sentence below was an aid to remembering:\n\n George Emerson’s Old Grandfather Rode A Pig Home Yesterday.\n\n\n\n\nThe Muddy Trail\n\n\n\n\nBoth Jack Wilson and my brother, Ken, tell me that the poem,",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-032",
  "title": "Family Chronicle No. 32: Merry Christmas",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.32\t\t\t\t\t\t\t\t\t\t   December 20, 2002\n\n                                                                                                                                  __________\n\n\n\n\n\n\nMerry Christmas\n\nTo\n\nAll Readers\n\n\n\n\n\n\n\n______________________________________________________________________________\n\n\n\n\nChristmas Present\n\n\n\n\nAs I write this I am preparing to travel to Ottawa to spend Christmas with our daughter, Janet.  After traveling the world, Janet settled in Ottawa a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-033",
  "title": "Family Chronicle No. 33: Venetia Katherine (Glendenning) Russell",
  "summary": "Memorial issue for sister Venetia Katherine (Glendenning) Russell (May 14, 1915–January 11, 2003). Details her life: born at Little Branch, parents' work at Langley Field Virginia, attended Little Branch School and Provincial Normal School (1933), taught at multiple schools including Point Aux Carr and Miramichi Rural High School (retired 1975). Married Cameron Russell (1906-1979) in 1932, had three children (Glenn, Leonard, Donna). Active in St. Paul's Presbyterian Church (organ, treasurer 40 years). Describes her character: avid reader, good listener, genealogical research partner. Includes photos and personal observations about her life and family visits.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.33\t\t\t\t\t\t\t\t\t\t\n  January 20, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\tVenetia Katherine (Glendenning) Russell\n\t\nMay 14,\n\t1915 – January 11, 2003\n\t\n\n\n\n\t\n\t\n\n\n\t\nPhoto\n\tof Venetia taken by Loisanne (Glendenning) Gregan at Ken and Verne’s\n\tcottage in Point Aux Carr, NB on July 27, 2002.\n\t\n\n\n\n\t\n\t\n Venetia was\n\tborn at Little Branch.  Mum and Dad had purchased the property",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-034",
  "title": "Family Chronicle No. 34: Follow-up",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.34\t\t\t\t\t\t\t\t\t\t   January 30, 2003\n\n                                                                                                                                 ________________\n\nFollow-up\n\n\n\n\nFollowing some items in Issue 31, Jack Wilson tells me that he purchased some items from a sale at the John W. MacNaughton property including a octagonal plant stand inscribed on the; under side “Fraser MacKay, June 22, 1944”.  I think that was the year Fraser graduated.\n\n\n\n\nPlant",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-035",
  "title": "Family Chronicle No. 35: ________________\fFollow-up",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.35\t\t\t\t\t\t\t\t\t\t   February 28, 2003\n\n                                                                                                                                 ________________Follow-up\n\n\n\n\nDonna (Russell) Goodfellow confirms that their flinch Game came from my sister, Grace.  I must now conclude that Flinch was a game unique to our family.  Parker Brothers still sells the game; I bought two games yesterday.\n\n\n\n\nDorothy (MacKay) Lind wondered about Ken’s Hill.  As one",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-036",
  "title": "Family Chronicle No. 36: From Left to Right:  John R. Godfrey (Uncle Jack), John Glendenning, Kenneth Glendenning, Earl Taylo",
  "summary": "1941 photograph of Don's home with John R. Godfrey, John Glendenning, Kenneth Glendenning, Earl Taylor, Cameron Russell, Don Glendenning, Sterling Williston, and Joan Williston. Don explains editorial focus of The Family Chronicle: 50 years gathering genealogy, family-oriented early issues, recent emphasis on Black River reminiscence. Notes readership reached 34 (email distribution). Requests photos and Black River information. Describes obtaining first driver's license (1949, convinced by Norm; Glenn MacTavish witness, $2.00 cost). Details Sinclair Williston's blacksmith shop (horseshoeing, metalwork), his friendly nature, house fire. Earnings anecdotes: flower/seed peddling (Steele Briggs), selling Valentine's/Easter/Christmas cards. Working-class rural life memories.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.36\t\t\t\t\t\t\t\t\t\t\n             March 3, 2003\n\n                                               \n                                                                     \n           ________________\n\n\n\n\t\nFrom Left\n\tto Right:  John R. Godfrey (Uncle Jack), John Glendenning, Kenneth\n\tGlendenning, Earl Taylor holding Gerald, Cameron Russell, Don\n\tGlendenning, Sterling Williston and Joan Williston.  Photo taken at\n\tGlendenning home at Little Branch.  (Undated but probably taken in\n\t1941",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-037",
  "title": "Family Chronicle No. 37: The above photo was taken in Berlin, New Hampshire.  Although not dated, in the context of family in",
  "summary": "Don reflects on family wanderlust, documenting how both Glendenning and Watling relatives emigrated to the USA in the early 1900s seeking work (Maine, Boston, Florida, Tennessee, Virginia). He recounts his mother Jane Watling's arrival in Portland on January 24, 1908—the day city hall burned—and her meeting with his father. Includes vivid memories of winter woodcutting experiences with his brothers, describing horses, bobsleds, cross-cut saws, and the sensory details of forest work (snow, hymn-singing, horse bells, creaking loads). Published November 18, 2005.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.37\t\t\t\t\t\t\t\t\t\t\n  February 18, 2026\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\tThe above photo was taken in\n\tBerlin, New Hampshire.  Although not dated, in the context of family\n\tinformation, it was probably taken between 1900 and 1910.  Many\n\tMaritimers, including Black River residents, worked in the woods\n\tduring this period, Whether or not any are",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-038",
  "title": "Family Chronicle No. 38: Grace Elizabeth (Glendenning) Smith",
  "summary": "Detailed biography of Grace Elizabeth (Glendenning) Smith (Sept 23, 1911 – Aug 9, 1991), Don's oldest sister. Born in Parksville, Tennessee during Elmer Glendenning's dam construction work. Traveled extensively with family through Connecticut, Virginia, and Alabama before returning to Little Branch in 1919. Worked in Boston as a housekeeper; married Roy Morrison Smith in 1936; had two children (Barbara and Lawrence). Known for extraordinary eyesight and contest-winning abilities. Devoted to family despite multiple sclerosis in later years. Buried in Black River Cemetery. Published April 16, 2003.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n38\t\t\t\t\t\t\t\t\t\t            April 16, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\t\n\n\n\t\n\t\nGrace\n\tElizabeth (Glendenning) Smith\n\t\n(September\n\t23, 1911 – August 9, 1991)\n\t\n\n\n\n\t\n\t\nGrace\n\twas the oldest in the family and was born in Parksville, Tennessee. \n\tDad and Mum had set up housekeeping there in February 1911 where Dad\n\tworked on Ocoee #1, the first of three dams build",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-039",
  "title": "Family Chronicle No. 39: Here is another photo of men heading for, of in the woods, in the USA.  I do not have a date or loca",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.39\t\t\t\t\t\t\t\t\t\t\n        April 26, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nHere\n\tis another photo of men heading for, of in the woods, in the USA.  I\n\tdo not have a date or location but assume it is my father and his\n\tcrew.\n\n\n\n\tFollow-up\n\t\n\n\n\n\t\n\t\nThe woods\n\tstory brought back remem- brances to Donald Edge and Shirley MacKay.\n\t Donald remembered worki",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-040",
  "title": "Family Chronicle No. 40: ________________\fFollow-up",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.40\t\t\t\t\t\t\t\t\t\t\n             May 10, 2003\n\n                                               \n                                                                     \n           ________________\n\n\n\tFollow-up\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nUndated\n\tphoto of a woodcutter and typical woodpile at my home.  Sometimes we\n\thad a larger pile and more large logs.  \n\t\n\t\n\n\n\n\t\n\t\nSome\n\tsources of information:\n\t\n\n\n\n\t\n\t\n\t\t\n\nCrown\n\t\tLand Grant Index published by the Minister of Natural Resources and\n\t\tEner",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-041",
  "title": "Family Chronicle No. 41: Walter Jubal Glendenning (September 29, 1913- June 16, 1998)",
  "summary": "Biography of Walter Jubal Glendenning (Sept 29, 1913 – June 16, 1998), Don's oldest brother. Worked extensively on the farm and with horses; married Elspeth Agnes Gibson (Nov 1, 1939); had four children. Served in Army Service Corps during WWII; later worked for Modern Construction Co. and retired in 1978. Known for keen memory and willingness to help extended family. Made frequent trips to Boston and visited the old family home at \"The Branch\" whenever possible. Don emphasizes Walter's gentle nature, hospitality, and love of family gatherings. Published May 10, 2003.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.41\t\t\t\t\t\t\t\t\t\t\n  May 10, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\t\n\n\n\t\n\t\nWalter\n\tJubal Glendenning (September 29, 1913- June 16, 1998)\n\t\n\n\n\n\t\n\t\nWalter\n\twas the second child, the first son, of Elmer and Jane (Watling)\n\tGlendenning.  Mother came back to New Brunswick for his birth and\n\tmay have stayed in NB until late 1916 – we do not know for sure.  \n\t               ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-042",
  "title": "Family Chronicle No. 42: ________________\fMeadows to Little Branch",
  "summary": "Traces Watling family from Jubal Watling's marriage to Susan Leach in England (1814) through settlement in Canada. Documents land grants and property transfers at Little Branch (Meadows and Little Branch Road areas). Includes extended interview transcript with Uncle Jim Watling (age 94) recalling 1890s Christmas celebrations, simple gifts, homemade fun, and family values. Also includes poem \"Black River\" by F. J. MacDonald celebrating the river and ancestral connections. Extensive genealogical narrative establishing connection to land holdings. Published June 7, 2003.",
  "content_preview": "The Family Chronicle\n\nNo.42\t\t\t\t\t\t\t\t\t\t              June 7, 2003\n\n                                                                                                                                 ________________Meadows to Little Branch\n\n\n\n\nJubal Watling married a Susan Leach in Metfield, Suffolk County, England on November 14, 1814 and moved to Syleham, Suffolk County, England where their son, Jubal, was baptized on August 17, 1823.  They likely stayed in England, however, the following children ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-043",
  "title": "Family Chronicle No. 43: A sewing class at the Little Branch School, undated and believed to be:",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.43\t\t\t\t\t\t\t\t\t\t\n             June 25, 2003\n\n                                               \n                                                                     \n           ________________\n\n\n\n\t\n\t\n\n\t\n\n\t\nA\n\tsewing class at the Little Branch School, undated and believed to\n\tbe:\n\t\nBack\n\tRow: \tKate Jardine, Kate (Mills) Watling, Ruth (Ullock) Watling,\n\tJane (Allen) Cameron, Alice (MacLean) Watling\n\t\n\n\tFront Row:\tIrene\n\t(MacNaughton) Godfrey, Minnie (Williston) Fowlie, Miss Barn",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-044",
  "title": "Family Chronicle No. 44: Lillian Elspeth (Glendenning) Weeks  (January 8, 1917 – October 23,2001)",
  "summary": "Biography of Lillian Elspeth (Glendenning) Weeks (Jan 8, 1917 – Oct 23, 2001), Don's younger sister. Born in Fairhaven, Connecticut; attended Little Branch School but disliked formal education. Moved to Boston at age 16 (Sept 22, 1933) to work as housekeeper. Met Kenneth Brydone Weeks while visiting family in Loggieville (April 18, 1933); married Dec 22, 1939. Brydone served in North Shore Regiment; later became Presbyterian minister. Lillian maintained detailed family records (1974-75 typed 144 pages of memories). Known for being a \"people person,\" conversationalist, and note-maker. Moved to nursing home after Brydone's death. Published July 1, 2003.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n44\t\t\t\t\t\t\t\t\t\t             July 1, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\t\n\n\n\t\n\t\nLillian\n\tElspeth (Glendenning) Weeks  (January 8, 1917 – October 23,2001)\n\t\n\n\n\t\nLillian\n\ttaken in Hampton, Virginia\n\t\n\n\n\n\t\n\t\nLillian\n\twas born at 3 Perkins St., Fairhaven, Conn., USA, where Dad was\n\tworking at the time.  She would have traveled with the family to\n\tHampton, Virginia a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-045",
  "title": "Family Chronicle No. 45: ________________\fBlack River Cemetery",
  "summary": "Includes reflective poem about Black River Cemetery (written by Mrs. F. A. Fowlie on May 21, 1938, after Elmer Glendenning's burial). Don's grandfather John Glendinning was born at Callister Hall, Scotland (April 2, 1807); came to Canada in 1830. Notes his cousin Joy Ayer's recent visit to Callister Hall. Reproduces historical obituaries from Chatham Gazette for Jubal Watling (1915), Mrs. Jubal Watling (1934), and 19th-century deaths of Alexander MacDonald (1843) and Grace MacDonald (1874). Published July 18, 2003.",
  "content_preview": "The Family Chronicle\n\nNo.45\t\t\t\t\t\t\t\t\t\t              July 18, 2003\n\n                                                                                                                                 ________________Black River Cemetery\n\n\n\n\n“What a beautiful spot,” the stranger said,\n\nAs he paused and reverently bared his head.\n\nThe golden rays of the setting sun\n\nShone on slab and shaft, where many a one\n\nNow free from labour and earthly care\n\nIn a narrow bed lies resting there.\n\n\n\n\nThe Black River ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-046",
  "title": "Family Chronicle No. 46: Follow-up",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.46\t\t\t\t\t\t\t\t\t\t\n             May 10, 2003\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\t\nFollow-up\n\t\n\n\n\n\t\n\t\nFollowing the last Newsletter, I received a note\n\tfrom Art and Enid Mills.  Enid remembered her grandfather having\n\tsheep and getting yarn in return for the wool.\n\t\n\n\n\n\t\n\t\nArt sent me a statement of account sent to his\n\tfather, Jasper Mills, by my father, Elmer Gl",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-047",
  "title": "Family Chronicle No. 47: Selkirk Settlers",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.47\t\t\t\t\t\t\t\t\t\t            August 18, 2003\n\n                                                                                                                                 ________________\n\nSelkirk Settlers\n\n\n\n\nMy cottage is on a peninsula overlooking Orwell Bay where, 200 years ago, the Selkirk Settlers landed on PEI.  These were not the only Selkirk settlers, but I believe that they were the first.  The notes that follow are based on an article in the Charlottetown Guard",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-048",
  "title": "Family Chronicle No. 48: ________________\fDescendants of Jubal Watling",
  "summary": "Detailed genealogical chart tracing Jubal Watling (married Susan Leach, Nov 1814 in Metfield, Suffolk, England) through multiple generations with children's names and dates. Notes contradictions between two possible Jubals (one from Suffolk, one from Norfolk/PEI) and explores whether they might be the same person. Includes 1841 PEI census data. Also documents Bill Glendinning of Moncton (descended from Dumfriesshire settlers in Galloway, NB) and the 25-year Glendenning family reunion tradition at Ken and Verne's cottage in Point Aux Carr (last Saturday in July, averaging 40-50 attendees). Published August 19, 2003.",
  "content_preview": "The Family Chronicle\n\nNo.48\t\t\t\t\t\t\t\t\t\t            August 19, 2003\n\n                                                                                                                                 ________________Descendants of Jubal Watling\n\n\n\n\n1.  JUBAL1 WATLING1.  He married SUSAN LEACH1 November 10, 1814 in Metfield, Suffolk County, England.  \n\n\n\n\nNotes for JUBAL WATLING:\n\nFamily lore says he came to Black River from either Cape Breton or Prince Edward Island.\n\n\t\n\nChildren of JUBAL WATLING and",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-049",
  "title": "Family Chronicle No. 49: I am grateful to Cameron MacDonald for providing a copy of the above photo which was taken, we belie",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n49           \t\t\t\t\t\t\t\t\t         October 10,  2003\n\n \n\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nI am\n\tgrateful to Cameron MacDonald for providing a copy of the above\n\tphoto which was taken, we believe in 1912 or 1913.  The photo was\n\ttaken at the wedding of Elspeth MacDonald and Ernest Holloway.  The\n\tphoto was not labeled but Cameron has identified people as:\n\t\nBack row:\n\tHugh (Mac) MacDonald killed while working on the Morrissy\n\t(Newcastle) bridge in 1914, Man in front of Mac though",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-050",
  "title": "Family Chronicle No. 50: The Grain Harvest",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.50\t\t\t\t\t\t\t\t\t\t           October 13, 2003\n\n                                                                                                                                 ________________\n\nThe Grain Harvest\n\n\n\n\nWhen PEI set up its museum system, it established a number of small museums instead of a single large one.  Consequently there is a museum devoted to fisheries, agriculture, ship building, etc.  The agricultural museum is at Orwell corner – a community founded by S",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-051",
  "title": "Family Chronicle No. 51: John Franklin Glendenning (December 14, 1919 – June 21, 1986)",
  "summary": "Biography of John Franklin Glendenning (Dec 14, 1919 – June 21, 1986), Don's brother. Major contributor to farm labor after father's illness; worked delivering fish, cutting wood, pressing hay, and trucking goods. Took agricultural course in Newcastle (1930s) including mechanics and woodworking; built a tractor with Brydone Weeks from car and truck parts without welding equipment. Met Mary Edna Bessie Watling at church; married Jan 27, 1944; had four children. Opened store in their living room (1948), later built proper store with gas tanks (1968). Entrepreneurial spirit; turned down military service due to poor eyesight but farming was essential service. Known for singing hymns while working. Published October 16, 2003.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n51\t\t\t\t\t\t\t\t\t\t          October 16,2003\n\n                         \n                                                                     \n                                  __________\n\n\n\t\n\n\n\t\n\t\nJohn\n\tFranklin Glendenning (December 14, 1919 – June 21, 1986)\n\t\n\n\n\n\t\n\t\nJohn\n\twas born at Little Branch shortly after the family returned to\n\tCanada.  He attended the Little Branch School probably for 7 or 8\n\tyears, and then he worked on the farm.  Dad had not been well for a\n\tnumber",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-052",
  "title": "Family Chronicle No. 52: ________________\fBirthdays",
  "summary": "Celebrates 90th birthdays of first cousins Guy Edwin Glendenning (April 15, 1913) and George Elbridge Watling (Nov 24, 1913). Guy grew up in Canobie, son of George Raymond Glendenning and Hilda Ellis (one of 13 children); married Verna Daley; worked at Bathurst paper mill; operates maple sugar business in retirement. Includes detailed genealogical charts for both cousins spanning multiple generations with birth dates, marriages, and offspring. Notes Guy still active in lodge, drives ATV, attends Napan Fair. Emphasizes the importance of documenting extended family information and invites corrections. Published November 10, 2003.",
  "content_preview": "The Family Chronicle\n\nNo.52\t\t\t\t\t\t\t\t\t\t       November 10, 2003\n\n                                                                                                                                 ________________Birthdays\n\n\n\n\nI have not been reporting family events although I thought this time I would make an exception.  A couple of first cousins are celebrating 90th birthdays, however, so I’ve decided to wish them a Happy Birthday.  (I am taking these notes from memory so will apologize in advance ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-053",
  "title": "Family Chronicle No. 53: ________________\fFollow-up",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo.53\t\t\t\t\t\t\t\t\t                  November 17, 2003\n\n                                                                                                                                 ________________Follow-up\n\n\n\n\nThe article on harvesting grain, No. 50, struck a responsive chord.  Thanks for you comments.  Donald Edge remembered calling sheaves “shooks” and stacking them five or six to a side.  (From a tepee to a cabin)  \n\n\n\n\nBill Glendinning of Moncton (Roots in Galloway near",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-054",
  "title": "Family Chronicle No. 54",
  "summary": "Biography of Elinor Jean (Glendenning) Taylor (June 10, 1922 – Feb 22, 1973), Don's sister. Attended Little Branch School through Grade 8, then high school classes at Bay du Vin (5-mile walks or bicycle, winter boarding). Only daughter helping mother with household work while five boys remained home. Met Earl Alexander Taylor (May 10, 1916 – Dec 23, 1969); married Feb 17, 1940; had seven children. Earl served in army, worked at Chatham air base. Family moved to Black River (1949); Elinor was active in Presbyterian Church and Women's Institute. Died suddenly after brief illness while hospitalized following involvement with community hall reconstruction. Remembered as \"high-energy,\" loyal, quick-witted, and a devoted letter-writer. Published November 24, 2003.",
  "content_preview": "The\nFamily\nChronicle\n\nN0.54\t\t\t\t\t\t\t\t\t\t\n  November 24, 2003\n\n                         \n                                                                     \n                                  __________\n\n\n\tElinor\n\tJean (Glendenning) Taylor (June 10, 1922 – February 22, 1973)\n\t\n\n\n\n\t\n\t\n\n\n\t\nElinor\n\ttaken in 1940\n\t\n\n\n\n\t\n\t\nElinor,\n\ther Dad called her Nen, was born in Canada and attended the Little\n\tBranch School to the end of Grade 8.  She then wrote High School\n\tEntrance exams and attended high school ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-055",
  "title": "Family Chronicle No. 55: Dad purchased a Model T. Ford, year unknown, but Lillian (Weeks) Glendenning thought that he had pur",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n55\t\t\t\t\t\t\t\t\t\t       December 20, 2003\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nDad\n\tpurchased a Model T. Ford, year unknown, but Lillian (Weeks)\n\tGlendenning thought that he had purchased it from MacLennan’s\n\tGarage in Chatham (At the corner of the Park).  Lillian remembered\n\tthat the salesman let Grace tryout the car before Dad",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-056",
  "title": "Family Chronicle No. 56: Miramichi Visit",
  "summary": "Don's notes from annual pre-winter Miramichi visit describing speeches to Chatham Rotary Club about community foundation, visits with extended family in Bathurst area, and genealogical research with relatives (Ken, Marjorie Young, Ernie MacLean). Visited New Bandon Cemetery where grandfather Walter and wife Elizabeth Peters are buried. Discusses slovens (low-platform farm wagons used for heavy items like barrels and threshers)—George Adams owned one in Black River and Don recalls another in Canobie. Describes horse scoop (plow-like tool shaped like sugar scoop pulled by horses for moving earth during excavation). Recounts near-fire incident when cats knocked off furnace cover, causing fire that Ken extinguished with water buckets. Published December 22, 2003.",
  "content_preview": "The Family Chronicle\n\nNo. 56\t\t\t\t\t\t\t\t\t\t       December 22, 2003\n\n                                                                                                                                 ________________\n\nMiramichi Visit\n\n\n\n\nI made these notes while on my annual pre-winter visit to the Miramichi; it was a busy four days.  I arrived about noon on Thursday and went back to PEI on Sunday morning.  While there I spoke to the Chatham Rotary Club about the establishment of a comm-unity foundatio",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-057",
  "title": "Family Chronicle No. 57: Top left:  \t\tMy father, Elmer Alton Glendenning",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.57\t\t\t\t\t\t\t\t\t\t\n          January 10, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nTop left: \n\t\t\tMy father, Elmer Alton Glendenning \n\t\n\t\nTop right:\n\t\tMy mother, Jane Elizabeth Jardine (Watling) Glendenning \n\t\n\t\nBottom\n\tleft: \tGrandparents, Walter and Elizabeth (Peters) Glendenning \n\t\n\t\nBottom\n\tright:  \tGrandparents, Jubal and Grace (MacDonald) Watli",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-058",
  "title": "Family Chronicle No. 58: Glendenning Family Photo",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.58\t\t\t\t\t\t\t\t\t\t\n        January 15, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\nGlendenning\n\tFamily Photo\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nAn\n\tundated photo, taken in 1937 or earlier, of my father, Elmer, and\n\tsome of his siblings.  From left to right: Raymond, married to Hilda\n\tEllis, lived in Canobie, N.B.; Maude, married to Jim Cormier, lived\n\tin Canobie, N.B.: Guy, m",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-059",
  "title": "Family Chronicle No. 59: Photos",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.59\t\t\t\t\t\t\t\t\n                        January 23,2004\n\n                                               \n                                                           \n________________\n\n\n\n\n\n\n\n\t     \n\t\n\n\t\n\n\n\n\t\n\t\n    \n\t\n\n\t\t\n\t\n\n\n\n\t\n\t\n    \n\t\n\n\t\nPhotos\n\t\n\n\n\n\t\n\t\nI\n\tam grateful to Cameron MacDonald for copies of the photos appearing\n\ton the left.  We are not certain, but they may be my GGGrandparents,\n\tAlexander and Grace (McAskill) MacDonald, their son, John and his\n\twife, Elspeth Jar",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-060",
  "title": "Family Chronicle No. 60: Trinity Union Church, Canobie",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.60\t\t\t\t\t\t\t\t\t\t\n       February 12, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nTrinity\n\tUnion Church, Canobie\n\t\n\n\n\n\t\n\t\nAt\n\tfirst, church services were held in the local school but in 1899\n\tthis church was built and used by Presbyterians, Methodists and\n\tAnglicans.  (It is now an Anglican Church).  \n\t\n\t\n\n\n\n\t\n\t\nOur\n\tGrandfather, Walter, was active ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-061",
  "title": "Family Chronicle No. 61: NEIGHBOURS AROUND THE BRANCH",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 61\t\t\t\t\t\t\t\t\t\t     February 15, 2004 \n\n                                                                                                                                 ___________\n\nNEIGHBOURS AROUND THE BRANCH\n\n\n\n\nThis is an attempt to recall our neighbours around the Little Branch as best I can remember, in 1939.  I am grateful for assistance provided by Norm and Ken, and George Watling, in remembering who lived where.\n\n\n\n\nReaders are invited to provide corrected  and ad",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-062",
  "title": "Family Chronicle No. 62: This photo shows a pile driver and crew on a dam site in Wausau, Wisconsin where dad worked in 1910",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.62\t\t\t\t\t\t\t\t\t\t\n        February 23, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\t\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nThis photo\n\tshows a pile driver and crew on a dam site in Wausau, Wisconsin\n\twhere dad worked in 1910 – the year he and Mum were married.  I do\n\tnot know if Dad is in the photo.\n\tDoring\n\t\n\n\n\n\t\n\t\nMy\n\tfather’s oldest sister, Venetia, married Robinson Linc",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-063",
  "title": "Family Chronicle No. 63: The above photo was among old family photos and was taken in Berlin, New Hampshire.  It is undated.",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.63\t\t\t\t\t\t\t\t\t\t\n        February 25, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n          \n\t\n\n\t\n           \n\t\n\t\n\n\n\n\t\n\t\nThe\n\tabove photo was among old family photos and was taken in Berlin, New\n\tHampshire.  It is undated.  We know that Dad and one or more of his\n\tbrothers ran a cartage business in Portland and that he lumbered in\n\tNew Hampshire but we do not know if",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-064",
  "title": "Family Chronicle No. 64: Winter Storms",
  "summary": "Family Chronicle #64 (March 2004) recalls winter storms and snow-clearing practices in rural Miramichi during Don's childhood, contrasting pre-mechanized community labor with modern highway maintenance.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n64\t\t\t\t\t\t\t\t\t\t           March 4, 2004\n\n                                               \n                                                                     \n           ________________\n\n\t\n\tWinter Storms\t\t\t\t\n\t\n\n\n\n\t\n\t\n      \n\t\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nHarold\n\tMacDonald’s Truck – Feb. 1952\n\t\n\n\n\n\t\n\t\n     \n\t\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nNorman’s\n\ttruck – 1952, probably in March\n\t\n       \n\t\n\t\n   \n\t\n\t\nThe\n\tMaritimes, especially Nova Scotia and Prince Edward Island, have\n\tbeen inundated with snow i",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-065",
  "title": "Family Chronicle No. 65: Another snow scene - Little Branch Road, just above home, on April 16, 1961",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n65\t\t\t\t\t\t\t\t\t\t            March 10, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nAnother\n\tsnow scene - Little Branch Road, just above home, on April 16, 1961\n\t\n\n\n\n\t\n\tAnother\n\tSnow Story\n\t\n\n\n\n\t\n\t\nWith\n\tsnow on the side of the road, roads were often mini lakes when\n\tspring came.  When walking, people would step on to the bank to walk\n\tpast the pudd",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-066",
  "title": "Family Chronicle No. 66: Miramichi Fire Song",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n66\t\t\t\t\t\t\t\t\t\t         April 10, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\nMiramichi\n\tFire Song\n\t\n\n\n\n\t\n\t\nI\n\tam grateful to Donald Edge for The\n\tMiramichi Fire Song\n\twhich was collected from Jean MacDonald in 1953 by Dr. Helen\n\tCreighton in Maritime\n\tFolksongs\n\n\n\nIt\n\tis the truth what I now tell you \n\nFor my eyes did partly\n\tsee\n\nWhat did happen to the pe",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-067",
  "title": "Family Chronicle No. 67: A suspension bridge spanned the river at Baie St. Anne and was a place to visit on a sunny Sunday af",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n67\t\t\t\t\t\t\t\t\t\t               April 20, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nA\n\tsuspension bridge spanned the river at Baie St. Anne and was a place\n\tto visit on a sunny Sunday afternoon.  I am not sure, but this may\n\tbe Margaret (Glendenning) Gibson crossing the bridge.  Photo undated\n\tbut thought to be in the early 1950’s.  \n\t\n\t\n\n\n\n\t\n\t\nG",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-068",
  "title": "Family Chronicle No. 68: Church Report – 1913",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 68\t\t\t\t\t\t\t\t\t\t               May 4, 2004\n\n__________________________________________________________________________________\n\nChurch Report – 1913\n\n\n\n\nSome interesting bits of information from St. Stephen’s (then Presbyterian) Church for the year 1913.\n\nEnvelope giving amounted to $463.93\n\nPastor’s salary and supply was $912.00\n\nEight cord of wood was purchased for $3.00 per cord.\n\nA church bell was purchased for $137.50, there as a charge of $1.18 for its delivery, wages",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-069",
  "title": "Family Chronicle No. 69: Don Glendenning at Callister, Scotland - 1988",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n69\t\t\t\t\t\t\t\t\t\t              May 21, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nDon\n\tGlendenning at Callister, Scotland - 1988\n\t\n\n\n\n\t\n\t\nCallister\n\tHall\n\t\n\n\n\n\t\n\t\nReaders\n\twill remember an earlier chronicle with a photo of Callister Hall in\n\tScotland where my Great Grandfather, John Glendinning was born on\n\tApril 2, 1807.  The latest descendant to",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-070",
  "title": "Family Chronicle No. 70: The above photo, from Venetia’s collection, of my father, on the left, (1875-1938) and his brother F",
  "summary": "Family Chronicle No. 70 (May 2004) provides obituaries and death records for Don's father and uncle, including Uncle Frank Glendenning (1875-1937), documenting family genealogy and local history from the Miramichi and Portland, Maine regions.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.70\t\t\t\t\t\t\t\t\t\t\n                May 23, 2004\n\n__________________________________________________________________________________\n\n\n\n\n\n\n\n\t\n\n\t\n\n\tThe\n\tabove photo, from Venetia’s collection, of my father, on the left,\n\t(1875-1938) and his brother Frank (1875-1937) was taken in front of\n\tour home at Little Branch on October 12, 1935.  The front of the\n\tporch was always covered with vines.  In the fall, when the seedpods\n\twere full, we would squeeze the pods until the seeds popp",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-071",
  "title": "Family Chronicle No. 71: Correction",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.71\t\t\t\t\t\t\t\t\t\t\n                May 24, 2004\n\n__________________________________________________________________________________\n\n\n\t \n\t\nCorrection\n\t\n \n\t\n\n\n\t\n \n\t\nElmer\n\tGlendenning (1875-1938) and Franklin Glendenning (1876-1937). \n\tThanks Loisanne.\n\t\n \n\t\nBuilding\n\ta Load of Hay\n\t\n \n\t\nThere\n\twas quite an art to building a load of loose hay – and remember,\n\tthe load was being build on a rack on a truck wagon.  For those not\n\tfamiliar with a truck wagon, it was a heavy farm wa",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-072",
  "title": "Family Chronicle No. 72: Venetia and Walter Glendenning taken in 1935 at Little Branch.  Would the horse be Prince?",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.72\t\t\t\t\t\t\t\t\t\t\n              May 29, 2004\n\n__________________________________________________________________________________\n\n\n\t\n\n\t\nVenetia\n\tand Walter Glendenning taken in 1935 at Little Branch.  Would the\n\thorse be Prince?\n\t\n \n\t\nHotel\n\tin Little Branch\n\t\n \n\t\nWhile\n\tvisiting the Miramichi recently, Teddy Fowlie mentioned that there\n\thad been an inn up the Little Branch River at the Forks.  Presumably\n\tit was an overnight stop for travelers.  It could even have been a\n\tma",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-073",
  "title": "Family Chronicle No. 73: Believed to be Don Glendenning, Jane Glendenning, Grace Godfrey, John R. Godfrey and Cameron Russell",
  "summary": "Family Chronicle No. 73 (June 2004) includes an historical photograph with Don and family members at Little Branch, and contains the obituary of Guy Wellington Glendenning, providing genealogical documentation of Don's extended family.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n73\t\t\t\t\t\t\t\t\t\t              June 18, 2004\n\n__________________________________________________________________________________\n\n\n\t\n\n\t\nBelieved\n\tto be Don Glendenning, Jane Glendenning, Grace Godfrey, John R.\n\tGodfrey and Cameron Russell at Little Branch.  The school would be\n\tdirectly behind the group.  To the left, is the tree in the\n\tschoolyard leaning out into the cove. To the right can be seen the\n\tFinno home, the Little Branch Bridge is just out of sight to the\n\tright",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-074",
  "title": "Family Chronicle No. 74: Lillian (Glendenning) Weeks, Bobby Glendenning (Uncle Guy’s son) and Don Glendenning taken at Little",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n74\t\t\t\t\t\t\t\t\t\t               June 28, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\n\n\t\n\n\t\nLillian\n\t(Glendenning) Weeks, Bobby Glendenning (Uncle Guy’s son) and Don\n\tGlendenning taken at Little Branch.  Believed to have been taken in\n\t1937 when Uncle Guy was in New Brunswick for Venetia’s wedding. \n\t(As I recall, my first long pants, other than overalls, were\n\tpu",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-075",
  "title": "Family Chronicle No. 75: The first St. Stephen’s Church was opened in Black River in 1836",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n75\t\t\t\t\t\t\t\t\t\t                   July 2, 2004\n\n__________________________________________________________________________________\n\n\n\t\n\n\n\t\n\n\n\n\t\n\n\t\nThe\n\tfirst St. Stephen’s Church was opened in Black River in 1836\n\t\n \n\t\nJanet\n\t(Watling) Godfrey\n\t\n \n\t\nThe\n\tMiramichi Press of December 21, 1977 carried the following:\n\t\n \n\t\nFUNERAL\n\tIN BLACK RIVER BRIDGE\n\t\n \n\t\nThe\n\tfuneral service for Mrs. Janet M. Godfrey, widow of John R. Godfrey\n\tof Black River Bridge, was conducted at her h",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-076",
  "title": "Family Chronicle No. 76: Thanks to Marjorie (Watling) Young for the above photo, taken in front of the winter’s wood – probab",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n76\t\t\t\t\t\t\t\t\t\t            July 21, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nThanks\n\tto Marjorie (Watling) Young for the above photo, taken in front of\n\tthe winter’s wood – probably at Uncle Jim’s or at home.  From\n\tleft to right:  Norman Glendenning, Winfield Watling, Hartley Chase,\n\tKen Glendenning, and Roy Watling.\n\t\n\n\n\n\t\n\tComputer\n\tProblem",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-077",
  "title": "Family Chronicle No. 77: Thanks to Marjorie (Watling) Young for above photo taken at the Little Branch Bridge in 1931.  In th",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.77\t\t\t\t\t\t\t\t\t\t\n           August 25, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\t\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\nThanks\n\tto Marjorie (Watling) Young for above photo taken at the Little\n\tBranch Bridge in 1931.  In the photo are Burton Andrews, Student\n\tMinister at St. Paul’s Presbyterian Church and Charlie Spencer,\n\tteacher at the Little Branch School.\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nFamily\n\tR",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-078",
  "title": "Family Chronicle No. 78: Undated photo of the Miramichi Rural High School.  The school has since been demolished.",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n78\t\t\t\t\t\t\t\t\t                     September 1, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\t\n\n\t\nUndated\n\tphoto of the Miramichi Rural High School.  The school has since been\n\tdemolished.\n\t\n\n\n\n\t\n\t\nMRHS\n\t\n\n\n\n\t\n\t\nThe\n\tMiramichi Rural High School was the first of a new series of rural\n\thigh schools in New Brunswick; the second school was on Deer Island.\n\t Before that,",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-079",
  "title": "Family Chronicle No. 79: A counting rhyme:",
  "summary": "Family Chronicle No. 79 (September 2004) recounts World War Two aviation history at Chatham and includes a family counting rhyme, documenting Don's childhood memories and cultural traditions from the Miramichi region.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n79\t\t\t\t\t\t\t\t\t\t           September 5, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n   \n\t\n\t\n            \n\t\n\n\t\n\n\n\n\t\n\t\nNo. 31 Elementary Flying\n\tTraining School (EFTS) at Chatham used the Fleet Finch for training \n\tpurposes during World War Two.  The above photo of a Fleet Finch was\n\ttaken recently at the air museum in Ottawa.  As I understand it,\n\tafter some basic fl",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-080",
  "title": "Family Chronicle No. 80: A photo of the Avro Anson taken at the Air Museum in Ottawa.  Avro Ansons were used at No. 10 A.O. S",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n80\t\t\t\t\t\t\t\t\t\t            October 1, 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nA photo of\n\tthe Avro Anson taken at the Air Museum in Ottawa.  Avro Ansons were\n\tused at No. 10 A.O. S  (Air Observer School) which was part of the\n\tChatham Air Force Base during WW2.  All the aircraft at both No. !0\n\tAOS and No. 21 EFTS were painted a bright yellow ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-081",
  "title": "Family Chronicle No. 81: Above is a photo of the first graduating class at the Miramichi Rural High School in June 1940.  Bac",
  "summary": "Don memorializes Mary (Godfrey) Williston (1911-2004), who taught at Little Branch School for three years and boarded with Uncle Jim and Aunt Kate Watling. He recalls her as a strict but good teacher. The issue includes Don's personal anecdotes about picking mushrooms as a child and trying to identify whether they were toadstools, and a nostalgic piece on clothing progression from two-piece summer suits (via sister Grace from Boston) through bib overalls to long pants purchased for his father's 1938 funeral. These pieces reveal Don's intimate recall of rural childhood and his family's evolving circumstances.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n81\t\t\t\t\t\t\t\t\t\t   October  13, 2004\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\nAbove\n\tis a photo of the first graduating class at the Miramichi Rural High\n\tSchool in June 1940.  Back row, left to right: Ivy Kingston, Anna\n\tWilliston, Peter Kingston, Evelyn Chapman and Catherine MacLean. \n\tFront row: Emily Smith, Alvena Smith, Opal Fraser and Marion Smith. \n\tGraduates would have commenced studies at St. John’s Anglican\n\tChurch ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-082",
  "title": "Family Chronicle No. 82: George Watling and Don Glendenning preparing for a fishing expedition to the Branch Bridge.  See how",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n82\t\t\t\t\t\t\t\t\t\tNovember 18, 2004\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nGeorge Watling and Don\n\tGlendenning preparing for a fishing expedition to the Branch Bridge.\n\t See how long and straight George’s fishing rod is, no wonder he\n\tcaught all the trout.  No, I did not forget.  I know that this is a\n\trepeat photo.  \n\t\n\t\n\n\n\n\t\n\t\nNote:\n\t\n\n\n\n\t\n\t\nNormally, I do not use the newsletter to report\n\ton family events.  The reason for",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-083",
  "title": "Family Chronicle No. 83: MRHS Graduation 1945",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n83\t\t\t\t\t\t\t\t\t\t          November 20 , 2004\n\n                                               \n                                                                     \n           ________________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nMRHS\n\tGraduation 1945\n\t\nFrom\n\tleft:  George Watling, Joan MacDonald, Mary MacDonald and Frances\n\tMacLean\n\n\n\n\t\n\n\n\t\n\n\n\tGraduation Photos\n\t\n\n\n\n\t\n\t\nGeorge\n\tWatling tells me that the above \n\t\n\t\nphoto was taken at the home of Frances MacLean. \n\tPerley Quayle, Princ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-084",
  "title": "Family Chronicle No. 84: Miramichi Rural High School Graduating class in 1942.  From left to right:  Ken Glendenning, Lorna W",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n84\t\t\t\t\t\t\t\t\t      November 25, 2004\n\n____________________________________________________________________\n\n\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nMiramichi\n\tRural High School Graduating class in 1942.  From left to right: \n\tKen Glendenning, Lorna Watling, Bertha Fowlie, Isobel Williston,\n\tJennie MacLean, Shirley MacDonald, Edith MacRae and Billy Gulliver\n\n\n\n\t  \n\t\n\t\nCommunity\n\tFacilities\n\t\n\n\n\n\t\n\t\nIn\n\t1939, Black River was served a community Hall, four one-room schools\n\t(Little Branch, Middle",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-085",
  "title": "Family Chronicle No. 85: In my day, this was the home of Uncle Jim and Aunt Kate Watling and currently is the home of Neil an",
  "summary": "Family Chronicle No. 85 from December 6, 2004, documenting the history of a property in Black River and its residents, including Uncle Jim and Aunt Kate Watling. Includes extensive genealogical records of Jubal Watling (b. 1823 in England) and his descendants, with detailed notes on family migration patterns from Suffolk to New Brunswick. Reflects Don's meticulous genealogical research spanning English origins (Watlings, Harley/Harleys) through 19th-century New Brunswick settlement.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n85\t\t\t\t\t\t\t\t\t\t  December 6, 2004\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\n\t\n\n\t\n\n\n\n\t\n\t\nIn\n\tmy day, this was the home of Uncle Jim and Aunt Kate Watling and\n\tcurrently is the home of Neil and Anna Watling.  It probably was\n\tbuilt by my Great Grandparents, John (1817-1900) and Elspeth\n\t(1821-1907) (Jardine) MacDonald.  In 1901, Elspeth turned over the\n\tproperty to her daughter, Grace, and her husband, Jubal Watling in\n\treturn for a lifelo",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-086",
  "title": "Family Chronicle No. 86: From left:  Winfield Watling, Catherine (MacLean) Newton, Elinor (Glendenning) Taylor and Unknown ?",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n86\t\t\t\t\t\t\t\t\t            December 9, 2004\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\tFrom\n\tleft:  Winfield Watling, Catherine (MacLean) Newton, Elinor\n\t(Glendenning) Taylor and Unknown ? Photo taken in the Little Branch\n\tschoolyard.\n\t\n\n\t\n\n\n\t\n\t\nA “shunt” from the West\n\t\n\n\t\n\n\n\t\n\t\n\n\tThanks to Jennie Foley for\n\tthis story about her grandfather, Robert Henry Peters.\n\t\n\n\t\n\n\n\t\n\t\n\n\tFarmers sometimes bought\n\thorses shipped f",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-087",
  "title": "Family Chronicle No. 87: The Gleaner of Chatham, NB in 1833 carried mostly international news, shipping information, and adve",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 87\t\t\t\t\t\t\t\t\t\tDecember 10, 2004\n\n____________________________________________________________________\n\n\n\nThe Gleaner of Chatham, NB in 1833 carried mostly international news, shipping information, and advertisements, however, on June 25, 1833 the Gleaner carried the following “ORIGINAL” item:\n\nBLACK RIVER\n\nTwo steep banks of this river, once clad to the brink with lofty trees, that looked frowningly down upon its deep, but narrow channel, threw over its surface a bright b",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-088",
  "title": "Family Chronicle No. 88: The Gleaner of Chatham, NB in 1834 carried mostly international news, shipping information, and adve",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 88\t\t\t\t\t\t\t\t\t          December 15, 2004\n\n____________________________________________________________________\n\n\n\nThe Gleaner of Chatham, NB in 1834 carried mostly international news, shipping information, and advertisements, however, on January 7, 1834, the Gleaner carried the following “ORIGINAL” item:\n\n\n\n\nBAY DU VIN RIVER\n\n\n\n\n“After twisting and tumbling in its narrow channel, a distance of about 30 miles, through fertile soils and frowning forests, the Bay du Vin Rive",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-089",
  "title": "Family Chronicle No. 89: The Dump Cart",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n89\t\t\t\t\t\t\t\t\t      \t      January 5, 2004\n\n____________________________________________________________________\n\n\n\t\n\t\nThe Dump Cart\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nI\n\thave fond memories, but cannot tell you why, of the lowly dumpcart -\n\tthe workhorse of a small farm.  It was used for hauling gravel,\n\tbanking, turnips, manure, firewood, etc, etc, etc. – and of\n\tcourse, people.  As the name says, it was a cart that dumped; while\n\tloading was difficult, unloading was easy.\n\t\n\n\n\n\t\n\t\n",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-090",
  "title": "Family Chronicle No. 90: MRHS Graduating Class of 1946:  Front Row: Helen MacNaughton, Flora Kingston. Helen MacRae,  Ellen M",
  "summary": "Family Chronicle No. 90 (January 2005) includes Don's 1946 high school graduating class photo from Miramichi Rural High School and an obituary for Christina MacKenzie (née Watling), a family connection from Don's childhood.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n90\t\t\t\t\t\t\t\t\t\t      Janary 15, 2005\n\n\n\n\t\n\n\n\t\nMRHS\n\tGraduating Class of 1946:  Front Row: Helen MacNaughton, Flora\n\tKingston. Helen MacRae,  Ellen MacLenaghan and Kathleen MacRae. \n\tBack Row:  Mary Johnston, Vera Cameron, Robert Dutcher, Don\n\tGlendenning,  Bill Gregan and Norma Williston,  (Ed: This has to be\n\tthe finest looking group of all) \n\t\n\n\n\n\t\n\t\nFollow-up\n\t\n\n\n\n\t\n\t\nDonald Edge\n\twrote:\n\t\n\n\n\n\t\n\t\n“I\n\ttoo like the dumpcart, but my favorite was the hayrake\n\t\n \n\t\nIn\n\tall ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-091",
  "title": "Family Chronicle No. 91: Thanks to Tina Newton for this photo of “The Watlings 5”: James A., Jane (Glendenning), Ernest, Jane",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n91\t\t\t\t\t\t\t\t\t\t    January 31, 2005\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\n\t\nThanks\n\tto Tina Newton for this photo of “The Watlings 5”: James A.,\n\tJane (Glendenning), Ernest, Janet (Godfrey) and George.  Date\n\tuncertain but probably mid-1950’s.\n\t\n\t\n\n\n\n\t\n\n\n\t\n\t\n“Twitchin\n\t logs”\n\t\n\n\n\n\t\n\t\nReading\n\tW. D. Hamilton’s book on the\n\tOld North Esk\n\treminded me of  terms used in lumbering.  While my woods work was\n\tlimited to cutting our wi",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-092",
  "title": "Family Chronicle No. 92: Undated photo of the Little Branch School",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n92\t\t\t\t\t\t\t\t\t\t  February 22, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\t\nUndated photo of the Little Branch School\n\t\n\n\n\n\t\n\t\nThe following is a\n\tcontinuation of obituaries of my Uncles and Aunts\n\t\n\n\n\n\t\n\t\nJohn\n\tW. MacNaughton\n\t\n\n\n\n\t\n\t\nMourn\n\tDeath of Well Known Resident\n\t\n\n\n\n\t\n\t\nBlack\n\tRiver (Special) – The death of John W. MacNaughton in his 86th\n\tyear removed from the Miramichi scene a widely known and highly\n\trespected farm",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-093",
  "title": "Family Chronicle No. 93: My Grandfather, Walter Glendenning, with his daughter, Margaret at a stone quarry in Stonehaven, nea",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n93\t\t\t\t\t\t\t\t\t\t          April 8 , 2005\n\n____________________________________________________________________\n\n\n\t\n\n\t\nMy\n\tGrandfather, Walter Glendenning, with his daughter, Margaret at a\n\tstone quarry in Stonehaven, near Bathurst, N.B.  I recall the stone\n\tquarry  when  we would visit relatives in the area.  As I recall,\n\tsome relatives owned the stone quarry.  The quarry has now been\n\teroded by wind and water.\n\t\n\n\n\n\t\n\t\nD.\n\tErnest Watling\n\t\n\n\n\n\t\n\t\nFrom\n\ta clipping – date a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-094",
  "title": "Family Chronicle No. 94: I am grateful to my cousin, Jennie \u2028Foley for the following note.  We share Great Grandparents, John",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 94\t\t\t\t\t\t\t\t\t\t         April 11, 2005\n\n____________________________________________________________________\n\n\n\nI am grateful to my cousin, Jennie \n\nFoley for the following note.  We share Great Grandparents, John and Jane (Sealey) Peters.  \n\n\n\n\nSome North Shore Notes \n\n\n\n\nI wrote to you some while back about my Mother, Eva Peters, who had done a history correspondence course when she was in her late 60's back in 1984.  She had never gone beyond Grade 8 in her small school",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-095",
  "title": "Family Chronicle No. 95: Front: Janet Godfrey, Jane Glendenning, ?  Standing: Bioney MacDougall, ?, Alice Watling, ?,  Marion",
  "summary": "Family Chronicle (No. 95) dated June 2, 2005, commemorating extended family history. Opens with group photograph and obituary of James A. Watling (95, deceased), a Black River farmer and smelt buyer for W.S. Loggie Co. for 42 years. Includes nostalgic anecdotes about childhood playground (teeter-totter/\"buckety wade\"), Fowlie's Mill fire (1828 clipping), ironing clothes with hand-heated irons on wood stoves, and introduction of electric iron in 1948. Reflects on technological transitions and family traditions. Content shows Don's interest in documenting disappearing rural practices.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n95\t\t\t\t\t\t\t\t\t                     June 2, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\t\t\n\n\n\t\n\t\nFront:\n\tJanet Godfrey, Jane Glendenning, ?  Standing: Bioney MacDougall, ?,\n\tAlice Watling, ?,  Marion MacLean, ? .\n\t\n\n\n\n\t\n\t\n\n\n\t\tStoppage Settled\n\t\t\n\n\n\n\t\t\n\t\t\nThe\n\t\tlong delay since the last Newsletter results from a labour dispute\n\t\tbetween the editor and publisher.  Negotiations dragged on for\n\t\tmonths.  The dispute is now settled an",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-096",
  "title": "Family Chronicle No. 96: The First Black River Community Hall",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 96\t\t\t\t\t\t\t\t\t\t           June 3, 2005\n\n____________________________________________________________________\n\n\n\n\n\n\nThe First Black River Community Hall\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDid you know that the present Black River Community Hall is the third building on the same site?\n\n\n\n\nLike most communities of the day, schools in Black River served as centers for community gatherings.  My sister, Lillian, recalled many dances in the Little Branch School a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-097",
  "title": "Family Chronicle No. 97: Front: Janet Godfrey, Jane Glendenning and Mona Landry. Back: Bioney  MacDougall, Lottie Mills, Alic",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n97\t\t\t\t\t\t\t\t\t      , 2005\n\n____________________________________________________________________\n\n\n\t\n\n\t\n\n\n\n\t\n\t\nFront:\n\tJanet Godfrey, Jane Glendenning and Mona Landry. Back: Bioney \n\tMacDougall, Lottie Mills, Alice Watling, Unknown and Marion MacLean.\n\t Thanks to Ken Glendenning for the additional names\n\t\n\n\t\nThe Second\n\tBlack River Community Hall\n\t\n\n\n\n\t\n\t\nThe\n\tashes were hardly cold on the First Community Hall (Burned to the\n\tground about midnight, August 24, 1932) when pl",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-098",
  "title": "Family Chronicle No. 98: John Fowlie at Fowlie’s Mill in 1940; courtesy of Everard MacLean",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n98\t\t\t\t\t\t\t\t\t\t      July 29, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nJohn\n\tFowlie at Fowlie’s Mill in 1940; courtesy of Everard MacLean\n\t\n\n\n\n\t\n\t\n\n\t MacNaughton\n\t\n\n\n\n\t\n\t\nMy\n\tthanks to Thomas Holme for the following note, which arose from his\n\treading of an item in Family Chronicle No. 28:\n\t\n\n\n\n\t\n\t\n“There were no McNaughtons living in Dunderave\n\tcastle after around 1720. Your website states that Malcolm's son\n\tJohn was",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-099",
  "title": "Family Chronicle No. 99: ST PAUL’S PRESBYTERIAN CHURCH",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 99\t\t\t\t\t\t\t\t\t                August 6, 2005\n\n____________________________________________________________________\n\n\n\nST PAUL’S PRESBYTERIAN CHURCH\n\nBLACK RIVER BRIDGE, NB\n\nSpeaking Notes on the occasion of the75th Anniversary*\n\nJuly 24, 2005\n\n\n\n\nCongratulations - \tmembers and adherents of this congregation for seventy-five years of dedication and service\n\nThanks for the invitation to take part \n\nSeventy-five years ago\t- first regular church service.  \n\n- I was here and le",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-100",
  "title": "Family Chronicle No. 100: On Reaching 100",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 100\t\t\t\t\t\t\t\t\t     August 15, 2005\n\n____________________________________________________________________\n\n\n\nOn Reaching 100\n\n\n\n\nYes, this is Issue 100.  Reaching 100 was never an objective but has become a milestone and, I think, therefore, is worthy of reflection.  Issue No. 1, on May 5, 1997 stated:\n\n\n\n\n“The Chronicle is an occasional Newsletter devoted to genealogy… Its purpose is to both share and seek information.  It will be published from time to time as the spirit",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-101",
  "title": "Family Chronicle No. 101: Glendenning Fund",
  "summary": "Family Chronicle (No. 101) dated August 22, 2005 covering two topics. First: establishment of Glendenning Fund through 2000 family reunion for charitable purposes with Black River theme; grants awarded for student essays and library books (photo shows Glendenning family members and school participants). Second: nostalgic recollection of fall food preservation at home—pickling, jelly-making, fruit drying, and wartime canning techniques. Detailed technical descriptions of pressure canning, boiling, cooling, and storage of canned vegetables and fruit for winter use. Mentions inclusion of home-canned items in overseas military parcels. Reflects Don's pride in family charitable legacy and his documentation of rural domestic practices.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n101\t\t\t\t\t\t\t\t      \t      August 22, 2005\n\n\n\t\n\t\nGlendenning\n\tFund\n\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tReaders may remember that the Glendenning Family established a Fund,\n\tas part of their family reunion activities in 2000.  Grants from the\n\tFund may be made for any charitable purpose reflecting a Black River\n\ttheme.  The first grant was made to Barry MacKenzie for an essay on\n\t“The MacKenzie Settlement and Klondike Will’.  A prize also went\n\tto Justin Morris for an essay on St. S",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-102",
  "title": "Family Chronicle No. 102: An Oak Grows on the Old Homestead",
  "summary": "Family Chronicle (No. 102) dated August 26, 2005 documenting symbolic planting of red oak tree from PEI at old family homestead (now Norman Glendenning's home) during 2000 family reunion. Photo shows young Jarret Glendenning (descended from Elmer and Jane Watling Glendenning) by five-year-old tree. Also includes anecdotes: 4-H club participation and cattle showing experience (fourth place prize); tornado at Black River May 17, 1932 destroying barns of \"Major\" MacDonald and others, narrow escape for Don and father; follow-up correspondence from Art Mills on Life Magazine subscriptions and Tina Watling Newton recollections of family stories from Boulder, Colorado. Shows family continuity across generations and Don's efforts to document community events.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n102\t\t\t\t\t\t\t\t\t     August 26, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nAn Oak Grows on the Old Homestead\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nAt\n\tthe Glendenning family reunion in 2000, a red oak from Prince Edward\n\tIsland, ,was planted at the old homestead, now the home of Norman\n\tGlendenning and family.  The photo above shows the tree five years\n\tlater.  Standing by the tree is Jarret Glendenning, the youngest\n\tmale Glendenning descended from ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-103",
  "title": "Family Chronicle No. 103: Black River Community Halls",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n103\t\t\t\t\t\t\t\t\t      August 30, 2005\n\n____________________________________________________________________\n\n\n\tBlack River Community Halls\n\t\n\n\n\n\t\n\t\nFamily Chronicle No. 96 gave a brief history of\n\tthe First Community Hall in Black River, built in 1930.  My plea for\n\tphotos brought no results.  Thanks, however, to Everard and Bertie\n\tMacLean, I am able to provide some photos of the second one. (See\n\tFamily Chronicle No. 97)\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nThe second\n\tbuilding, erected i",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-104",
  "title": "Family Chronicle No. 104: Tornado Strikes Upper Black River",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n104\t\t\t\t\t\t\t\t        September 18, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nTornado\n\tStrikes Upper Black River\n\t\n\n\n\n\t\n\t\n\n\n\t\nUpper\n\tBlack River Hall\n\t\n\n\n\t\nUpper\n\tBlack River School\n\t\n\n\n\n\t\n\t\n\n\n\t\nRobert\n\tMacNaughton beside barn\n\t\n\n\n\n\t\n\t\nUpper\n\tBlack River was struck by a tornado in 1903 or 1904, or both.  A\n\treference in the Chatham Gazette of May 18, 1932 refers to the\n\ttornado demolishing the Upper Black River Community Hall\n\t“tw",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-105",
  "title": "Family Chronicle No. 105: Follow-up",
  "summary": "Family Chronicle (No. 105) dated October 16, 2005 featuring reader follow-ups and family connections. Photos of Aunt Maude (Glendenning) and Uncle Jim Cormier with son-in-law James Berry. Walt Berry's recollections of grandmother Maude's death (1956), grandfather Jim Cormier's farming life, Mennonite agricultural practices observed during Walt's adult life. List of newly-connected cousins: Alice Saulnier, Walt Berry, Helen Ryan, Bob Jones (traced through various common ancestors). Detailed technical description of Don's childhood \"force pump\" for water, built by his father after purchasing Little Branch property—demonstrates early plumbing innovation with upstairs bathroom aspiration (not realized until 1948 electricity arrival). Hand pump backup system during power outages. Reveals Don's interest in family connections and technological change in rural life.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t105\t\t\t\t\t\t\t\t\t   October 16 , 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nFollow-up\n\t\n\n\n\n\t\n\t\nA\n\trecent note form Walt Berry, a grandson of Maude (Glendenning) and\n\tJames Cormier included the photos on the left.  The top photo shows\n\tAunt Maude and Uncle Jim Cormier with their son-in-law, James Berry,\n\tWalt’s father.  The second photo is of Aunt Maude and the last of\n\tUncle Jim.\n\t\n\n\n\n\t\n\t\nWalt’s\n\tnot",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-106",
  "title": "Family Chronicle No. 106: A Recollection by Donald Edge",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 106\t\t\t\t\t\t\t\t\t     October 24,2005\n\n____________________________________________________________________\n\nA Recollection by Donald Edge\n\n\n\n\nThe Outhouse\n\n\n\n\n\"And it shall come to pass, that instead of sweet smell there shall be stink…\"\n\n[Isaiah 3:24]\n\n\n\n\nMy grandparents' house saw many firsts.  It was the first house in Upper Black River to have a telephone, the first to have electricity, the first to have running hot water, and the first to have an indoor toilet.  Of cou",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-107",
  "title": "Family Chronicle No. 107: Members of the Victoria Knitting Club",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n107\t\t\t\t\t\t\t\t       November 20, 2005\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tMembers\n\tof the Victoria Knitting Club\n\t\n\n\tFrom\n\tLeft to right:  Minnie Godfrey (Charter Member), Louise MacDougall,\n\tTanker O’Malley (MLA), Ruth Newton, Catherine Newton, Evelyn\n\tFryatt.  Missing from photo: Jean Murdock\n\n\n\n\t\n\n\n\t\n\t\nVictoria Knitting Club\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tVictoria Knitting Club was established in the Victoria District of\n\tBlack R",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-108",
  "title": "Family Chronicle No. 108: Shown above is Arthur Mills, son of Jasper and Sarah (MacLeod) Mills of Hardwicke, NB.   Art is hold",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n108\t\t\t\t\t\t\t\t\tDecember 17, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\nShown\n\tabove is Arthur Mills, son of Jasper and Sarah (MacLeod) Mills of\n\tHardwicke, NB.   Art is holding the family Bible belonging to his\n\tGreat Grandfather, Alexander Mills;  displayed on the table is the\n\toriginal land grant under the authority of King George the Third ,\n\tdated September 12, 1818, granting 300 acres of land in what is now\n\tHardwic",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-109",
  "title": "Family Chronicle No. 109: Before",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n109\t\t\t\t\t\t\t\t          December 20, 2005\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nBefore\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\t\nAfter\n\t\n\n\n\t\n\n\t\nThe\n\ttop photo is a repeat of a photo from Chronicle No. 69 and shows\n\tCallister Hall, Scotland, where my Great Grandfather was born in\n\t1807.  The bottom photo, thanks to Joy Ayr, shows Callister Hall in\n\t2003.\n\t\nFollow-up\n\t\n\n\n\n\t\n\t\nDonald\n\tEdge wrote:\n\t\n\n\n\n\t\n\t\nYour\n\tchronicle of the Victoria Knitting Club reminded ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-110",
  "title": "Family Chronicle No. 110: Happy Birthday, Norm",
  "summary": "Family Chronicle biography of Norman Peters Glendenning (Don's brother), born 1925, including his RCEME service, role in family farming, and teaching Don to drive. Key family figure in Don's personal and professional life.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n110\t\t\t\t\t\t\t\t           December 31,2005\n\n____________________________________________________________________\n\n\n\tHappy Birthday, Norm\n\t\n\n\t\n\n\t\nNorman\n\tin front of apple tree in front yard\n\t\n\n\t\n\n\n\t\n\t\n\n\tNorman\n\tPeters Glendenning was\n\tborn on New Year’s Eve, 1925, however, when the birth was\n\tregistered, it was given as December 31, 1926.  Grandmother\n\tGlendenning was a Peters hence his second name.   According to\n\tLillian, Mum and Dad had difficulty deciding between the na",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-111",
  "title": "Family Chronicle No. 111: First school bus",
  "summary": "Family Chronicle Issue 111 (January 14, 2006): First school bus serving MRHS. Don recounts siblings Norm, Ken, and Elinor walking five miles daily to Bay du Vin rectory classes in early years. Details Godfrey Bros. school bus operation beginning fall 1940, including fleet specifications (Fargo chassis, khaki wartime color bus 1944, blue/white 2.5-ton 1947). Includes photo courtesy Myrtle (Dick) Allen.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n111\t\t\t\t\t\t\t\t\t  January 14, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\tFirst\n\tschool bus\n\t\n\n\t\n\n\t\n\n\tThe first school bus serving\n\tthe \n\t\n\t\n\n\tMiramichi Rural High School \n\t\n\t\n\n\t(Photo courtesy Myrtle (Dick)\n\tAllen\n\t\n\n\t\n\n\n\t\n\t\n\n\tSome\n\treaders will recall that the first high school classes in the area\n\twere held in the Anglican Rectory in Bay du Vin and later in the Bay\n\tdu Vin hall.  My siblings, Norm, Ken and Elinor actually walked",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-112",
  "title": "Family Chronicle No. 112: Venetia (Glendenning) Russell, Marjorie (Watling) Young, Edith (MacKenzie) Shickel, Mildred (MacNaug",
  "summary": "Family Chronicle Issue 112 (February 23, 2006): Profiles first cousins Venetia Glendenning Russell, Marjorie Watling Young, Edith MacKenzie Shickel, Mildred MacNaughton MacKay, Ruth MacNaughton Lewis at Glendenning family reunion. Discusses agricultural equipment terms and rural economic history. Explores family resemblances and relationships.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n112\t\t\t\t\t\t\t\t\t  February 23, 2006\n\n\n\tFirst\n\tCousins\n\n\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tVenetia\n\t(Glendenning) Russell, Marjorie (Watling) Young, Edith (MacKenzie)\n\tShickel, Mildred (MacNaughton) MacKay, Ruth (MaNaughton) Lewis\n\t(Photo taken at a Glendenning Reunion in Point Aux Carr – date not\n\tknown)  One might have guessed they were cousins  even if one did\n\tnot know.\n\t\n\n\t\n\n\n\t\n\t\n\n\tRiddles\n\tand flails\n\t\n\n\t\n\n\n\t\n\t\n\n\tI\n\twas reading about PEI manufacturers of early agricultural equipment\n\t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-113",
  "title": "Family Chronicle No. 113: ____________________________________________________________________\fKenneth Elmer Glendenning",
  "summary": "Family Chronicle biography of Kenneth Elmer Glendenning (Don's brother, 1924-), covering his scarlet fever, RCAF service during WWII, and family connections. Complements other sibling histories in Don's genealogical work.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.113\t\t\t\t\t\t\t\t\t\n February 12, 2005\n\n____________________________________________________________________\n\n\n\tKenneth Elmer Glendenning\n\t\n\n\n\t\nKen in\n\tfront yard\n\t\nKen\n\twas born on July 25, 1924 and attended the Little Branch School to\n\tthe end of Grade 8.  One year he stayed with Venetia and Cam in\n\tPoint Aux Carr, went to school, and did the chores while Cam fished\n\tsmelts.  He also attended classes in the Bay du Vin Hall and\n\tgraduated from MRHS\n\t\n\n\n\n\t\n\t\nIn\n\tOctober 1939, K",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-114",
  "title": "Family Chronicle No. 114: Covered Bridges on the Black River",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n114\t\t\t\t\t\t\t\t\t       March 4, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nCovered\n\tBridges on the Black River\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tLittle\n\tBranch Bridge taken from the North side (Glendenning Collection)\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tCameron\n\tBridge from south side (\n\t\n\n\tCourtesy\n\tof Francis MacNaughton)\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tVictoria\n\tBridge from East side\n\t\n\n\t(From\n\ta painting by Isobel Jenkins, courtesy of Richard MacDougall)\n\t\n\n\t\n\n\n\t\n\t\n",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-115",
  "title": "Family Chronicle No. 115: Taken from the Little Branch School register for the school year 1933-34",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n115\t\t\t\t\t\t\t\t\tMarch 21, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\n\t\n\n\tTaken from the Little Branch\n\tSchool register for the school year 1933-34\n\t\n\n\n\n\t\n\n\n\n\tFollow-up\n\t\n\n\n\n\t\n\t\nDonald\n\tEdge wrote: \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t“Our\n\ttelephone hung in a box on the wall, and by cranking a handle on one\n\tside of the box you made a continuous ring in every house in Black\n\tRiver. To differentiate homes, our phone was 22--two long and two\n\tshort cra",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-116",
  "title": "Family Chronicle No. 116: Planting potatoes in Black River probably in 1952.  From the left Margaret (Glendenning) Gibson, Joh",
  "summary": "Three interconnected essays. First: detailed recollection of potato planting techniques using horse-drawn machinery, featuring photograph of Glendenning family members (Margaret Gibson, John, Walter, Norman) circa 1952. Second: social history of women's aprons as multipurpose domestic garment and cultural marker, touching on his mother's daily routine and Aunt Janet. Third: brief tribute to William Roland Weeks, DFC, a local WWII fighter pilot from Loggieville who shot Field Marshal Rommel and earned the Distinguished Flying Cross for destroying 63 vehicles and 11 locomotives. Don's awareness of local wartime heroism enriches community context.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n116\t\t\t\t\t\t\t\t\t          April18, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\n\n\t\n\t\n\n\tPlanting\n\tpotatoes in Black River probably in 1952.  From the left Margaret\n\t(Glendenning) Gibson, John Glendenning, Walter Glendenning and\n\tNorman Glendenning.  I believe that the horses are King and June) \n\tAlthough taken in John’s field, homes of George and Mack Ggodfrey,\n\tthe Manse, John Godfrey and John Gibson can be seen in the distan",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-117",
  "title": "Family Chronicle No. 117: Undated photo of cattle judging show at Black River Community Hall",
  "summary": "Newsletter containing extended correspondence from Donald Edge providing Biblical and historical context for aprons (Genesis reference, aristocratic vs. working-class use). Second section recalls childhood memory of a red Indian rubber ball and \"gutta percha\" tires. Final brief section queries origins of Glendenning Brook in northern Maine—Don's genealogical interests extend to geographic toponymy. Demonstrates collaborative nature of the Family Chronicle and his methodical research approach.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n117\t\t\t\t\t\t\t\t\t         May 4,2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tUndated photo of cattle\n\tjudging show at Black River Community Hall\n\t\n\n\tThis the only photo I have\n\tseen of the Hall before the 1967 renovations.\n\t\n\n\t(Glendenning collection)\n\n\n\n\tFollow-up\n\t\n\n\n\n\t\n\t\nDonald\n\tEdge sent the following follow-up note about aprons:\n\t\n\n\n\n\t\n\t\n“Aprons\n\thave been around for a very long time.  Initially they were u",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-118",
  "title": "Family Chronicle No. 118: Donald Ernest Malcolm Glendenning",
  "summary": "Major autobiographical essay by Don covering his entire life trajectory: born September 8, 1929 at Little Branch; teacher training (1947), teaching posts at Middle Kouchibouguac and MRHS; PhD from Indiana University (1964); first President of Holland College (1969-1987); post-retirement educational consulting in Canada and Asia/Africa. Documents family (wife Carol from Peoria, Illinois; children Brian and Marie; granddaughters Lisa and Laura). Includes travel history (40+ countries), sabbaticals to Callister Hall in Scotland (ancestral home), and retirement interests: genealogy, travel, volunteer work, writing, and farming. Awarded Order of Canada (1986). Includes vivid childhood memories (wild berries, brook explorations, church by wagon, Chatham street cruising). Essential biographical reference.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n118\t\t\t\t\t\t\t\t\t            May 6, 2006\n\n____________________________________________________________________\n\n\n\tDonald Ernest Malcolm Glendenning\n\t\n\n\n\n\t\n\t\n\n\n\t\nDon with\n\tpups\n\t\nDon\n\twas born at Little Branch on September 8, 1929 and was baptized in\n\tthe new St. Paul’s Presbyterian Church in Black River on opening\n\tday, July 20, 1930.  Like the rest of the family, he attended the\n\tLittle Branch School; he also graduated from the Miramichi Rural\n\tHigh School.\n\t\n\n\n\n\t\n\t\nHe\n\tcom",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-119",
  "title": "Family Chronicle No. 119: From left: Undated photo of Margaret McDougall, Jennie MacLean, Lois Williston and Helen Harper take",
  "summary": "Family Chronicle Issue 119 (May 30, 2006): Don's personal memories of MRHS (1941-1946). Started with ~30 Grade 7 students; only 12 graduated. Describes siblings Ken and Norm at MRHS, school pranks (water cup trick, toilet beam chin-ups), teacher Perley Quayle and his Model A Coupe, student gardens with fall canning, Lowell Williston's wooden leg anecdote, blacksmithing workshop activities.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n119\t\t\t\t\t\t\t\t\t         May 30, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\t\nFrom\n\tleft: Undated photo of Margaret McDougall, Jennie MacLean, Lois\n\tWilliston and Helen Harper taken at Little Branch School. (Courtesy\n\tof Bertie MacLean)\n\t\n\n\n\n\t\n\t\nRemembering\n\tMRHS\n\t\n\n\n\n\t\n\t\n\n\tI believe that I started at\n\tMRHS in 1941 and graduated in 1946.  There were about 30 of us in\n\tGrade 7 but only 12 graduated (Grade 11 was the last year of high\n\tsch",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-120",
  "title": "Family Chronicle No. 120: Back row: Catherine MacDougall, George Watling, Don Glendenning, Mildred MacDonald, Frances MacLean",
  "summary": "Nostalgic survey of reading materials accessible during Don's childhood: mother's book exchange system; Bible and Presbyterian publications (Record, Message, Young People's meeting materials); Family Herald and Weekly Star (farming-oriented weekly with ads/cartoons); Chatham Gazette (local/war news); Junior Red Cross materials; peddler-sold goods and newspapers; Eaton's/Simpson's catalogues; school library limitations. Specific titles: Chums (large illustrated boys' magazine), \"Big Little Books\" (flip-animation format), Boy Scout books and airplane spotter guides. Reflects literacy culture of rural Maritimes and Don's formative intellectual exposure. Includes vivid memory of summertime sleeping outdoors under apple tree.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n120\t\t\t\t\t\t\t\t\t\tJuly 18, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nBack\n\trow: Catherine MacDougall, George Watling, Don Glendenning, Mildred\n\tMacDonald, Frances MacLean and Murray MacNaughton.  Front row: ?\n\tAdams, Kenneth MacDonald, Mabel MacLean and Cameron MacDonald taken\n\tat the Little Branch School in 1938.  (Photo courtesy of Bertie\n\tMacLean)\n\t\n\n\n\n\t\n\t\nReading\n\tmaterial\n\t\n\n\n\n\t\n\t\nWe\n\talways seemed to have reading materia",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-121",
  "title": "Family Chronicle No. 121: I had some of my slides scanned recently and came across the above photos of Fowlie’s mill probably",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n121\t\t\t\t\t\t\t\t\t\tJuly 19, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\n\t\nI\n\thad some of my slides scanned recently and came across the above\n\tphotos of Fowlie’s mill probably taken in the 1950’s. \n\t(Glendenning Collection)\n\t\n\n\n\n\t\n\t\nMeat\n\t\nWe\n\thad our own meat, especially in the winter.  We did not have\n\telectricity, hence no refrigeration although we did have an icehouse\n\tone year, so the ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-122",
  "title": "Family Chronicle No. 122: Vacation Bible Class at St. Stephens United Church; undated but probably 1953-1955. (Glendenning Col",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n122\t\t\t\t\t\t\t\t              October 27, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nVacation\n\tBible Class at St. Stephens United Church; undated but probably\n\t1953-1955. (Glendenning Collection)\n\n\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tShantymen\n\t\n\n\t\n\n\n\t\n\t\n\n\tShantymen\n\tvisited forestry workers and fishermen, and probably others such as\n\tsailors and trappers bring Christianity (or was it religion?) to\n\tfolk who lived in isolated areas.  I do not rec",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-123",
  "title": "Family Chronicle No. 123: The photo above, courtesy of Steven Chase, shows",
  "summary": "Two sections. First: technical description of flat sleds with iron-shoe runners; box sled cargo capacity (smelt hauling to Loggieville suppliers A&R Loggie and W.S. Loggie, 5 dollars for two horses/two men/two days); passenger comfort innovations (straw insulation, blankets, heated stones). Second: genealogical documentation of Black River WWI service, including photograph of George Adams and Archie Mills (son of John Alexander and Mary MacNaughton Mills, killed overseas at Nine Elms Military Cemetery, France). Notes Archie's relation to Aunt Kate (Mrs. James A. Watling). William A. Adams (1896-1977), son of George Adams and Jessie Finno, served in WWI, married Annie Pardon (England), emigrated to Moose Jaw, Saskatchewan post-1921. Don's interest in documenting community wartime sacrifice.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n123\t\t\t\t\t\t\t\t\tNovember 1, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tThe\n\tphoto above, courtesy of Steven Chase, shows\n\t\n\n\tWilliam\n\tWatling (1858-1924) \n\t\n\n\n\n\t\n\n\n\t\n\t\nAbove\n\tphoto\n\t\n\n\n\n\t\n\t\nThe\n\tabove photo shows a typical flat sled of the period drawn by one\n\thorse.  The sled runners were protected by an iron shoe.  \n\t\n\t\n\n\n\n\t\n\t\nA\n\tbox, 24 to 30 inches high, would be added to the sled when hauling\n\twood, smelts, or other go",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-124",
  "title": "Family Chronicle No. 124: From left to right: Eric Williston, Matt Kingston, Amanda Manuel (Glendenning Family), Emma MacDonal",
  "summary": "Announcement of second $200 grant from Glendenning Fund to Miramichi Rural School for library books (students pictured selecting volumes). Identifies student recipients: Eric Williston (grandson of David & Catherine Williston), Matt Kingston, Amanda Manuel (Glendenning granddaughter), Emma MacDonald, Sarah Duffy. Demonstrates Don's philanthropic commitment to his alma mater. Miscellaneous notes: Annie F.M. Ellis taught Little Branch School (1924-25); Sir Walter Scott's \"The Abbot\" features character Edward Glendinning; Ellis Island research locates Aunt Louise arriving 1919 from Peru, Uncle Chip 1920, Uncle Guy 1915 from Portland (dental training, later military enlistment). Lowell Williston amputation notice from Chatham Gazette (1934). Reflects Don's genealogical methodology and archival research.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n\t124\t\t\t\t\t\t\t\t         November 5, 2006\n\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\nFrom\n\tleft to right: Eric Williston, Matt Kingston, Amanda Manuel\n\t(Glendenning Family), Emma MacDonald, Sarah Duffy and Andrew Clark,\n\tPrincipal.  Photo by Daria Fallon\n\n\n\n\t\n\n\n\t\n\t\nBook Grant to Miramichi Rural\n\tSchool\n\t\n\n\n\n\t\n\t\nA\n\tsecond grant in the amount of $200 was made from the Glendenning\n\tFund to the Miramichi Rural School for th",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-125",
  "title": "Family Chronicle No. 125: Harley Painting",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t125\t\t\t\t\t\t\t\t\t  December 3, 2006\n\n____________________________________________________________________\n\n\n\tHarley\n\tPainting\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe painting is described as\n\tfollows:\n\t\n\n\t\n\n\n\t\n\t\n\n\t“I thought you might\n\tlike to see this photo of an oil painting that I have. It is I\n\tbelieve of Beaubair Island on the Mirimachi River. It is painted by\n\ta Burchill. John Harley and George Burchill went into partnership in\n\t1849 and worked together until 1857 when Burchill",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-126",
  "title": "Family Chronicle No. 126: St. Stephen’s Presbyterian (Now United) Church Choir Group of 1909",
  "summary": "Historical photograph of 1909 St. Stephen's Presbyterian Choir (25 individuals identified, including Watling and MacNaughton family members; photographer Ernest MacLean). Extensive personal essay by Donald Edge (\"Faith of our Fathers\") describing childhood religious experience: mandatory Sunday attendance (aisle 14), hymn singing (\"Onward Christian Soldiers,\" \"Old Rugged Cross\"), summer Sunday school, Bible verse memorization, hand pump organ music. Details cultural significance of shoes (worn only weekends/church), cemetery visits overlooking Black River with familiar gravesites and erosion concerns. Addresses church schism (\"governance problem\") and Protestant denominational diversity. Concludes with poignant retrospective: \"postcard winters and endless golden summers\" and \"people I loved then as I love them now.\" Deep community and family religious history; demonstrates Don's editorial role curating contributor memories.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t126\t\t\t\t\t\t\t\t\tDecember 5, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tSt. Stephen’s Presbyterian (Now United) Church Choir Group of\n\t1909 \n\t\n\t\n\n\tBack Row: John E. MacLean, Will Allen, Rev. Woods from Chatham,\n\tJohn W. Mick, Ernest Watling, \n\nRev. G. A. Grant, Mrs. G. A.\n\tGrant, Nellie I. M. MacKay, A. Dick Watling, Donald MacLean and S.\n\tA. Godfrey\n\t\n\n\tSecond Row: Robert Godfrey, Emily Watling, Marjorie MacKay, Edith\n\tMac",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-127",
  "title": "Family Chronicle No. 127: Photo (in front of Herb (later Edgar) Fowlie home in Little Branch) of the wedding of Laura Fowlie a",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t127\t\t\t\t\t\t\t\t           December 12, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\t\n\n\tPhoto\n\t(in front of Herb (later Edgar) Fowlie home in Little Branch) of the\n\twedding of Laura Fowlie and Clem Dickson courtesy of Ernest MacLean\n\t\nFrom\n\tleft in vertical rows:\t\n\t\nRow\n\t1: 1-    2-\t  3-\t4-  \n\t\n\t\nRow\n\t2: 1-    2-    3-      4-Donald MacLean\n\t\nRow\n\t3:  \n\t\n\t\nRow\n\t4:  Addison Fowlie (Child)\t\n\t\nRow\n\t5:\t1-\t2- Herb Fowlie with hat  3-\t\t4-\t5- H",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-128",
  "title": "Family Chronicle No. 128: Black River photos courtesy Ernie MacLean",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t128\t\t\t\t\t\t\t        December 20, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nBlack\n\tRiver photos courtesy Ernie MacLean\n\t\n\n\n\t\n\n\n\n\t\n\t\nAutomobile\n\towned by Mr. F. A. Fowlie of Little Branch\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tCrew on dredge owned by Mr. Fred A. Fowlie\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tSnowmobile owned by Dr. J. B. MacKenzie\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\nFirst\n\tauto in Black River\n\t\n\n\n\n\t\n\t\nMr.\n\tFred. A. Fowlie of Little Branch had the first auto ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-129",
  "title": "Family Chronicle No. 129: Pigtails, etc",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t129\t\t\t\t\t\t\t\t\tJanuary 15, 2006\n\n____________________________________________________________________\n\n\n\tPigtails,\n\tetc\n\t\n\n\t\n\n\t\nI\n\tam at the “clean-up” stage of life and came across some of my\n\tearly handiwork.  I am sure that many readers could do the same.\n\t\n\n\n\n\t\n\t\nSometime\n\tbetween September 1949 and June 1951 I learned to twist and solder\n\tpigtails; I forgot all about it until I came across a soldering pot\n\tamong my mementos. The above photo shows the soldering pot wi",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-130",
  "title": "Family Chronicle No. 130: The remnants of A&R Loggie’s Sawmill in Loggieville, NB",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t130\t\t\t\t\t\t\t                        January 17, 2006\n\n____________________________________________________________________\n\n\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tremnants of A&R Loggie’s Sawmill in Loggieville, NB\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\n\n\tA&R\n\tLoggie’s Mill\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe\n\tA&R Loggie Co. was incorporated in 1881 at Black Brook, later\n\trenamed Loggieville.  As I recall, Aunt Tine said that Andrew\n\tLoggie, the oldest had started by peddling goods from door to door. \n\t\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tThey\n\twe",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-131",
  "title": "Family Chronicle No. 131: Case tractors at the show at",
  "summary": "Three thematic sections. First: Argyle Shore (PEI) annual farm tractor show featuring 100+ working machines (no pre-WWII vintage). Second: lyrical personal essay on transparent apples—semi-ripe pale green fruit from lone orchard tree (MacNaughton property), crispness and tartness superior to fully ripe white specimens, bounty exceeded Don's consumption, fallen fruit worthless. Plea to readers to locate similar trees (will travel by July for taste). Third: historical note on \"turnpiking\" (grandfather Glendenning turnpiked Canobie-Springfield road); internet sources conflate toll-collecting with road-making. Wages and costs in 1915 (Fighting 26th Battalion, CEF): Warrant Officer $2.50/day, Sergeant $1.50, Corporal $1.20, Private $1.10; soldiers could assign 80% pay to relatives; bread 5¢/lb, beef 13¢/lb, mutton 15¢/lb; no income tax. Funeral customs history: home wakes, two-day visitations (now reduced), neighbor assistance, purple banner at door, winter transport by sled, brief eulogies (sermons dominant), hand-dug graves, sandy Black River Cemetery soil facilitated winter burial. Rich social history and personal memoir.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t131\t\t\t\t\t\t\t\t\tFebruary 10, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tCase tractors at the show at\n\t\n\n\tArgyle Shore, PEI\n\t\n\n\n\n\t\n\t\nFolks\n\talong the Argyle shore in PEI  put on an annual farm tractor show; I\n\twent this year for the first time.  There were over 100 working farm\n\ttractors on display. The above shows a row of Cockshutt tractors but\n\tthere were many other makes as well.  None of the tractors were\n\tpre-WW2 vinta",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-132",
  "title": "Family Chronicle No. 132: Photos Wanted",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t132\t\t\t\t\t\t\t\t\tFebruary 14, 2006\n\n____________________________________________________________________\n\n\n\tPhotos\n\tWanted\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\n\n\t\n\t\n\n\tThe\n\tabove photos were taken at the Museum \n\t\n\t\n\n\tat\n\tthe Napan Agricultural Fair grounds\n\t\n\n\n\n\t\n\t\nI’m\n\tlooking for photographs of wagons, sleds, mowers, rakes and other\n\tfarm equipment of the first half of the century.  They are hard to\n\tcome by.  I even had a lady from Minnesota write me asking if I had\n\tany photos of b",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-133",
  "title": "Family Chronicle No. 133: Little Branch School, 1929",
  "summary": "Multiple sections. Photographs: Little Branch School (1929) and Cameron School (1933) by teacher Annie May Loggie (courtesy Della Adams O'Neill). Genealogy project announcement: Don has compiled 60+ years of family research (both paternal and maternal sides) and completed publication; intends to present copy to Chatham Library upon next Miramichi visit. Whittling essay (by Donald Edge): father was accomplished whittler; Edge possesses three sharp pocketknives and lidless gum box (book-shaped, bearing initials JME, held hardened spruce resin/gum). Men carried \"Barlow\" pocket knives for tobacco, twine-cutting, apple-peeling, mumblety-peg. Black River whittling culture reduced sticks to toothpicks under Protestant work ethic. Doreen (Glendenning) Nicol contributed: 1930s-1970s automobile features (fender skirts, running boards, Continental kits, dyna-flow transmissions, rumble seats, curb feelers, manual cranks, side-mounted tires, non-permanent antifreeze, hydraulic brakes, tire repairs). Early Black River vehicles: Gordon Adams first red car, Jessie Adams roadster, Alex MacDonald's Oakland, Model A power tools, spring trucks post-fishing season. Technological innovations: gravity-fed gas tanks, vacuum wipers, lift-up hood panels, aftermarket direction signals (Don's 1952 Dodge with Canadian Tire signals), A&R Loggie Goderson trucks, Arnie Watling's post-war red Chevrolet mail truck. Comprehensive material culture and automotive history. Significant family/biographical content and documentation of Don's long genealogical work.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n133\t\t\t\t\t\t\t\t\tFebruary 28, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tLittle Branch School, 1929\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tCameron School 1933\n\t\n\n\t\n\n\n\t\n\t\n\n\tAbove Photos\n\t\n\n\t\n\n\n\t\n\t\n\n\tI am grateful to Della\n\t(Adams) O’Neill for sharing the above photos taken by the teacher\n\tof the time, Annie May Loggie.\n\t\n\n\t\n\n\n\t\n\t\n\n\tGlendenning Family\n\tMemories\n\t\n\n\t\n\n\n\t\n\t\n\n\tAs some of you know, I have\n\tbeen gathering information about my family, b",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-134",
  "title": "Family Chronicle No. 134: My Great Grandmother was Margaret Harley; her sister, Mary Ann Harley was interviewed by a newspaper",
  "summary": "Don publishes an extended newspaper interview (dated 99th birthday, 1898) featuring his great-aunt Mary Ann Harley Henry, who emigrated from Ireland to the Miramichi region in 1822. Her vivid account covers living through the Napoleonic Wars, the arrival of the first steamship in Irish waters (1822), the harrowing 7-week transatlantic voyage to Pockshaw (Bay of Chaleur), and a 75-mile wilderness trek through uncut forest to Newcastle. She married John Henry and had nine children; lived 99 years (1799-1898). Don includes scholarly follow-up from cousin Kelsie Erskine exploring the family's motivations for emigration and their Irish social standing during this period. Rich ancestral context for the Glendenning family's Miramichi roots.",
  "content_preview": "The Family Chronicle\n\nNo. 134\t\t\t\t\t\t\t\t\t      March 5, 2006\n\n____________________________________________________________________\n\n\n\nMy Great Grandmother was Margaret Harley; her sister, Mary Ann Harley was interviewed by a newspaper in Portland, Maine on her 99th birthday.  The following is a direct quote from that article.  I thought that I had published this earlier but on checking my Chronicles, I cannot find it so I am including it here\n\n\n\n\n‘I was born in Courtmasherry, Ireland, February 6, 1",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-135",
  "title": "Family Chronicle No. 135: Little Branch School in 1929",
  "summary": "Don reflects on his own education trajectory. Features photographs of Little Branch School (1929) and Cameron School (1933) showing buildings from his childhood. Describes attending a six-month Teachers' College training program in Fredericton (June 1947) at age 17, graduating with credentials listed. Shortly thereafter (September 1947, still age 17) he began teaching at Middle District of Kouchibouguac—a formative professional beginning in education. Lists his Teachers' College instructors and church records from 1910 St. Stephen's Church. Demonstrates Don's early entry into the profession that defined his career.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n135\t\t\t\t\t\t\t\t\t    March 12, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tLittle Branch School in 1929\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tCameron School in 1933\n\t\n\n\t\n\n\n\t\n\t\n\n\tAbove Photos\n\t\n\n\t\n\n\n\t\n\t\n\n\tAgain, I am indebted to Della\n\t(Adams) O’Neill for sharing the above photos taken by the teacher\n\tof the time, Annie May Loggie.\n\t\n\n\n\n\t\n\t\nThese,\n\tthe earliest photos that I have seen so far, are unique in that",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-136",
  "title": "Family Chronicle No. 136: Thanks to Della (Adams) O’Neil for the photo of her father, Tom Adams, holding his daughter, Doris.",
  "summary": "Don recalls school-era memories and historical minutiae. Includes a 1943-44 photo of Tom Adams with his daughter Doris and their school bus (likely a modified Ford)—Tom later received a plaque for 40 accident-free years of driving. Don rode the bus back to Little Branch while teaching at Miramichi Rural High School. Also discusses pre-digital writing technologies: ink blotters, fountain pens, ink bottles, slates, and the transition from slate to paper in early schooling. Includes church records from St. Stephen's (1913) and a newspaper obituary of his Great Grandmother Margaret Glendenning (age 92, 1913), who died in Canobie.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n136\t\t\t\t\t\t\t\t\t    March 20, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\nThanks\n\tto Della (Adams) O’Neil for the photo of her father, Tom Adams,\n\tholding his daughter, Doris.  \n\t\n\t\n\n\n\n\t\n\t\nAdams\n\tSchool bus\n\t\n\n\n\n\t\n\t\nAlthough\n\tthe photo is undated, we think that it was taken about 1943-44.  It\n\tis likely a Ford vehicle and Della thinks that her father purchased\n\tthe chassis and constructed some of the body – likely the in",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-137",
  "title": "Family Chronicle No. 137: Hampton, Virginia",
  "summary": "Don and Carol visited Hampton, Virginia, where Don's father worked as a civilian supervisor on Langley Field construction during WWI (1917-1918). Don's parents (Grace and Walter) and siblings (Venetia, Lillian) lived on the base; their daughter Margaret is buried in St. John's Episcopal Cemetery. Describes the establishment of NACA's Hampton site: 1,660 acres purchased in 1916, cleared and constructed by J. G. White Engineering Corporation (carpenters earned $7/day). Don's father held an identification badge and received a thank-you letter from the U.S. Department of Defense. His sisters kept passes to Langley Field—a significant window into Don's father's wartime contributions. Includes vital statistics from St. Stephen's Church records (1910, 1913, 1915, 1922).",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n137\t\t\t\t\t\t\t\t\t     April 20, 2006\n\n____________________________________________________________________\n\n\n\tHampton,\n\tVirginia\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\n\n\t\n\t\nRecently\n\tCarol and I spent a week in Virginia and, while there, visited\n\tHampton where my father and mother lived in 1918.  (Their daughter,\n\tMargaret is buried in St. John’s Episcopal Cemetery).\n\t\n\n\n\n\t\n\t\nIn\n\t1915, the US set up a National Advisory Committee for Aeronautics\n\tand on December 5, 1916 the Secretary of War approv",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-138",
  "title": "Family Chronicle No. 138: St. Stephen’s Statistics - 1922",
  "summary": "Don recalls music programs at MRHS where Miss MacMillan led students in song (\"Grandfather's Clock,\" \"Don't Fence Me In,\" \"Anchors Aweigh,\" etc.). Also features a philosophical reflection Don used repeatedly in graduation speeches (1954-1955 era): \"Life is A Building\"—comparing education to constructing an edifice, where every lesson and experience adds to personal growth. Don notes his shop teaching at MRHS (after completing 2-year technical institute program in 1951); shares his 1951-52 shop budget itemizing lumber, hardware, drafting equipment, and electrical supplies ($320 total). Church statistics from St. Stephen's (1922) included. Shows Don's pedagogical philosophy and evolution as an educator.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n138\t\t\t\t\t\t\t\t\t      April 29, 2006\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nSt.\n\tStephen’s Statistics - 1922\n\t\n\n\t\n\n\t\n\n\tMusic at MRHS\n\t\n\n\t\n\n\n\t\n\t\n\n\tAmong my papers, I came\n\tacross a couple of scribblers.  One had Christmas poems which, as I\n\trecall, I had my sister Elinor copy for me so I would have them for\n\tschool closings.\n\t\n\n\t\n\n\n\t\n\t\n\n\tAnother had some of the songs\n\twe sang at MRHS.  Miss MacMillan, as I recall, taught music and we\n",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-139",
  "title": "Family Chronicle No. 139: National Registration 1940-1946",
  "summary": "Primarily informational. Explains National Registration certificates (1940-1946) required during WWII, listing all data Canada collected on civilians. Includes an actual National Registration Certificate from Don's wife, Jane Elizabeth (Watling) Glendenning. Also covers United Empire Loyalists' arrival in New Brunswick with ration allowances and supplies; reader Donald Edge's note on early automobiles and tire repair kits; and Canadian wartime rationing (1942+) with ration books for tea, coffee, sugar, butter, gasoline. Don recalls scrap drives at Little Branch School. Provides context for the era in which Don lived as a young man.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n139\t\t\t\t\t\t\t\t\t\t May 9, 2007\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\nNational\n\tRegistration 1940-1946\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tNational Registration\n\tCertificate of \n\t\n\t\n\n\tJane Elizabeth (Watling)\n\tGlendenning\n\t\n\n\tDuring\n\tthe period 1940-46, all adults over 16 in Canada, except for people\n\tin the military, members of religious orders and people in\n\tinstitutions, had to register.  Registration was under the War\n\tMeasures Act and was to permit",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-140",
  "title": "Family Chronicle No. 140: Some “Oldies” from My School Days",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 140\t\t\t\t\t\t\t\t\t       May 16, 2007\n\n____________________________________________________________________\n\n \n\nSome “Oldies” from My School Days\n\n\n\n\nRecently I came across some papers that both speak to my age and the extent of my reputation as a pack rat.\n\n\n\n\nThe first item is the program for Christmas, 1947, my first school, a one-room school in Middle Kouchibouguac, NB.   \n\n\n\n\nProgramme\n\nA Greeting-\t\t\tVera\n\nThe Christmas Tree – \tArthur\n\nJust before Christmas – Ivan\n\nWinni",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-141",
  "title": "Family Chronicle No. 141: Smelt Fishing",
  "summary": "Detailed first-person account of winter smelt fishing on the Miramichi (ca. 1950 photo shows Bill Taylor, Eldred and Cameron Russell). Don explains the technical operation of box nets, leaders, ice holes, toggle sticks, and the demanding work of hauling nets twice daily at tide changes. Describes the loading, freezing, and transport of smelts by sleigh. Names buyers including Uncle Jim Watling (buyer for W.S. Loggie Company, Chatham) and A & R Loggie Company (Loggieville). Explains how fishermen stayed on the ice all week with horses and shanties. Notes the practice of dropping nets to the riverbed during ice runs. This is a colorful portrait of Miramichi working life and local family connections (Watling family involvement).",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n141\t\t\t\t\t\t\t\t\t       May 26, 2007\n\n____________________________________________________________________\n\n\n\tSmelt\n\tFishing\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nAbove\n\twe see Bill Taylor (standing) with Eldred and Cameron Russell\n\ttending their fishing nets off the Point Aux Carr shore.  The exact\n\tyear is unknown, however, it would be around 1950. Although my\n\tfamily did not fish, here is my under- standing of how winter smelt\n\tfishing with box nets worked.\n\t\n\n\t\n\n\n\t\n\t\n\n\tSmelt f",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-142",
  "title": "Family Chronicle No. 142: More fish (and some fish stories)",
  "summary": "Personal recollections of Don's fishing experiences (with photos of his catches, 2-3 lb fish from the front yard). Discusses grain milling byproducts (bran, shorts, middlings) and his family's use of wheat milled at the \"Monks\" (Rogersville) and Robin Hood flour. Explains feed mixtures for livestock. Notes a humorous account of \"slipgut\" porridge. Discusses flour bags repurposed into clothing after bleaching. Also features Don's 1947 photo from his first teaching position at Middle Kouchibouguac with ~21 students in Grades 1-8 plus 3 correspondence students. Personal domestic and professional snapshot of post-war rural life.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n142\t\t\t\t\t\t\t\t\t\t      , 2007\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\n\n\n\t \n\t\nMore\n\tfish (and some fish stories)\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\t\nFish\n\tare elusive.  The above show some of my catches.  As I recall, most\n\tof the above would be between 2 and 3 pounds.  Unfortunately, I\n\tcannot find photos of the really large ones.  If I do come across\n\tthem, I will include them in later issues of the Chronicle.\n\t\n\n\n\n\t\n\t\nReaders\n\tmay realize that the lower photo is reversed.  It was taken in the\n\tfront yard a",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-143",
  "title": "Family Chronicle No. 143: Some nephews and nieces taken at Little Branch presumably at a Mother’s Day gathering",
  "summary": "Follow-up to smelt fishing article with reader correspondence (Glenn Russell, Arthur Mills). References a Mother's Day gathering photo at Little Branch showing Don's nephews and nieces. Discusses winter boots (gum boots and rubber boots), their ineffectiveness against cold, and a community tradition of \"Gumboot Day\" competitions. Describes school outhouse etiquette (raising one/two fingers to request permission). Includes period expressions (\"slow as cold molasses,\" \"see a man about a horse,\" \"the makins\" for hand-rolled cigarettes). Nostalgic, folklore-oriented content capturing mid-20th century social habits and vernacular.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n143\t\t\t\t\t\t\t\t\t        July 25, 2007\n\n____________________________________________________________________\n\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tSome nephews and nieces taken at\n\tLittle Branch presumably at a Mother’s Day gathering\n\t\n\n\t\n\n\n\t\n\t\nFollow-up\n\tto smelt fishing\n\t\n\n\n\n\t\n\t\nGlenn\n\tRussell tells me that bag nets were fished on both tides but box\n\tnets did not have to be fished as often.  Glenn also said that\n\tfishermen had a devise that rested on the bottom with a string to a\n\t“bell",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-144",
  "title": "Family Chronicle No. 144: 50 Year Reunion",
  "summary": "Celebrates the 50-year reunion of the MRHS graduating class of 1957 with a photo and attendee names (Lola Jenkins Miller, Elizabeth Williston Belyea, William Godfrey, etc.). Implies Don's continued connection to the school and students decades after his tenure. Includes anecdotes about logging terminology from an Miramichi lumbering book (widow-maker, two-sled, etc.). Features a personal reflection on red ochre paint stored in a barn workshop—a cheap farm paint mixed with linseed oil used for rural buildings. Describes the wagons shed at Don's family farm, the Model A stored during the Depression, and tools for farm equipment repair. Provides material culture context for rural life during Don's childhood/young adulthood.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n144\t\t\t\t\t\t\t\t          September 30, 2007\n\n\n\t\n\n\n\t\n\t\n\n\t50 Year Reunion\n\t\n\n\n\t\n\n\t\n\n\t\n\n\tSeated\n\tin the above photo from left to right are: Lola (Jenkins) Miller,\n\tElizabeth (Williston) Belyea, William Godfrey, Sylvia (Mc Lenaghan)\n\tBrennan, Glen Russell, Blanche (Mac Donald) Fowlie, Verona (Taylor)\n\tLloyd, and Betty (Williston) MacEwan.  Absent from the photo is Joan\n\t(Gulliver) Weaver.\n\t\n\n\t\n\n\n\t\n\t\n\n\tCongratulations\n\tto the graduating class of 1957 from the Miramichi Rural Hi",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-145",
  "title": "Family Chronicle No. 145",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n145\t\t\t\t\t\t\t\t\tOctober 21, 2007\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\tSome Farm Machinery\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tThe top photo is of a Massey\n\tHarris grain binder owned by Bernard Keefe, Cherry Valley, PEI.  The\n\tage is not known but I believe it to be manufactured in the 1930s or\n\teven earlier.  The binder includes a set of canvasses but they are\n\tbeing kept in dry stora",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-146",
  "title": "Family Chronicle No. 146: A view of Black River from space",
  "summary": "Don draws on Arnold J. Somers' memoir of 1920s-1940s Miramichi lumbering. Includes period wage data ($1.50/day in 1939-40), production figures (3.5-5,000 board feet per crew daily), and social history (poll taxes, road taxes, \"statute labour,\" poor houses in Chatham). Reflects on haywire as the \"duct tape of my era\" for farm repairs. Reader Donald Edge contributes etymology of local island names (Fox Island = \"Île au Pendu,\" Bay du Vin = \"Baie des Ovines\"). Discusses chimney fires and creosote buildup—practical knowledge from Don's adult housekeeping. Links Don's personal experience to broader regional economic and social history of the Depression and post-war era.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n146\t\t\t\t\t\t\t\t\t November 5, 2007\n\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tA view of Black River from\n\tspace\n\n\n\n\tMiramichi Lumberman\n\t\n\n\t\n\n\n\t\n\t\n\n\tI am indebted to Art Mills\n\tfor the loan of a book by Arnold J. Somers (1994) about his\n\texperiences as a lumberman on the Miramichi.  (Somers’ experiences\n\tnot Arthur’s’)  The book rings with memories of peavies, log\n\tjams, biscuits, buns, beans, spruce, hemlock, sawmills and\n\tginge",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-147",
  "title": "Family Chronicle No. 147: I am drafting this newsletter on November 11.  It seems appropriate,",
  "summary": "Personal memoir of southernwood plants (admired by local Alex Newton), mystery regarding a Baptist Church in Black River (possibly on present St. Paul's Presbyterian site or across the road), and legends of graves behind the church. Includes genealogical explanation of \"once removed\" kinship (Danny Glendenning is first cousin once removed; Uncle Harry Glendenning joke about \"49th cousins\"). Includes reader feedback from Art Mills about school bus driver Clifford Adams's patience with noisy students and an anecdote about Mills reading sports books instead of schoolwork. Quotes Chatham Gazette (1932) on a Dominion Department of Agriculture experimental farm at Walter Cameron's, Black River Bridge under T. G. Hetherington's supervision. Blends personal memory, family history, and local archive.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n147\t\t\t\t\t\t\t\t\tDecember 9, 2007\n\n____________________________________________________________________\n\n\n\n\t\n\n\t\n\n\t I am drafting this\n\tnewsletter on November 11.  It seems appropriate, \n\t\n\t\n\n\ttherefore, to include a photo\n\tof this memorial at the Black River Cemetery\n\n\n\n\tSouthernwood\n\t\n\n\n\n\t\n\t\nIn\n\tpreparation for winter, I was doing some yard work including cutting\n\tback my southernwood at the corner of the house.  It reminded me of\n\ta similar bush in front of my home at Litt",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-148",
  "title": "Family Chronicle No. 148: Black River Households",
  "summary": "Comprehensive census-like listing of Black River households in 1939, updated and expanded from Newsletter 61. Lists neighbors by location (Little Branch Bridge, bridges, schools, churches, community hall) with family names and some occupations. Over 100 households documented, including Watlings, Fowlies, MacDonalds, Camerons, Gibsons, and others. Compiled with assistance from Harold MacLean, Jack Wilson, Don Edge, and George Watling. Don notes anomalies in naming conventions (single Kelly home vs. multiple Watling households). Explicitly solicits reader corrections and additions to build a complete, accurate census. A valuable genealogical artifact and community history snapshot of Don's childhood neighborhood.",
  "content_preview": "The Family Chronicle\n\nNo. 148\t\t\t\t\t\t\t\t\tJanuary 1, 2008\n\n____________________________________________________________________\n\n Black River Households\n\n\n\n\nThis Family Chronicle updates and extends my list of neighbours living in Black River in 1939.  (Newsletter No. 61).  The list arose out of a conversation with brothers Kenneth and Norman while on a visit to the Miramichi.  The list was expanded thanks to the assistance of a number of people including Harold MacLean, Jack Wilson, Don Edge and Ge",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-149",
  "title": "Family Chronicle No. 149: MRHS 1954-1955",
  "summary": "Publishes a 1954-1955 Miramichi Rural High School yearbook with Grade 12-10 graduate and student lists, including names like Jean Gregan, Lois Williston, Claude Kingston, Doreen MacRae, Teddy Fowlie, and many others. Grades 9, 8, and 7 also documented. Don notes finding the yearbook and photos during personal archive review. Demonstrates his direct involvement with the school and contemporary student cohorts; provides genealogical reference for local families of that era. The yearbook is a historical artifact capturing MRHS at a particular moment and confirming Don's institutional presence during that period.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n149\t\t\t\t\t\t\t\t\t    January 13, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\tMRHS 1954-1955 \n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\nI\n\twas delighted to come across a 1954-1955 yearbook and some photos\n\tfrom the Miramichi Rural High School among my belongings.  Some\n\titems are included in this yearbook but others will follow in future\n\tissues. \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tMRHS Grade 12 Graduates 1954-1955\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tDoris Fraser\n\t\n\n\t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-150",
  "title": "Family Chronicle No. 150: John Glendenning on tractor with Karen and Karla Weeks in white sweaters and John and Charles Coppla",
  "summary": "Don publishes a reader's letter from Barry Mackenzie about family history and local folklore, including stories about Big Bob MacLean and a photo of the 1954-1955 MRHS instructional staff with Don identified as \"decapitated person on the right.\" The issue also contains Don's genealogical research on William John Glendenning, his father's first cousin who died in California in 1897, and information about A.W. MacDougall's 1935 book on Black River history. Don positions himself as documenting his family's roots and community heritage.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n150\t\t\t\t\t\t\t\t\tJanuary 20, 2008\n\n____________________________________________________________________\n\n\n\t \n\t\n\n\t\nJohn\n\tGlendenning on tractor with Karen and Karla Weeks in white sweaters\n\tand John and Charles Coppla – courtesy John Weeks; not sure of\n\tfifth person (1968)\n\t\n\n\n\n\t\n\t\nBarry\n\tMackenzie wrote:\n\t\n\n\n\n\t\n\t\nI\n\tcheck your website regularly, and am always excited to see a new\n\tChronicle. I was interested in your note on the Baptist Church. I,\n\ttoo, have heard of such a p",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-151",
  "title": "Family Chronicle No. 151: Mary Ann (Harley) Henry 1799-1898 (Centre) with family\u2028\fHarley Notes",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n151\t\t\t\t\t\t\t\t\tJanuary 27, 2008\n\n____________________________________________________________________\n\n\n\n\t\n\n\t\n\n\tMary\n\tAnn (Harley) Henry 1799-1898 (Centre) with family\n\n\n\n\n\t\n\n\n\n\tHarley Notes\n\t\n\n\tMy Great Grandmother on my\n\tfather’s side of the family was a Harley, daughter of William and\n\tAnn (Bidders) Harley. William was born in Worcester, England about\n\t1750 and died in Courtmacsherry, County Cork, Ireland about 1830. \n\tHe was a school teacher.  His wife, Ann Bidders, wa",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-152",
  "title": "Family Chronicle No. 152: As I pointed out in the last Newsletter, William Harley, 1796-1838, came to Canada in 1820 and was a",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 152\t\t\t\t\t\t\t\t\t  February 2, 2008\n\n____________________________________________________________________\n\n As I pointed out in the last Newsletter, William Harley, 1796-1838, came to Canada in 1820 and was a surveyor.  After 10 years, he decided to leave New Brunswick for “greener pastures”.  In 1930, he traveled to Ontario to scout opportunities there.  Thanks to Heather Hess, a direct descendent of William Harley; I am reprinting a letter from William Harley written to hi",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-153",
  "title": "Family Chronicle No. 153: BLACK RIVER VETERANS OF WW1",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.153\t\t\t\t\t\t\t\t\n             February, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\t\n\n\t\n\n\t\n\n\t\n\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tBLACK RIVER VETERANS OF\n\tWW1\n\t\n\n\t\n\n\n\t\n\t\n\n\tForty six young men from\n\tBlack River volunteered for overseas duty during WW1; five did not\n\treturn.  (Thanks to Cameron MacDonald for this list.)\n\t\n\n\t\n\n\n\t\n\t\n\n\tGnr. Stephen John Dick,\n\t#522059, son of Alexander and Selina (Weaver) Dick, January 18,\n\t1895-October 1, 1918, 1st\n\tBri",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-154",
  "title": "Family Chronicle No. 154: Believed to be the school where my Great Great Grandfather, William Harley, taught in Courtmacsherry",
  "summary": "Family Chronicle issue on Miramichi Glendinnings from 1911 census and Don's uncle Frank's work at US Nitrate plants in Alabama (1900), potentially connecting to Don's father's career. Traces family dispersal and employment history.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t154\t\t\t\t\t\t\t\t\t      March 20, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tBelieved\n\tto be the school where my Great Great Grandfather, William Harley,\n\ttaught in Courtmacsherry, County Cork, Ireland (Courtesy of Cousin\n\tKelsie Erskine)\n\t\n\n\t\n\n\n\t\n\t\n\n\tMiramichi\n\tGlendennings\n\t\n\n\t \n\t\n\n\tThanks\n\tto Irma Downing for the following information taken from the 1911\n\tcensus of the Miramichi:\n\t\n\n\t\n\n\n\t\n\t\n\n\tGlendinning,\n\tWilliam   M Head",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-155",
  "title": "Family Chronicle No. 155: THE WATLING FAMILY (An Update)",
  "summary": "Comprehensive Family Chronicle tracing Watling family origins from Vikings/Normans to Black River settlement, documenting genealogical research spanning centuries. Addresses family name etymology and migration patterns central to Don's heritage.",
  "content_preview": "The Family Chronicle\n\nNo. 155\t\t\t\t\t\t\t\t\tMarch 25, 2008\n\n____________________________________________________________________\n\nTHE WATLING FAMILY (An Update)\n\n\n\n\nOrigin of Watling Name\n\n\n\n\nIt is thought that the Watlings were Vikings who landed in Northern Scotland in 870 AD, invaded northern France in 910 AD and then came to England with William the Conqueror in 1066.  The name is found in the Domesday Book which was a census taken in England in 1086. The first record of the name Watling was found",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-156",
  "title": "Family Chronicle No. 156: Editor’s Note: This is the second of three Newsletters dealing primarily with my Watling roots; some",
  "summary": "Family Chronicle documenting Jubal and Susanna Watling, ancestors of Don's mother, with 1841 PEI census data establishing the family's arrival in Maritime Canada. Traces maternal genealogy and settlement patterns.",
  "content_preview": "The Family Chronicle\n\nNo. 156\t\t\t\t\t\t\t\t\tMarch 28, 2008\n\n____________________________________________________________________\n\n\n\nEditor’s Note: This is the second of three Newsletters dealing primarily with my Watling roots; some of the information is a repeat but some is also new.\n\n\n\n\n Jubal and Susanna (Leach) Watling\n\n\n\n\nTess Barker, Watling Genealogy Group, reports finding \"Metfield marriage: Jubal Watling singleman of Brockdish, Norfolk and Susan Leech, singlewoman, of this parish by banns, 10",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-157",
  "title": "Family Chronicle No. 157: Descendants of Jubal Watling",
  "summary": "Family Chronicle genealogical table of Jubal Watling's descendants across multiple generations showing family structure and migration to Black River and USA. Primary genealogical document for maternal line.",
  "content_preview": "The Family Chronicle\n\nNo. \t157\t\t\t\t\t\t\t\t\t         April 7, 2008\n\n____________________________________________________________________\n\n\n\nDescendants of Jubal Watling\n\n\n\n\n\t\t1  \tJubal WATLING\tb: Abt. 1790 in Brockdish, Norfolk, England\t; Baptism: August 17, 1823 Syleham, \n\n\t\t\tSuffolk, England; Occupation: Labourer but also may have been a thatcher; \n\n\t\t\t+Susan Susanna LEACH\tb: 1792\t\tm: November 10, 1814 in Metfield, Suffolk County, England\n\n......\t\t2  \tEmily WATLING; b: June 26, 1815 in Syleham, Suf",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-158",
  "title": "Family Chronicle No. 158: Watling",
  "summary": "Family Chronicle on Bathurst Watlings including Alexander MacNaughton Watling (1848-1917) and Catherine Kelly, with family tree documenting Don's extended relatives and their descendants. Connects regional family branches.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n158\t\t\t\t\t\t\t\t\t       May 11, 2008\n\n____________________________________________________________________\n\n\n\n\tWatling\n\n\n\n\t\n\n\t\n\n\tAlexander MacNaughton Watling (1848-1917)\n\t\n\n\tand his wife, Catherine Kelly Watling (1845-1942)\n\t\n\t\t\n\n\n\t\tcourtesy of Judy Watling\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tBathurst Watlings\n\t\n\n\t\n\n\n\t\n\t\n\n\tRecently I was delighted to\n\thear from Judy Watling, my second cousin once removed, who is a\n\tGreat Granddaughter of Alexander and Catherine (Kelly) Watling\n\tpictured above. ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-159",
  "title": "Family Chronicle No. 159: Islands of the Miramichi",
  "summary": "An exploration of the geography and history of Fox Island and other barrier islands at the mouth of the Miramichi River, including Portage, Egg, Huckleberry, Hay, and Neguac Beach islands. Don describes his father's ownership of a marsh on Fox Island and recounts a personal anecdote about making hay there, transporting it by sled behind a Model A car to Little Branch Bridge, then by horse to the barn. The issue discusses the narrow, winding navigation channels and Don's research into floating marshes and historical land-use practices.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n159\t\t\t\t\t\t\t\t\t\tJuly 1, 22008\n\n____________________________________________________________________\n\n\n\n\t \n\t\n\n\n\t\n\n\tIslands\n\tof the Miramichi\n\n\n\n\tI\n\tlived for many years on the Miramichi and, while I knew that there\n\twere Islands at the mouth, I always thought that incoming ships and\n\teven fishing boats could travel most anywhere; that is not the case.\n\t I am beholden to Lynn Gregan for the nautical geography lesson and\n\tnow realize how narrow and winding the entrance channe",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-160",
  "title": "Family Chronicle No. 160: Glenelg Parish and Black River in the 1851 Census",
  "summary": "A detailed analysis of the 1851 Northumberland County Census for Glenelg Parish and Black River, compiled by Donald Edge. The census recorded 281 households with settlers predominantly Scottish and Irish, arriving in the 1820s-1830s. The article catalogs occupations (farmers, fishermen, weavers, teachers), identifies unusual settler names, and documents health challenges and absences. Don's ancestors Alexander and Jane MacNaughton appear as farmers with daughter teachers, while Jubal Watling and Christina appear in household records. The issue concludes with Don's reflection on beech nuts and autumn walks along the family farm's wooded ridge.",
  "content_preview": "The Family Chronicle\n\nNo. 160\t\t\t\t\t\t\t\t\t\t  July 7, 2008\n\n____________________________________________________________________\n\n\n\nGlenelg Parish and Black River in the 1851 Census\n\nBy Donald Edge, November 2001\n\n\n\n\nThe 1851 Northumberland County Census is the earliest record of  households in Glenelg Parish.  The Census contains the names of family members, their sex, relationship, age,  national origin, occupation, religion (if known) and their date of arrival in what was then a colony.  Researche",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-161",
  "title": "Family Chronicle No. 161: Correction",
  "summary": "Don publishes a reader correction from Joan Hyslop to the 1954-1955 grades listing, then shares vintage photos of St. Paul's Presbyterian Church Bible Camp and features a nostalgic list titled \"Things You Don't Hear Anymore,\" capturing mid-century rural Canadian life and parental expressions. The piece showcases Don's role as a curator of community memory and his interest in capturing vanishing cultural practices from his childhood era.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t161\t\t\t\t\t\t\t\t          September 30, 2008\n\n____________________________________________________________________\n\n\n\tCorrection\n\t\nThanks\n\tto Joan (MacDonald) Hyslop for a correction to Chronicle #149.  The\n\tstudents for Grades 10 and 11 should read as follows:\n\t\n\n\t\n\n\t\n\n\tGrade 10\n\t\n\n\tMarjorie Mills\n\t\n\n\tJoan MacDonald\n\t\n\n\tJune L MacDonald\n\t\n\n\tDavid Williston\n\t\n\n\tEva Fraser\n\t\n\n\tWendall Gregan\n\t\n\n\tEleanor Bransfield\n\t\n\n\tMaxine MacDonald\n\t\n\n\tNeil Watling\n\t\n\n\tEdgar MacDonald\n\t\n\n",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-162",
  "title": "Family Chronicle No. 162: History of the Apron:",
  "summary": "Family Chronicle essay on the history and utility of grandma's apron reflecting on rural domestic life and female contributions to household economy. Nostalgic piece fitting Don's broader project documenting community heritage.",
  "content_preview": "The Family Chronicle\n\nNo. 162\t\t\t\t\t\t\t\t\t   October 5, 2008\n\n____________________________________________________________________\n\n  \n\nHistory of the Apron:\n\n\n\n\nThis as sent to me some time ago but unfortunately, I cannot remember by whom. \n\n \n\nThe principal use of Grandma's apron was to protect the dress underneath, but along with that, it served as a potholder for removing hot pans from the oven.\n\n\n\n\nIt was wonderful for drying children's tears, and on occasionally was even used for cleaning out ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-163",
  "title": "Family Chronicle No. 163: A letter mailed to my mother, who was living in Portland, Maine, from my father who was working in W",
  "summary": "Family Chronicle with handwritten letter from Don's father (1910) and anecdote on Bing Crosby's Miramichi roots through the Harrigan/Ahearn families. Illustrates Don's interest in broader community connections and personal correspondence.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t163\t\t\t\t\t\t\t\t\t    October 26, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nA\n\tletter mailed to my mother, who was living in Portland, Maine, from\n\tmy father who was working in Wausau, Wisconsin.  The letter is dated\n\tJanuary 28, 1910; they were married in October of that year.  My\n\tmother’s name was Jane but Dad, and the Glendenning side of the\n\tfamily, always called her Jean\n\t\n\n\n\n\t\n\t\nBing\n\tCrosby and the Miramichi\n\t\n\n\n\n\t\n\t\nT",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-164",
  "title": "Family Chronicle No. 164: John (Jack) MacDonald Watling",
  "summary": "Family Chronicle biography of John MacDonald Watling (1886-1953), Don's maternal uncle who emigrated to USA, with census records and immigration history. Documents family diaspora and genealogical research.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n164\t\t\t\t\t\t\t\t\t  November 2, 2008\n\n\n\n\n\n\nJohn\n(Jack) MacDonald Watling\n\n\n\n\n\n\n\n\n\n\n\n\n\nPhotos\nfrom my Mother’s collection: (Left to right): George, Janet and\nJack Watling; Grace Glendenning with her Jack Watling and,\npresumably, Ernest Watling; Jack, Erdine and son, Ernest; Jack\nWatling\n\n\n\n\n\n\n\nMother’s brother, John\n(Jack) MacDonald Watling, like others in the family, left Black River\nas a young man for life in the USA; unlike others, however, he did\nnot remain in contact.  R",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-165",
  "title": "Family Chronicle No. 165: Undated photo of George and Emma (Ronan*) Watling and son, George Elbridge from Mother’s collection.",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n165\t\t\t\t\t\t\t\t\tNovember 28, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\t\n\n\tUndated photo of George and\n\tEmma (Ronan*) Watling and son, George Elbridge from Mother’s\n\tcollection.  \n\t\n\t\n\n\tCorrected Feb/2010: (*Correction from original)\n\t\n\n\tAnnual fall visit to the\n\tMiramichi\n\t\n\n\t\n\n\n\t\n\t\nI’ve\n\tjust returned from my annual fall visit to Black River and, as is my\n\tcustom, managed to tour most of the area including the road to\n\tMacBeath’s Brid",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-166",
  "title": "Family Chronicle No. 166: Black River Agricultural Society #103",
  "summary": "Family Chronicle listing 80+ members of Black River Agricultural Society #103 (1942-48) where Don's father and brother Walter served as Secretary Treasurer. Documents agricultural community and family institutional roles.",
  "content_preview": "The Family Chronicle\n\nNo. 166\t\t\t\t\t\t\t\t\tDecember 10, 2008\n\n____________________________________________________________________\n\n\n\nBlack River Agricultural Society #103\n\n\n\n\nReaders will remember that my father, Elmer Glendenning, and later my brother, Walter Glendenning, were Secretary Treasurers of Black River Agricultural Society, #103 for about 35 years.\n\n\n\n\nThe following list of members of the Black River Agricultural Society comes from a record book maintained during the period 1942-48 by Wal",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-167",
  "title": "Family Chronicle No. 167: Undated photo of John W. and Elspeth (Watling) MacNaughton",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t167\t\t\t\t\t\t\t\t\tDecember 26, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\t\n\n\tUndated photo of John W. and Elspeth (Watling) MacNaughton\n\t\n\n\t\n\n\n\t\n\t\n\n\tGreetings Black River\n\tHistorians and Genealogists, \n\t\n\n\tBelow please find the\n\tstatistics gathered by Farquhar McRae for the 1834 census in the\n\tParish of Glenelg. As most of you know, Glenelg includes the\n\tsouthern half of Napan as well as Black River and its environs. I\n\tbelieve Don Edge ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-168",
  "title": "Family Chronicle No. 168: My mother and father set up housekeeping in Parksville, Tenn on February 11, 1911. Dad and Mum (hold",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n168\t\t\t\t\t\t\t\t\tJanuary 2, 2009\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nMy\n\tmother and father set up housekeeping in Parksville, Tenn on\n\tFebruary 11, 1911. Dad and Mum (holding Grace born Sept. 1913) with\n\tAunt Janet (Watling).  Uncle Ern Watling and Mac MacDonald also\n\tworked on the project.\n\t\n\n\n\n\t\n\t\nA\n\tfollow-up note from Barry MacKenzie \n\t\n\n\n\n\t\n\t\n\n\tI also came across the 1840\n\tGlenelg statistics today at the PANB. The docume",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-169",
  "title": "Family Chronicle No. 169: An undated photograph of “Edythe Watlin” from Caryl Savard",
  "summary": "Don's speculative genealogical research on Jubal Watling (born 1790, married Susan Leach in 1814), who Don believed moved to Prince Edward Island after Susan's death in England in 1829. Using PEI records of a second marriage to Louisa in 1831, census data, and photographs from researcher Caryl Savard, Don constructs a theory that Charles Watling (born 1846-47) could be Jubal's son with Louisa, making Edythe and Ambrose Watling his grandchildren. Don acknowledges the circumstantial but plausible nature of this connection, noting Jubal's age and the tight timeline present challenges to verification.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n169\t\t\t\t\t\t\t\t\t      March 1, 2008\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tAn undated photograph of “Edythe Watlin” from Caryl Savard\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tAn undated photograph of Ambrose Watlin from Caryl Savard\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tSome Watling speculation\n\t\n\n\t\n\n\n\t\n\t\n\n\tAn email from Caryl Savard\n\tcaused me to revisit my notes about my GGGrandfather, Jubal Watling\n\twho, according to family lore, lived on Prince Edward Island.",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-170",
  "title": "Family Chronicle No. 170: Recognize this view of Black River??",
  "summary": "Family Chronicle on local Black River postcards, history of haywire/binder twine terminology, and rural farm equipment. Reflects Don's interest in material culture and linguistic history of agricultural community.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n170\t\t\t\t\t\t\t\t\t     March 6, 2009\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\n\t\n\n\t\n\n\tRecognize this view of\n\tBlack River??\n\t\n\n\t\n\n\n\t\n\t\n\n\tBarry Mackenzie, “a\n\tcollector of local postcards, and this one was generously given to\n\tme by Joan Menzies of Miramichi from her own collection…“wonders\n\tif readers know where this was taken?  Barry also wonders if readers\n\tknow of other Black River postcards of yesteryear.  If you have one,\n\tsend me a co",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-171",
  "title": "Family Chronicle No. 171: James A. and Kate (Mills) Watling",
  "summary": "A comprehensive snapshot of Black River in 1939, Don's childhood home, documenting approximately 120 homes, four one-room schools, two churches (St. Stephen's United and St. Paul's Presbyterian), basic infrastructure (two grocery stores, two blacksmiths, water and diesel-powered sawmills), and daily life without electricity, paved roads, indoor plumbing, or public transportation. The issue catalogs settlement names (Little Branch, Hexham, Upper Settlement, Sturgeon Cove), transportation methods, occupations, domestic practices, and community traditions. Don solicits corrections and additional recollections from readers familiar with the area.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n171\t\t\t\t\t\t\t\t\t\tApril 6, 2009\n\n\n\t\n\n\n\t\n\n\n\n\t\n\n\t\n\n\t\n\n\n\n\n\tJames\n\tA. and Kate (Mills) Watling\n\t\n\n\t(Jane\n\tGlendenning Collection)\n\t\n\n\tErnest\n\tand Alice (MacLean) Watling\n\t\n\n\t(Jane\n\tGlendenning Collection)\n\n\n\n\n\tBlack\n\tRiver\n\t\n\n\t\n\n\n\t\n\t\n\n\tThis\n\tis a first attempt to describe the Black River in 1939 as I remember\n\tit:\n\t\n\t\t\n\n\n\t\tIncluded\n\t\tLittle Branch, Fowlie’s Mill, the back road (between Fowlie’s\n\t\tMill and Jim Cameron’s on the north side of  the Little Branch\n\t\tRiver), Hexham, t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-172",
  "title": "Family Chronicle No. 172: MRHS Graduation class of 1954.  From left to right, front row: Babette Noble, Annie Williston, Ruth",
  "summary": "Family Chronicle on MRHS 1954 graduation photo, correction to earlier anecdote about brothers, whiffle tree explanation, and Agricultural Society pricing (1942-1944). Continues Don's documentation of community life.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.172\t\t\t\t\t\t\t\t\t\tMay\n6, 2009\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\t\n\n\tMRHS Graduation class of 1954. \n\tFrom left to right, front row: Babette Noble, Annie Williston, Ruth\n\tLewis, Margaret Watling, and Barbara Godfrey.  Second row:\n\tPhilip Williston, Ingram Fowlie, Edward Godfrey, and, Douglas\n\tWilliston (Thanks to Eddie and Barbara for confirming names) \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tCorrection – Chronicle\n\t170\n\t\n\n\tBrother Ken tells me that\n\t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-173",
  "title": "Family Chronicle No. 173: Elmer and Jane (Watling) Glendenning",
  "summary": "Don investigates the origin of \"Millers Bridge\" name through correspondence with community historian Barry MacKenzie, including archival 1851 census references. The issue also features vintage Burma Shave advertising slogans from the 1940s and a correction about his 1938 school photo at Little Branch School. These pieces reveal Don's methodical approach to local historical research and his nostalgia for mid-twentieth century American popular culture.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n173\t\t\t\t\t\t\t\t\t       May 16, 2009\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\t\n\n\t\n\n\tElmer and Jane (Watling)\n\tGlendenning\n\t\n\n\t(Jane\n\tGlendenning Collection)\n\t\n\n\t\n\n\n\t\n\t\nMillers\n\tBridge\n\t\nReaders\n\twill know that I have been trying to discover the origin the name\n\t“Millers Bridge” – the bridge between Norman Glendenning’s\n\tproperty and the Little Branch School.  My enquiry to Barry\n\tMacKenzie brought the following response: \n\t\n\t\n\n\n\n\t\n\t\n“To\n\t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-174",
  "title": "Family Chronicle No. 174: Thanks to Barry Mackenzie for the following:",
  "summary": "Don publishes detailed nineteenth-century school records from 1880, including teacher names, trustees, student rosters with ages, and examination records for Upper and Middle Black River schools. These documents contain numerous Glendenning family members and relatives, demonstrating Don's passion for preserving primary source documents showing his community's educational institutions and family connections across generations.",
  "content_preview": "The Family Chronicle\n\nNo. \t174\t\t\t\t\t\t\t\t\t       May 24, 2009\n\n____________________________________________________________________\n\n\n\nThanks to Barry Mackenzie for the following:\n\n\n\n\nSchool Life in Upper Black River in April 1880:\n\n\n\nTeacher: Maggie M. MacIntosh; Class II; Salary of $130.00/year.\n\nTrustees: Donald McBeath, Robert McNaughton, and Donald Cameron.\n\nTotal of teaching days in term (3rd Nov. 1879 to 30th April 1880): 117.\n\nGrand total of days’ attendance by students: 1661.\n\nOn average, ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-175",
  "title": "Family Chronicle No. 175: Juno Beach, Normandy, France",
  "summary": "Family Chronicle D-Day memorial (June 6, 1944) with Shirley MacKay's account of news arriving about Major Archie MacNaughton (Don's cousin) who was killed leading North Shore Regiment. Significant WWII family loss and military connection.",
  "content_preview": "The\n\tFamily\n\tChronicle\n\t\n\n\tNo.\n\t175\t\t\t\t\t\t\t\t\t    June 6, 2009\n\t\n\n\t___________________________________________________________________\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tJuno\n\tBeach, Normandy, France\n\t\n\n\twhere\n\tNorth Shore Regiment landed on D-Day, June 6, 1944\n\n\n\n\t\n\n\n\t\n\t\nMemories\n\tof D-Day\n\t\n\n\n\n\t\n\t\nThe\n\tfollowing recollections of D-Day by Shirley MacKay were contained in\n\ta note sent to Francis MacNaughton, son of Archie and Grace\n\tMacNaughton and is included here with Shirley’s permission.  (For\n\tyounger readers,",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-176",
  "title": "Family Chronicle No. 176: Undated photo of the Editor as a young man",
  "summary": "Family Chronicle promoting 300-page book 'The Neighbourhood: Black River Bridge, New Brunswick circa 1939' documenting all households and their genealogies. Major project demonstrating Don's commitment to community archival work.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n176\t\t\t\t\t\t\t\t\t\tJuly 22, 2009\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tUndated photo of the Editor\n\tas a young man\n\t\n\n\t(Little Branch River in\n\tbackground)\n\t\n\n\n\n\t\n\t\nBlack\n\tRiver in 1939\n\t\n\n\n\n\t\n\t\nReaders\n\tmay recall a couple of earlier Chronicles in which I listed in\n\tsequence all the households in Black River.  On a recent trip to the\n\tMiramichi, I delivered a few copies of the completed document to\n\trelatives and present",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-177",
  "title": "Family Chronicle No. 177: PUBLICATIONS",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n177\t\t\t\t\t\t\t\t\t October 15, 2009\n\n____________________________________________________________________\n\n\n\n\t \n\t\n\n\tPUBLICATIONS\n\t\n\n\t1\tThe\n\tFirst 100 –\n\tI’ve copied and bound the first 100 issues of the Family Chronicle\n\t\n\n\t and they are available\n\tfor purchase at a cost of $35.00; they are also available free on\n\tthe website at www.glendenning.net/don.\n\t\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t2\tThe\n\tNeighbourhood:  Black River Bridge, New Brunswick, circa 1939\n\t                                     ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-178",
  "title": "Family Chronicle No. 178: Summer Bible Camp at St. Stephen’s United Church about 1953",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n178\t\t\t\t\t\t\t\t\t    October 26, 2009\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\n\t\n\n\t\n\n\tSummer Bible Camp at St. Stephen’s United Church about 1953\n\t\n\n\t\n\n\n\t\n\n\n\n\tBedford Peters (Thanks to\n\tBetty Peters)\n\t\n\n\t\n\n\n\t\n\t\n\n\tBay of Chaleur Forgotten\n\tTreasures by A. J. McCarthy tells the following story (pp115-116)\n\t\n\n\t\n\n\n\t\n\t\n\n\t\"Another family feud\n\tthat ended in a death occurred on April 27, 1916, in the remote\n\tsettlement of Canobie.  At midnight, ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-179",
  "title": "Family Chronicle No. 179: The old fashioned way",
  "summary": "Don reflects on a tour of Dr. Roy Montgomery's farm equipment collection, noting a Farmall Cub's hand-crank operation. The issue includes wartime newspaper clippings on peanut butter rationing and extensive details about the Tucker automobile's 1948 innovation. These pieces reveal Don's interest in mechanical history and mid-twentieth century technological change.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t179\t\t\t\t\t\t\t\t\tNovember 8, 2009\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\tThe old fashioned way\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tRecently I was part of a tour of the collection of early\n\tagricultural equipment owned by Dr. Roy Montgomery, Birch Hill, PEI.\n\t Although of post-war vintage, this Farmall Cub farm tractor\n\trequired a crank and elbow grease to start.\n\t\n\n\t\n\n\n\t\n\t\nFrom\n\ta wartime newspaper\n\t\n\n\n\n\t\n\t\nThe\n\tCommercial of September 16, 1943 car",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-180",
  "title": "Family Chronicle No. 180: Branchview Farm",
  "summary": "Family Chronicle documenting Branchview Farm history from 1914 purchase through modernization by Don's brother Norman, detailing property evolution and agricultural development. Important family property and career legacy.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n180\t\t\t\t\t\t\t\t\tDecember 9, 2009\n\n____________________________________________________________________\n\n\n\n\t \n\t\n\n\t\n\n\t\n\n\tBranchview\n\tFarm\n\n\n\n\t\n\n\n\t\n\t\nA\n\tCentury of Change\n\t\n\n\n\n\t\n\t\nOn\n\tJuly 21, 1914, Elmer and Jane (Watling) Glendenning purchased the\n\t“Jessie MacDonald” property at Little Branch; the property was\n\tone-half of the original grant (225 acres) to Alexander MacDonald on\n\tJune 3, 1812, who on his death, bequeathed half to his daughter,\n\tJessie, and the other half to ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-181",
  "title": "Family Chronicle No. 181: Thanks to Barbara (MacColl) Somers for the above.",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n181\t\t\t\t\t\t\t\t\tJanuary 31, 2010\n___________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nThanks\n\tto Barbara (MacColl) Somers for the above.\n\t\n photo\n\tof St. Stephen’s Choir from the Bessie Edge's collection.  Barry\n\tMackenzie and Everard MacLean \n\t\nwere\n\table to identify a few faces and think that the back row includes \n\tMamie McKay and John E. MacLean; Middle Row includes Nellie McKay\n\tand Katie (Watling) MacLean; Front Row includes Ruby MacLean",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-182",
  "title": "Family Chronicle No. 182: Black River Picnic",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n182\t\t\t\t\t\t\t\t\t    February 2, 2009\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t Black River Picnic\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\nBarry\n\tMackenzie commented that “As for the picnic group, a few faces\n\tlook familiar. I believe Bessie Edge is standing third from the\n\tright in the back row. Also, the gentleman in the chair with the\n\tlong black beard on the far right looks like Donald M. Watling\n\t(James TD and Dick's father) to me. Any ideas on others?",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-183",
  "title": "Family Chronicle No. 183",
  "summary": "",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n183\t\t\t\t\t\t\t\t\t    March 12, 2010\n\n____________________________________________________________________\n\n\n\t \n\t\n\n\t\n\n\t\n\n\tPeter Stewart 1812-1891\n\t\n\n\tCatherine (Stewart)\n\tMacNaughton was my Great, Great. Great Grandmother.  Her brother,\n\tPeter shown above, would be my Great, Great, Great Great Uncle\n\t\n\n\t\n\n\n\t\n\t\n\n\tThanks to Ellen MacNaughton\n\tfor the above photo and the following note:\n\t\n\n\t\n\n\n\t\n\t\n\n\t“Attached are two\n\tletters I scanned this evening.  The letters are from Peter\n\t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-184",
  "title": "Family Chronicle No. 184: A wood pile and a wood cutter",
  "summary": "Family Chronicle reprinting George H. Hayward's article on cutting firewood in rural New Brunswick with Don's comparison to his own rural experience. Reflects on rural labor practices and community traditions.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n184\t\t\t\t\t\t\t\t\t    March 25, 2010\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tA wood pile and a wood cutter \n\t\n\t\n\n\tat Norman Glendenning’s\n\t\n\n\tUndated, Glendenning collection\n\t\n\n\n\n\t\n\t\n\n\tThe\n\tfollowing is reprinted from Generations,\n\tthe Journal of the New Brunswick Genealogical Society, (Winter 2009)\n\twith permission of the author, George H Hayward.  \n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\tMy\n\trecollections of cutting, blocking and splittin",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-185",
  "title": "Family Chronicle No. 185: WW1",
  "summary": "Family Chronicle #185 (March 2010) curated by Don Glendenning presents WWI postcards and historical documents about family members Ernest Watling and Private Alex McNaughton of the 26th Overseas Battalion, with context about Black River during the war era.",
  "content_preview": "The\n\tFamily\n\tChronicle\n\t\nNo.\n\t185\t\t\t\t\t\t\t\t\t    March 31, 2010\n\t\n____________________________________________________________________\n\n\n\n\t\n\n\n\t\n\n\n\n\tWW1\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tPost card dated St. John, N.B. 1915 sent to Jane Glendenning from\n\ther brother Ernest Watling who, I believe, was in Sussex prior to\n\tshipping overseas.\n\t\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\nThe\n\tFamily Chronicle (Copyright)\n\tis an occasional newsletter published by Don Glendenning and posted\n\ton the family website.  It is intended to share in",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-186",
  "title": "Family Chronicle No. 186: WW1 Letters",
  "summary": "Family Chronicle #186 (April 2010) features WWI letters to Don's mother Jane (Watling) Glendenning, including Guy Glendenning's correspondence from the trenches and a photo of Don at Vimy Ridge, documenting family sacrifice during the Great War.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n186\t\t\t\t\t\t\t\t\t        April 7, 2010\n\n____________________________________________________________________\n\n\n\n\n\n\nWW1\nLetters\n\n\n\n\n\n\n\n\t\n\n\t\n\n\t\n\n\n\n\n\n\tLetter\n\tdated October 21, 1916 sent to Jane (Watling) Glendenning; although\n\tsignature is missing, I am sure that it was written by her nephew,\n\tJimmie Adams\n\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tDon\n\ttaken at Vimy Ridge\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tLooking\n\tover the “German” side from Vimy ridge",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-187",
  "title": "Family Chronicle No. 187: WW1 Letters",
  "summary": "Family Chronicle #187 (April 2010) presents WWI letters from Guy W. Glendenning (Don's uncle) and Jimmie Adams to his mother Jane, providing intimate wartime correspondence and family context that shaped Don's childhood.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n187\t\t\t\t\t\t\t\t\t April 14, 2010\n\n____________________________________________________________________\n\n\n\n\n\n\n\n\tWW1\n\tLetters\n\t\n\n\n\n\t\n\n\n\n\t\n\n\t\n\n\t\n\n\n\t\n\t\n\n\tLetter dated 3-11-17 from Guy\n\tW. Glendenning to Mrs. John MacKenzie (Aunt Tine) thanking her for a\n\tparcel.  From the envelope, it seems that Aunt Tine sent the\n\tenvelope to her sister, Jane Glendenning, married to Guy’s\n\tbrother, Elmer, who was living at Langley Field Virginia, USA.  At\n\tthe time of writing, Guy had been in t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-188",
  "title": "Family Chronicle No. 188: Group Photo",
  "summary": "Family Chronicle #188 (2010) describes the 33rd annual Glendenning family reunion and provides historical research on Glenelg Parish by genealogist Donald Edge, connecting Don's family ancestry to Scottish origins and New Brunswick settlement patterns.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t188\t\t\t\t\t\t\t\t\t      , 2010\n\n____________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tGroup Photo\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tBrothers Don, Ken and Norm\n\tGlendenning\n\t\n\n\n\n\t\n\t\nGlendenning\n\tReunion\n\t\n\n\n\n\t\n\t\nDescendants\n\tof Elmer and Jane (Watling) Glendenning gathered for their 33rd\n\tconsecutive annual family reunion on Saturday, July 31, 2010.  The\n\treunion was held in Point Aux Carr, at the cottage of Ken and Verne\n\tGlendenning.  Among those ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-189",
  "title": "Family Chronicle No. 189: 80th anniversary Celebrated",
  "summary": "Family Chronicle #189 (August 2010) documents the 80th anniversary of St. Paul's Presbyterian Church in Black River (where Don was baptized) and includes financial records from Don's brother Walter's farm accounting in the 1940s, illustrating rural life and family enterprise.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n189 \t\t\t\t\t\t\t\t\t      August 27, 2010\n\n\n\t\n\n\n\t\n\t\n80th\n\tanniversary Celebrated \n\t\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tCutting the cake, from the\n\tleft, Rev. Krunys, Minister, Mrs. Edith (Cameron) Bremner a member\n\tof the choir in 1930,  Kenneth Glendenning, Clerk of Session and Don\n\tGlendenning who was baptized the day the church as officially\n\topened..\n\t\n\n\n\n\t\n\t\nOn\n\tJuly 18, 2010, St. Paul’s Presbyterian Church, Black River Bridge\n\tcelebrated its 80th\n\tanniversary.  Special speaker was Rev. B",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-190",
  "title": "Family Chronicle No. 190: MacLaughlin driving wagon, early 1900’s",
  "summary": "Family Chronicle #190 (September 2010) features nostalgic recollections of 1920s-era transportation, a MacLaughlin wagon exhibit, and an in memoriam poem, reflecting Don's personal memories of rural community life and family history.",
  "content_preview": "The\nFamily\nChronicle\n\n\nNo.\n190\t\t\t\t\t\t\t\t\t September 3, 2010\n\n\n\t\n\n\t\n\n\tMacLaughlin driving wagon,\n\tearly 1900’s\n\t\n\n\n\n\t\n\t\nThe\n\twagon pictured above was found on the second floor of the Gill\n\tCarriage shop in Eliotvale, PEI.  The wagon, although no nameplate\n\twas found, is believed to be manufactured by the MacLaughlin Company\n\tof Ontario (later the MacLaughlin Buick Motor Company) driving\n\twagon. The wagon is owned by John Gill who, along with his father,\n\twas a carriage maker, ceasing the business s",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-191",
  "title": "Family Chronicle No. 191: Black River Community Hall",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. \t191\t\t\t\t\t\t\t\tSeptember 12, 2010\n\n____________________________________________________________________\n\n\n\n\n Black River Community Hall \n\n\n\nOn October 20, 1930, the first loads of gravel and sand were taken to the site of the first Black River Community Hall; on May 25, 1931 the first dance was held.  (Chronicles 96, 97 and 103) The Chatham Gazette of Friday, August 26, 1932 reported that the hall had been completely destroyed by fire.   Reconstruction commenced on April 1",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-192",
  "title": "Family Chronicle No. 192: Church Union",
  "summary": "Family Chronicle #192 analyzes the 1925 Church Union that divided Presbyterian congregations in Black River, explaining historical context and theological divisions that affected Don's community and shaped local institutional memory.",
  "content_preview": "The Family Chronicle\n\nNo. 192 _______________________________________________________________\n\n Church Union\n\n\n\n\nI’ve avoided mentioning church union of 1925; however, it was a significant event and one that strained relationships in Black River for many years.  I’ve decided to avoid it no longer.  Tensions were evident when I was young, and may well exist among some of the older generation even today.  The decision even split some families\n\n\n\n\nHere is my understanding based on my personal knowl",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-193",
  "title": "Family Chronicle No. 193: Black River Photos",
  "summary": "Family Chronicle #193 (October 2010) presents photographs and memories of Black River in the 1950s and recalls road construction techniques used during Don's childhood, preserving technical and social history of rural infrastructure development.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n193\t\t\t\t\t\t\t\t\t   October 2, 2010\n\n____________________________________________________________________\n\n\n\tBlack River Photos\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tMoose in Jim Adams’ yard, probably early 1950’s\n\t\n\n\t\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tRainbow over Black River\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\t\n\n\t\n\n\tLittle Branch River taken from school yard\n\t\n\n\n\n\t\n\t\nRoad\n\twork\n\t\n\n\n\n\t\n\t\nThis\n\thas been a busy summer for road construction on PEI, mostly\n\trebuilding, widening, intersections, paving and some bridge repair. \n\tWatchin",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-194",
  "title": "Family Chronicle No. 194: Neighbours/People/Characters:",
  "summary": "Family Chronicle #194 (October 2010) catalogs neighbors and local characters from Don's childhood in Black River circa 1939, providing social documentation of rural Miramichi life and the community that shaped his formative years.",
  "content_preview": "The Family Chronicle\n\nNo. 194\t\t\t\t\t\t\t\t\tOctober 10, 2010 ___________________________________________________________________\n\n Neighbours/People/Characters:\n\n\n\n\nThere always seemed to be something going on at our house.  This was partly because we were a large family and active in the community, but also because my father, as Secretary Treasurer of Agricultural Society #103, operated the “store” for its members.  People from Black River and neighbouring communities came to our place to pick up far",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-195",
  "title": "Family Chronicle No. 195: New Bandon, NB",
  "summary": "",
  "content_preview": "The Family Chronicle\n\nNo. 195\t\t\t\t\t\t\t\t\tOctober 18, 2010\n\n____________________________________________________________________\n\nNew Bandon, NB\n\n\n\n\nThe following notes about New Bandon were taken from an undated article by Kevin Mann, Jr.  Although the source is unknown, the font size and style reminds me of the Moncton Times Transcript and is thought to have been written about 1982.\n\nSeventy families came from Bandon, Ireland to New Bandon, NB in 1816\n\nShips sailing to St. Peters, now Bathurst bro",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-196",
  "title": "Family Chronicle No. 196: Typical Community Events",
  "summary": "Family Chronicle #196 (October 2010) describes community events—school closings, church harvest festivals, local celebrations—illustrating the social and cultural fabric of Don's childhood in 1930s-40s Miramichi.",
  "content_preview": "The Family Chronicle\n\nNo. 196\t\t\t\t\t\t\t\t\t   October 24, 2010\n\n____________________________________________________________________\n\n \n\nTypical Community Events\n\n\n\n\nSchool closings – the Little Branch School, like other one-room schools, held both a Christmas and June school closing; the public was invited to both.  The school was swept and tidied up, Christmas or floral designs were stenciled on the blackboards and student names and standing by grade were also listed on the blackboard.  Then there ",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-197",
  "title": "Family Chronicle No. 197: Significant Dates in the Life of Black River",
  "summary": "Family Chronicle #197 (October 2010) compiles a chronological reference timeline of Black River history from 1785–1928, documenting community institutions, natural events, and settlement patterns essential to understanding Don's ancestral environment.",
  "content_preview": "The Family Chronicle\n\nNo. \t197\t\t\t\t\t\t\t\t\t    October 31, 2010\n\n____________________________________________________________________\n\n \n\nSignificant Dates in the Life of Black River\n\n\n\n\nThis is a first attempt to develop a list of significant dates for Black River; dates are based on best available information. Additions, comments and corrections welcomed.  \n\n\n\n\nYear\t\t\tEvent\n\n\n\n\n1785\t\tNorthumberland County established\n\n?\t\tLand grant awarded to Desaulnier and Marsten near mouth of Black River\n\n1812\t",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-198",
  "title": "Family Chronicle No. 198: From Donald Edge",
  "summary": "Family Chronicle #198 (November 2010) features historian Donald Edge's commentary on family anecdotes and local history, plus Don's recollection of music from his childhood—hymns and popular songs that soundtrack his early memories.",
  "content_preview": "The Family Chronicle\n\nNo. 198\t\t\t\t\t\t\t\t\tNovember 4, 2010\n\n____________________________________________________________________\n\nFrom Donald Edge\n\n\n\nThere is a family story that Duncan MacNaughton (1787-1824) was going down the Black River on a raft of logs and commented that Alexander Gunn's Point would be a wonderful place for a cemetery. Not long after he was killed by a falling tree while clearing his land on the Little Branch back road.  He was the second person buried in the common burial gro",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-199",
  "title": "Family Chronicle No. 199: On these pages is my complete ancestor tree, complete at least, as I now know it.  Because of the le",
  "summary": "Family Chronicle #199 (November 2010) presents Don's complete ancestor genealogical tree combining paternal and maternal lines, documenting his ancestry and establishing familial connections for descendants.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n\t199\t\t\t\t\t\t\t\t\tNovember 7, 2010\n\n____________________________________________________________________\n\n\n\n\n\n\nOn\nthese pages is my complete ancestor tree, complete at least, as I now\nknow it.  Because of the length, I was unable to show a complete\nchart on one page.  Instead, I printed my mother’s and father’s\nancestry charts separately; mine is the combination of the two.  The\nbad news is that, if any ancestor on either chart is an ancestor of\nyours, then we are related.",
  "theme": "02-family-chronicle"
 },
 {
  "slug": "chronicle-200",
  "title": "Family Chronicle No. 200: On Reaching 200",
  "summary": "Family Chronicle #200 (November 2010) celebrates reaching 200 newsletter editions, recounting Don's genealogical discoveries, international correspondence, and achievements in connecting family members across generations and continents.",
  "content_preview": "The\nFamily\nChronicle\n\nNo.\n200\t\t\t\t\t\t\t\t\tNovember 11, 2010\n\n__________________________________________________________________\n\n\n\t\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\n\n\t\n\t\n\n\n\n\t\n\t\n\n\n\t\n\n\t\nOn\n\tReaching 200\n\t\n\n\n\n\t\n\t\nPhotos\n\t\n\n\n\n\t\n\t\nSome\n\tspectacular sunrises and sunsets at our cottage on Orwell Bay, P.E.\n\tI., Canada.\n\t\n\n\n\n\t\n\t\nAlong\n\tthe way, I:\n\t\n\t\t\n\nWas\n\t\tin touch with descendants of all five of the original Harley\n\t\tsiblings, of which my Great Grandmother, Margaret (Harley) was one",
  "theme": "02-family-chronicle"
 }
]